<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv='Content-Type' content='text/html; charset=ISO-8859-15'></meta>
<title>JAuswertung</title>
<link rel="stylesheet" href="style.css" type="text/css"></link>
</head>
<body>
<hr />
<h1 class="title">JAuswertung</h1>

<p>JAuswertung ist ein Programm der neuesten Generation zur Durchf&uuml;hrung und Protokollierung von Wettk&auml;mpfen. Dabei spielt es keine Rolle, ob Sie Meisterschaften oder Freundschaftswettk&auml;mpfe durchf&uuml;hren wollen. Sie sind nicht an vorgegebene Disziplinen gebunden und k&ouml;nnen einfach neue Altersklassen, Disziplinen, Regelverst&ouml;&szlig;e u. &auml;. festlegen. Auch um die Einteilung der L&auml;ufe (sowohl f&uuml;r den schwimmerischen Teil, als auch bei der HLW) m&uuml;ssen Sie sich keine Sorgen machen. JAuswertung kann eine Laufeinteilung nach Ihren W&uuml;nschen erstellen. Sollten Sie diese sp&auml;ter anpassen wollen, wird JAuswertung Sie auch dabei unterst&uuml;tzen. </p>

<p>Zentrales Augenmerk wurde auf Bedienkomfort und hohe Eingabegeschwindigkeit gelegt. Wenn Sie z.B. in den Ergebnissen einen Fehler entdecken, k&ouml;nnen Sie diesen dort direkt &auml;ndern, wobei es keine Rolle spielt, ob es sich um eine falsche Zeit, einen falsch eingetragenen Regelversto&szlig; oder einen falsch geschriebenen Namen handelt. Die laufweise Zeiteneingabe erm&ouml;glicht es Ihnen, Zeiten so wie sie bei Ihnen ankommen, direkt einzugeben. Diese Eingabemethode ist so effizient, dass Sie keine Probleme h&auml;tten, mehrere Wettk&auml;mpfe gleichzeitig auszuwerten.</p>

<p>Meldungen werden meist in einer Tabellenkalkulation verwaltet, bis Sie dann in ein Auswertungsprogramm &uuml;bertragen werden. Auch dabei unterst&uuml;tzt Sie JAuswertung. Wenn die Daten als Excel- oder CSV-Datei vorliegen, k&ouml;nnen diese direkt importiert werden. Bei vielen Wettk&auml;mpfen wird ein Gesamtsieg an die erfolgreichste Gliederung vergeben. Auch eine Gesamtwertung m&uuml;ssen Sie nicht von Hand berechnen. Aktivieren Sie einfach die Gesamtwertung und stellen Sie sie nach Ihren W&uuml;nschen ein.</p>

<p>Dar&uuml;ber hinaus kann JAuswertung die eingegebenen Daten &uuml;berpr&uuml;fen und viele Fehler wie z.B. fehlende Zeiten oder bei nachtr&auml;glich hinzugef&uuml;gten Teilnehmern fehlende Eintragungen in die Laufliste erkennen. Anstatt also an verschiedenen Orten die Korrektheit Ihrer Daten &uuml;berpr&uuml;fen zu m&uuml;ssen, k&ouml;nnen Sie diese Informationen an einer Stelle abfragen und sofern sinnvoll auch direkt beheben. Weiterhin kann JAuswertung auch &uuml;berpr&uuml;fen, ob die eingegebenen Daten plausibel sind und Sie so z.B. bei sehr niedrigen oder hohen Zeiten informieren.</p>
<br/><p align="center">
<img src="pics/jauswertung.png" width="699" height="652" /><br/>
<em>JAuswertung</em></p><br/>
<hr />
<h1 class="title">Features</h1>
<h2>Die wichtigsten Eigenschaften in K&uuml;rze</h2>

<ul><li>
<p>Die Eingabe von Daten ist einfach, schnell und intuitiv.</p>
</li><li>
<p>Komfortable Eingabe von Schwimmern und Teams sowie zahlreiche Import- und Exportfunktionen.</p>
</li><li>
<p>Es werden das Regelwerk der DLRG, sowie Teile des internationalen Regelwerks unterst&uuml;tzt. Dar&uuml;ber hinaus k&ouml;nnen auf Wunsch auch weitere Regelwerke eingebunden werden.</p>
</li><li>
<p>Lauf- und HLW-Listen k&ouml;nnen automatisch erstellt und nach Belieben ver&auml;ndert werden.</p>
</li><li>
<p>Altersklassen k&ouml;nnen inklusive der dazugeh&ouml;rigen Disziplinen frei definiert und zur Wiederverwendung gespeichert werden. &Auml;nderungen an den Altersklassen sind auch w&auml;hrend eines Wettkampfs noch m&ouml;glich.</p>
</li><li>
<p>Kombinierte Auswertung mehrerer Wettk&auml;mpfe mit getrennten Ergebnissen.</p>
</li><li>
<p>Die Regelwerksverst&ouml;&szlig;e des  Regelwerks der DLRG sind komplett verf&uuml;gbar. Dar&uuml;ber hinaus k&ouml;nnen w&auml;hrend eines Wettkampfs neue definiert bzw. aus bestehenden abge&auml;ndert werden (z.B. bei einem Fr&uuml;hstart wird bei der Vergabe der Strafe "des dritten Schwimmers" hinzugef&uuml;gt). Zur Unterst&uuml;tzung k&ouml;nnen vergebene Strafen mit allen n&ouml;tigen Informationen (Schwimmer, Lauf, Bahn, Strafpunkte etc.) direkt ausgedruckt werden.</p>
</li><li>
<p>Umfangreiche Druckfunktionen aller ben&ouml;tigten Daten:
<ul><li>
<p>Lauflisten (in unterschiedlichen Versionen f&uuml;r Mannschaftsbetreuer und verschiedene Kampfrichterpositionen), Startkarten (auch HLW), Ergebnisse, ...</p>
</li><li>
<p>Leere Start-, Zieleinlauf- und Strafpunktekarten sowie HLW-Checklisten</p>
</li></ul>
</p>
</li></ul>
<h2>Datenimport und -export</h2>

<p>Sie k&ouml;nnen Meldungen, Kampfrichterliste, Mannschaftsmitglieder sowie die Ergebnisse der HLW direkt aus CSV- oder Excel-Dateien importieren. Dazu verwenden Sie am besten die offiziellen Vorlagen. Diese finden Sie in einem einzelnen Download auf <a target="_blank" href="http://www.dennismueller.de">http://www.dennismueller.de</a></p>

<p>Sie k&ouml;nnen die Daten wie z.B. Meldelisten, Startkarten (Seriendruckvorlage), Lauflisten, HLW-Listen oder Ergebnisse eines Wettkampfs auch exportieren. Dabei stehen Ihnen verschiedene Formate wie z.B. Excel, HTML, XML, CSV oder PDF zu Auswahl bereit. So k&ouml;nnen die Informationen direkt im Internet pr&auml;sentiert (HTML), zum Download angeboten (z.B. Excel und PDF) oder zur Aufbereitung z.B. zum Urkundendruck (XML, CSV und Excel) weitergegeben werden.</p>
<hr />
<a name="paket__begin" /><h1 class="title">Programme</h1>

<p>Das Programmpaket JAuswertung bietet die gesamte Funktionalit&auml;t, die zur Auswertung von Wettk&auml;mpfen nach DLRG-Regelwerk ben&ouml;tigt wird. Dabei stehen innerhalb der Programme einige Funktionen nur dann zur Verf&uuml;gung, wenn Sie sinnvoll sind. Z.B. k&ouml;nnen Startkarten nur dann gedruckt werden, wenn auch die Laufliste mit JAuswertung verwaltet wird.</p>
<h2>JAuswertung aktualisieren</h2>

<p>Um JAuswertung zu aktualisieren, deinstallieren Sie die alte Version. Anschlie&szlig;end k&ouml;nnen Sie die neue Version installieren. Sie sollten nicht versuchen, eine neue Version &uuml;ber eine &auml;ltere zu installieren, da dies zu fehlerhaftem Verhalten f&uuml;hren kann. Dar&uuml;ber hinaus ist eine saubere Deinstallation dann nicht mehr m&ouml;glich.</p>
<h2>Installation</h2>

<p>Zur Installation laden Sie sich bitte das ihrem Betriebssystem entsprechende Installationsprogramm herunter (siehe Kapitel <a href="#download__begin">Download</a>). Starten Sie das Installationsprogramm und folgen Sie den Anweisungen. Sollten Sie w&auml;hrend der Installation eine Fehlermeldung erhalten, dass Sie kein Java installiert haben oder dass die von ihnen installierte Java-Version zu alt ist, laden Sie sich unter <a target="_blank" href="http://www.java.com">http://www.java.com</a> die aktuelle Java-Version f&uuml;r Windows herunter und installieren diese; bei Linux-Distributionen nutzen Sei dazu den Paketmanager Ihrer Distribution. Anschlie&szlig;end k&ouml;nnen Sie JAuswertung installieren.</p>

<p>Wenn Sie das Installationsprogramm JAuswertung-???.jar (??? steht f&uuml;r die aktuelle Versionnummer) benutzen, kann es passieren, dass  beim Starten dieser Datei nichts passiert oder dass sich ein Packprogramm (WinZip, WinRar, Arc o.&auml;.) &ouml;ffnet. In diesem Fall &ouml;ffnen Sie eine Eingabeaufforderung (Windows) oder Shell (Linux u.a.) und wechseln dort in das Verzeichnis, in dem die Installationsdatei liegt. Hier geben Sie dann den Befehl "java -jar JAuswertung-???.jar" (??? m&uuml;ssen Sie durch die entsprechende Versionsnummer erstetzen) ein. Das Installationsprogramm sollte jetzt nach kurzer Zeit starten. Wenn Sie jetzt eine Meldung erhalten, dass der Befehl java nicht gefunden wurde, ist Java nicht korrekt auf ihrem System installiert.</p>

<p>Unter Windows und Linux werden bei der Installation von JAuswertung Verkn&uuml;pfungen in ihrem Programmmen&uuml; und auf ihrem Desktop angelegt, &uuml;ber die Sie die entsprechenden Programme direkt starten k&ouml;nnen. Unter Windows werden dar&uuml;ber hinaus Dateiverkn&uuml;pfungen mit Wettkampf- und Altersklassendateien erstellt.</p>
<h2>Deinstallation</h2>

<p>Vor der Deinstallation sollten Sie sich vergewissern, dass alle Programme von JAuswertung geschlossen sind, da ansonsten bei der Deinstallation nicht alle Dateien entfernen werden k&ouml;nnen. Sie k&ouml;nnen JAuswertung &uuml;ber die Verkn&uuml;pfung "JAuswertung deinstallieren" in ihrem Programmmen&uuml; wieder entfernen. Dabei werden alle installierten Dateien sowie alle von JAuswertung erzeugten Eintr&auml;ge entfernt.</p>

<p>Wurden bei der Installation mit "JAuswertung-???.jar" keine Verkn&uuml;pfungen angelegt, k&ouml;nnen Sie JAuswertung wie folgt deinstallieren. &Ouml;ffnen Sie eine Eingabeaufforderung oder Shell. Wechseln Sie in das Verzeichnis, in das Sie JAuswertung installiert haben und wechseln dort in das Unterverzeichnis "Uninstaller". Dort geben Sie den Befehl "java -jar uninstaller.jar" ein. Wenn das Installationsverzeichnis nicht automatisch mit entfernt wurde, k&ouml;nnen Sie es anschlie&szlig;end l&ouml;schen.</p>
<h2>Programmstart</h2>
<h3>Windows und Linux</h3>

<p>Sie k&ouml;nnen JAuswertung unter Windows und Linux wie von anderen Programmen gewohnt &uuml;ber ihr Programmmen&uuml; starten. Die einzelnen Verkn&uuml;pfungen finden Sie im Verzeichnis JAuswertung. Unter Windows k&ouml;nnen Sie gespeicherte Wettkampf-Dateien und Altersklassendefinitionen direkt per Doppelklick &ouml;ffnen.</p>
<h3>Andere Betriebssysteme</h3>

<p>Wenn Sie ein anderes Betriebssystem als Windows oder Linux benutzen, k&ouml;nnen Sie JAuswertung nur per Eingabeaufforderung (oder auch Shell) aus dem Installationsverzeichnis heraus starten. Der Befehl dazu lautet "java -jar jauswertung.jar" (ohne Anf&uuml;hrungszeichen). Der Regelwerkseditor kann analog mit "java -jar regelwerkseditor.jar" gestartet werden.</p>

<p><b>Anmerkung:</b> Unter einigen Unix-Varianten ist es m&ouml;glich, dass Verkn&uuml;pfungen angelegt werden. Auf Grund der vielen unterschiedlichen Varianten kann hier aber keine generelle Aussage getroffen werden.</p>
<h2>Bedienung</h2>

<p>Bei JAuswertung wurde der Schwerpunkt auf eine leichte und komfortable Bedienung gelegt. Das bedeutet, dass nur Aktionen m&ouml;glich sind, die allgemein sinnvoll sind. So ist z.B. die Eingabemaske f&uuml;r HLW-Punkte nur dann benutzbar, wenn mindestens ein Schwimmer die HLW absolvieren muss. Nicht benutzbare Funktionen werden daher grunds&auml;tzlich deaktiviert. Des weiteren k&ouml;nnen einzelne Funktionen deaktiviert werden, wenn Eingaben falsch oder unvollst&auml;ndig sind. So kann z.B. das Hinzuf&uuml;gen einer neuen Mannschaft nur dann abgeschlossen werden, wenn das Feld "Name" nicht leer ist und im Feld "Startnummer" kein Buchstabe steht. Felder, die nicht leer sein d&uuml;rfen, verf&auml;rben sich automatisch gelb, wenn Sie leer sind. Fehlerhafte Eingaben (z.B. ein Buchstabe anstatt einer Zahl) f&uuml;hren dazu, dass sich der Hintergrund des Feldes rot verf&auml;rbt. So haben Sie jederzeit eine R&uuml;ckmeldung zu ihrer aktuellen Eingabe.</p>

<p>Die Eingabe von Zeiten ist f&uuml;r eine hohe Eingabegeschwindigkeit optimiert. Wenn Sie in JAuswertung Zeiten eingeben sollen, erscheint immer ein Textfeld und direkt daneben bzw. darunter ein Feld in dem die Zeit dargestellt wird. In dem Textfeld m&uuml;ssen Sie nur die Ziffern der Zeit eintragen und in den Feld daneben erscheint die dazugeh&ouml;rige Zeit. So wird z.B. aus der Eingabe 3280 die Zeit 0:32,80 und aus der Eingabe 10300 die Zeit 1:03,00.</p>

<p><b>Hinweis:</b> Eingegebene Zeiten werden vom Programm sofort &uuml;bernommen und m&uuml;ssen nicht einzeln gespeichert werden.</p>

<p>Bei der Eingabe von Zeiten und HLW-Punkten k&ouml;nnen Sie mit den Pfeiltasten zwischen den Zeilen wechseln.</p>

<p>Bei der Eingabe von Zeiten sind dar&uuml;ber hinaus noch folgende Tastaturk&uuml;rzel verf&uuml;gbar:
<ul><li>
<p>"c" &ouml;ffnet den Dialog, um eine Strafe nach Fehlercode zu vergeben. Diese Strafe wird zu bestehenden Strafen hinzugef&uuml;gt.</p>
</li><li>
<p>"d" f&uuml;gt dem Teilnehmer/der Mannschaft eine "Disqualifikation" hinzu</p>
</li><li>
<p>"n" setzt den Teilnehmer/die Mannschaft auf "Nicht angetreten" (allerdings nur wenn keine Zeit eingegeben wurde)</p>
</li><li>
<p>"p" &ouml;ffnet ein Fenster zur Eingabe von Strafpunkten. Diese werden zu bestehenden Strafpunkten addiert.</p>
</li><li>
<p>"#" entfernt eingegebene Strafen</p>
</li></ul>
</p>

<p>Bei der Laufzeiteneingabe k&ouml;nnen Sie mit "Enter" nach der Eingabe jeder Zeit zur n&auml;chsten Bahn wechseln. Wenn Sie die letzte Bahn eingegeben haben und "Enter" dr&uuml;cken, wird Ihnen der Zieleinlauf angezeigt, so wie er sich aus den eingegebenen Zeiten ergibt. Mit den Tasten "z" und "," kann der Zieleinlauf des aktuellen Laufs angezeigt werden. Wie gewohnt k&ouml;nnen Sie auch hier mit den Cursortasten zwischen den einzelnen Bahnen wechseln. Wenn Sie in der ersten Bahn, die Pfeiltaste oben dr&uuml;cken, wechseln Sie zum vorherigen Lauf. Das Gleiche gilt umgekehrt auch f&uuml;r die letzte Bahn und die Pfeiltaste unten. Damit gelangen Sie zum jeweils n&auml;chsten Lauf.</p>

<p><b>Tipp:</b> Grunds&auml;tzlich werden Tabellen so dargestellt, dass m&ouml;glichst alle Spalten vollst&auml;ndig angezeigt werden k&ouml;nnen. Durch einen Doppelklick auf die Grenze zwischen zwei Spalten&uuml;berschriften, kann die linke Spalte manuell auf ihre optimale Gr&ouml;&szlig;e angepasst werden.</p>

<p><b>Hinweis:</b> Die Oberfl&auml;che wurde unter Ber&uuml;cksichtigung aktueller Standards erstellt und ist intuitiv nutzbar. Sollten Sie einmal ein anderes Verhalten erwarten, als JAuswertung zeigt, schreiben Sie mir eine Email an <a target="_blank" href="bugs@dennismueller.de">bugs @ dennismueller.de</a>.</p>

<p><b>Anmerkung:</b> Beachten Sie bitte, dass Sie tempor&auml;re Dateien nicht l&ouml;schen sollten, solange die zugeh&ouml;rige Anwendung ge&ouml;ffnet ist. Dies gilt auch f&uuml;r JAuswertung. Um den Speicherverbrauch zu reduzieren, werden Daten w&auml;hrend der Druckvorschau auf ihre Festplatte geschrieben und beim Schlie&szlig;en der Druckvorschau wieder gel&ouml;scht. Werden diese Dateien w&auml;hrend der Druckvorschau gel&ouml;scht, kann dies u.a. zu fehlerhaften Darstellungen f&uuml;hren.</p>
<hr />
<a name="jauswertung__begin" /><h1 class="title">JAuswertung</h1>

<p>Die Benutzeroberfl&auml;che von JAuswertung teilt sich in vier Bereiche:</p>

<ul><li>
<p>Die Men&uuml;s</p>
</li><li>
<p>Die obere Knopfleiste</p>
</li><li>
<p>Die linken Knopfleisten</p>
</li><li>
<p>Die Eingabebereiche</p>
</li></ul>

<p>&Uuml;ber die linken Knopfleisten k&ouml;nnen Sie ausw&auml;hlen, welche Eingaben Sie gerade durchf&uuml;hren wollen. Die rechts daneben liegenden Eingabebereiche werden dann entsprechend umgestellt. Die obere Knopfleiste (direkt &uuml;ber den linken Knopfleisten und den Eingabebereichen) dient dazu, h&auml;ufig genutzte Funktionen der Men&uuml;s direkt zug&auml;nglich zu machen. Alle weiteren Funktionen sind &uuml;ber die Men&uuml;s zu erreichen.</p>
<br/><p align="center">
<img src="pics/jauswertung.png" width="699" height="652" /><br/>
<em>JAuswertung</em></p><br/>
<hr />
<a name="jauswertungmenus__begin" /><h1 class="title">Men&uuml;s</h1>
<h2>Die Men&uuml;s</h2>
<br/><p align="center">
<img src="pics/menu.png" width="163" height="18" /><br/>
<em>Men&uuml;s</em></p><br/>

<p>JAuswertung bietet vier Men&uuml;s. Das Men&uuml; "Datei" befasst sich mit allen Informationen und Vorg&auml;ngen zum Laden und Speichern von Dateien. Das Men&uuml; "Werkzeuge" enth&auml;lt die Funktionen, die Sie bei der Verwaltung eines Wettkampfes ben&ouml;tigen. Das Men&uuml; Extras enth&auml;lt weitere Funktionen, die nicht direkt mit der Auswertung von Wettk&auml;mpfen zu tun haben. Das Men&uuml; "?" enth&auml;lt weitere Informationen &uuml;ber JAuswertung.</p>
<h3>Das Men&uuml;: Datei</h3>
<br/><p align="center">
<img src="pics/menu-datei.png" width="395" height="254" /><br/>
<em>Men&uuml;: Datei</em></p><br/>
<h4>Neu, &Ouml;ffnen, Speichern, Speichern unter...</h4>
<br/><p align="center">
<img src="pics/neuer-wettkampf.png" width="528" height="267" /><br/>
<em>Neuen Wettkampf erstellen</em></p><br/>

<p><a name="jauswertungmenus_neu"></a>&Uuml;ber den Men&uuml;punkt "Neu" k&ouml;nnen Sie einen neuen Wettkampf erstellen. Es &ouml;ffnet sich ein Fenster, wie es in Abbildung "Neuen Wettkampf erstellen" dargestellt ist. W&auml;hlen Sie einfach die Art von Wettkampf, die Sie durchf&uuml;hren m&ouml;chten. Sie haben dabei die Wahl zwischen Einzel- und Mannschaftswettk&auml;mpfen. Benutzerdefinierte Wettk&auml;mpfe k&ouml;nnen ebenfalls erstellt werden, dazu k&ouml;nnen &uuml;ber die Kn&ouml;pfe "Benutzerdefiniert" mit dem Regelwerkseditor erstellte Dateien geladen werden. &Uuml;ber die Men&uuml;punkte "&Ouml;ffnen", "Speichern" und "Speichern unter ..." stehen die &uuml;blichen Funktionen zur Verf&uuml;gung.</p>
<h4>Importieren, Exportieren, Automatisch speichern</h4>

<p>Sie k&ouml;nnen verschiedene Daten importieren bzw. exportieren. Ein Assistent begleitet den Vorgang und bietet die zur Verf&uuml;gung stehenden M&ouml;glichkeiten an. Importiert werden k&ouml;nnen dabei Meldedaten, Mannschaftsmitglieder, Kampfrichter und HLW-Punkte aus Excel- und CSV-Dateien. Exportiert werden k&ouml;nnen Meldedaten, Lauflisten, HLW-Listen, Kampfrichter, Startkarten, Mannschaftsmitglieder, HLW-Punkte und Ergebnisse in mindestens eins der Formate HMTL, CSV, XML, Excel oder PDF.</p>

<p><b>Hinweis:</b> Sie k&ouml;nnen auch alle Informationen, die Sie aus JAuswertung drucken k&ouml;nnen, als PDF-Datei speichern. Nutzten Sie dazu im Druckbereich die Vorschaufunktion. W&auml;hrend die Vorschau angezeigt wird, steht dort auch ein Knopf "Speichern als PDF" zur Verf&uuml;gung.</p>
<br/><p align="center">
<img src="pics/importieren-daten.png" width="394" height="314" /><br/>
<em>Daten</em></p><br/>

<p><b>Details zum Import</b></p>

<p>Beim Import von Tabellen in JAuswertung m&uuml;ssen einige Bedingungen erf&uuml;llt sein. Verwenden Sie zum Import von Meldungen am besten die offiziellen Vorlagen, die Sie auf <a target="_blank" href="http://www.dennismueller.de">www.dennismueller.de</a> finden.</p>

<p><b>Was wird importiert?</b> Enth&auml;lt eine Tabelle mehr als ein Tabellenblatt, so werden die Daten aller Bl&auml;tter importiert. Tabellenbl&auml;tter, die nicht den Anspr&uuml;chen gen&uuml;gen werden ignoriert. </p>

<p><b>Wie kann ich Probleme beim Import vermeiden?</b> Tabellen sollten keine verbundenen Zellen und keine Formeln enthalten. Die erste Zeile einer Tabelle darf nicht leer sein.</p>

<p><b>Wie muss eine importierbare Tabelle aufgebaut sein?</b> Die erste Zeile der Tabelle wird als &Uuml;berschrift interpretiert. Dabei werden die folgenden Texte erkannt "S#" und "Startnummer" (f&uuml;r Startnummer), "Name" (bei Einzelwettk&auml;mpfen "Vorname" und "Nachname"), "Gliederung", "Altersklasse", "Geschlecht", "Meldepunkte" und "Gemeldete Punkte", "Au&szlig;er Konkurrenz". Es wird erwartet, dass jede Zeile in der Tabelle genau einem Teilnehmer entspricht. Dabei wird davon ausgegangen, dass z.B. in der Spalte mit dem Titel "Name" die Namen der Mannschaften aufgef&uuml;hrt sind. Die Tabelle darf beliebig viele Spalten enthalten; Spalten deren Titel JAuswertung unbekannt ist, werden einfach ignoriert. Beachten Sie aber, dass die Felder "Name" (bzw. "Vorname" und "Nachname"), "Gliederung", "Altersklasse" und "Geschlecht" Pflichtfelder sind. Fehlt eines dieser Felder, kann JAuswertung die Tabelle nicht importieren. </p>

<p><b>Hinweis:</b> Es werden nur Excel-Dateien ab der Versionen 97 unterst&uuml;tzt. Dateien &auml;lterer Versionen m&uuml;ssen zuerst in einem neueren Format gespeichert werden.</p>

<p><b>Hinweis:</b> Beachten Sie bitte ebenfalls, dass nach dem Regelwerk in der offenen Altersklasse eine Wahlm&ouml;glichkeit bei den Disziplinen besteht. In diesem Fall ist auch die Festlegung der Disziplinen beim Import Pflicht. Wie die Disziplinen festgelegt werden k&ouml;nnen, ist im n&auml;chsten Abschnitt beschrieben.</p>

<p><b>Welche zus&auml;tzlichen Informationen k&ouml;nnen importiert werden?</b> Dar&uuml;ber hinaus k&ouml;nnen f&uuml;r die jeweiligen Disziplinen Zeiten gemeldet werden, die bei der Lauflistenerstellung ber&uuml;cksichtigt werden k&ouml;nnen. Dazu m&uuml;ssen Sie nur f&uuml;r jede Disziplin eine Spalte anlegen, deren Titel der Name der Disziplin ist. Dort k&ouml;nnen Sie dann die Zeit im Formt "m:ss,00" (also Minuten:Sekunden,hundertstel) eintragen. Nach dem Regelwerk von 2007 darf die Offene Altersklasse ihre Disziplinen w&auml;hlen. Diese Informationen k&ouml;nnen ebenfalls importiert werden. Ist in einer Spalte einer Disziplin keine Meldezeit angegeben, so wird der Teilnehmer hier nicht gemeldet. K&ouml;nnen Sie keine Zeit angeben gen&uuml;gt ein "+" zur Meldung des Schwimmers.</p>
<br/><p align="center">
<img src="pics/exportieren-daten.png" width="396" height="431" /><br/>
<em>Daten</em></p><br/>

<p><b>Automatisch speichern</b></p>

<p>Die Option "Automatisch speichern" speichert die aktuelle Datei alle 5 Minuten. Dabei wird der aktuelle Name der Datei um "-autosave" erweitert. Hei&szlig;t ihr Wettkampf "BezMei06.wk" (".wk" ist die Endung, die von JAuswertung f&uuml;r Wettk&auml;mpfe benutzt wird), wird alle 5 Minuten eine Datei unter dem Namen "BezMei06-autosave.wk" gespeichert. Wurde eine Datei neu erstellt und noch nicht gespeichert, ist automatisches Speichern nicht m&ouml;glich!</p>
<h4>Drucken</h4>

<p>Das Drucken ist in JAuswertung &uuml;ber eine der linken Knopfleisten verf&uuml;gbar. Dies ist notwendigt, da JAuswertung wesentlich mehr Druckm&ouml;glichkeiten bietet als die meisten anderen Programme. Da aber ein Men&uuml;punkt "Drucken" an dieser Stelle erwartet wird, ist dieser hier eingef&uuml;gt, und wechselt auf die entsprechende Druckansicht.</p>
<h4>Eigenschaften</h4>

<p><a name="jauswertungmenus_eigenschaften"></a>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen verschiedene Angaben zum Wettkampf wie z.B. Name, Ort und Datum eingetragen werden, die f&uuml;r ein Protokoll ben&ouml;tigt werden. Einige Angaben wie z.B. der Name des Wettkampfs werden auch im Titel der Ergebnisse aufgef&uuml;hrt. Diese Angaben werden f&uuml;r das Protokoll ben&ouml;tigt.</p>

<p>Die Eingaben der Registerkarten "Wettkampf" und "Veranstaltungsort" enthalten strukturierte Informationen zum Wettkampf. Dar&uuml;ber hinaus werden die Felder "Name", "Ort" und "Datum" auf alle Seiten gedruckt. Die Registerkarte "Informationsseite" enth&auml;lt ein Feld zur freien Texteingabe. Diese Informationen k&ouml;nnen &uuml;ber "Informationsseite" gedruckt werden. F&uuml;r das Deckblatt des Protokolls k&ouml;nnen Sie &uuml;ber die Registerkarte "Logo" ein Veranstaltungslogo ausw&auml;hlen.</p>
<br/><p align="center">
<img src="pics/eigenschaften-wettkampf.png" width="500" height="400" /><br/>
<em>Wettkampf</em></p><br/>
<br/><p align="center">
<img src="pics/eigenschaften-veranstaltungsort.png" width="500" height="536" /><br/>
<em>Veranstaltungsort</em></p><br/>
<br/><p align="center">
<img src="pics/eigenschaften-infoseite.png" width="500" height="390" /><br/>
<em>Infoseite</em></p><br/>
<br/><p align="center">
<img src="pics/eigenschaften-logo.png" width="500" height="390" /><br/>
<em>Logo</em></p><br/>
<h4>Zuletzt genutzte Dateien</h4>

<p>In der Liste der zuletzt genutzten Dateien, werden die vier letzten ge&ouml;ffneten bzw. gespeicherten Dateien angezeigt. Durch einen Mausklick werden diese direkt geladen.</p>
<h4>Beenden</h4>

<p>&Uuml;ber diesen Men&uuml;punkt wir JAuswertung beendet. Dies kann je nach Betriebssystem auch &uuml;ber das "X" in der rechten oberen Ecke des Hauptfensters geschehen. Wurden seit dem letzten Speichern Daten ge&auml;ndert, erfolgt eine Sicherheitsabfrage.</p>
<h3>Das Men&uuml;: Bearbeiten</h3>

<p>Das Men&uuml; "Bearbeiten" enth&auml;lt die Funktionen, die Sie bei der Verwaltung ihres Wettkampfs unterst&uuml;tzen. Dazu geh&ouml;rt das Erzeugen und Verwalten von Lauf- und HLW-Listen, der Einsatz von Kampfrichtern, die &Auml;nderung des Regelwerks, die Strafenliste, fehlende Eingaben und die Kampfrichterverwaltung.</p>
<br/><p align="center">
<img src="pics/menu-bearbeiten.png" width="211" height="385" /><br/>
<em>Men&uuml;: Bearbeiten</em></p><br/>
<h4>R&uuml;ckg&auml;ngig und Wiederholen</h4>

<p><a name="jauswertungmenus_undo"></a>&Uuml;ber den Punkt "R&uuml;ckg&auml;ngig" k&ouml;nnen Sie jeweils die letzte &Auml;nderung zur&uuml;cknehmen. Durch mehrfaches Ausw&auml;hlen dieses Punkts k&ouml;nnen Sie auch mehrere Schritte zur&uuml;ckgehen. Sollten Sie einmal einen Schritt zu weit zur&uuml;ck gegangen sein, k&ouml;nnen Sie diesen Schritt &uuml;ber den Men&uuml;punkt "Wiederholen" wieder herstellen. Es ist auch m&ouml;glich mehrere Schritte wiederherzustellen.</p>
<h4>Meldezeiten</h4>
<br/><p align="center">
<img src="pics/meldezeiten.png" width="856" height="467" /><br/>
<em>Meldezeiten</em></p><br/>

<p>Meldezeiten werden zur gerechteren Einteilung der L&auml;ufe ben&ouml;tigt. Wenn Sie also eine Laufliste mit der Option "Nach Meldezeiten sortieren" erstellen wollen, sollten Sie zuerst hier die entsprechenden Meldezeiten eingeben. </p>

<p>Im oberen Bereich des Fensters k&ouml;nnen Sie die Altersklasse und das Geschlecht f&uuml;r die Eingabe w&auml;hlen. Im Hauptbereich werden dann alle Schwimmer dieser Auswahl mit den Meldezeiten jeder Disziplin angezeigt. Sind f&uuml;r Schwimmer einzelne Diszplinen deaktiviert, so nimmt der Schwimmer an diesen Disziplinen nicht teil.</p>
<h4>Meldepunkte sch&auml;tzen</h4>
<br/><p align="center">
<img src="pics/meldepunkte-schaetzen.png" width="158" height="331" /><br/>
<em>Meldepunkte sch&auml;tzen</em></p><br/>

<p>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Sie Meldepunkte auf der Basis gemeldeter Zeiten sch&auml;tzen lassen. Dabei wird allen Schwimmern die Punktzahl zugewiesen, die sie mit diesen Zeiten (ohne HLW und Punkteabz&uuml;ge) erhalten w&uuml;rden. </p>

<p><b>Hinweis:</b> Sind bereits Meldepunkte gesetzt, werden diese beibehalten.</p>
<h4>Zulassung</h4>

<p>Die Zulassung hat 2 Unterpunkte: Neu, Nicht qualifizierte entfernen. Mit dem ersten Punkt kann &uuml;ber einen Assistenten eine neue Zulassung durchgef&uuml;hrt werden. Schwimmer, die bereits als gesetzt markiert werden, werden dadurch nicht ver&auml;ndert. Die restlichen Schwimmer werden auf der Basis der Einstellungen als Direktqualifiziert (z.B. f&uuml;r Landesmeister), Punkte (Nachr&uuml;cker nach Punkten) und nicht qualifiziert gesetzt. </p>

<p>Wird keine Zulassung durchgef&uuml;hrt, sind alle Schwimmer auf "offen" gesetzt. Die Zulassung kann auch f&uuml;r jeden Schwimmer einzeln gesetzt werden. Daf&uuml;r steht die Funktion "Bearbeiten" z.B. unter Meldungen zur Verf&uuml;gung.</p>
<h4>Laufliste</h4>

<p><a name="jauswertungmenus_laufliste"></a>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Lauflisten erstellt und verwaltet werden. Dazu stehen Ihnen die folgenden Funktionen zur Verf&uuml;gung:</p>

<p>Der Unterpunkt "Neu" erstellt automatisch eine neue Liste, in der alle Teilnehmer bzw. Teams ber&uuml;cksichtigt werden. Sie werden durch einen Assistenten durch die Erstellung der Liste begleitet und k&ouml;nnen die Einstellungen ihren W&uuml;nschen anpassen:</p>

<ul><li>
<p>Schritt 1: Allgemeine Einstellungen
<ul><li>
<p>Festlegung der Anzahl der Bahnen des Schwimmbeckens</p>
</li><li>
<p>Nummer des ersten Laufs</p>
</li></ul>
</p>
</li><li>
<p>Schritt 2: Art der Erstellung
<ul><li>
<p>Hier k&ouml;nnen Sie w&auml;hlen, ob sie den Assistenten fortsetzen und eine Laufliste automatisch erstellen wollen oder ob Sie eine leere Laufliste erstellen wollen, in der Sie die L&auml;ufe selbst einteilen.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 3: Bahnenauswahl
<ul><li>
<p>Hier k&ouml;nnen Sie f&uuml;r jede Disziplin festlegen, welche Bahnen genutzt werden sollen. In einigen Schwimmb&auml;dern kann es aus baulichen Gr&uuml;nden n&ouml;tig sein, z.B. bei der Disziplin "50m Retten" wegen ungleicher Beckentiefe auf eine Bahn zu verzichten.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 4: Reihenfolge der Altersklassen und Disziplinen
<ul><li>
<p>In diesem Schritt k&ouml;nnen Sie festlegen welche Disziplinen und welche Altersklassen in welcher Reihenfolge geschwommen werden sollen. Die Standardreihenfolge soll allen Schwimmern einen m&ouml;glichst gro&szlig;en Abstand zwischen zwei Starts erm&ouml;glichen.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 5: Sortierung der Schwimmer je Altersklasse
<ul><li>
<p>Dieser Schritt legt fest, wie die Schwimmer innerhalb einer Altersklasse auf die L&auml;ufe verteilt werden. Die Punkte "Zuf&auml;llig", "Nach Gliederungen sortieren" und "Gleiche Gliederung auf unterschiedliche L&auml;ufe verteilen" bieten sich vor allem f&uuml;r Freundschaftswettk&auml;mpfe an, w&auml;hrend "Nach gemeldeten Punkten sortieren", "Nach gemeldeten Zeiten sortieren (je Disziplin)" und "Nach Regelwerk sortieren" besonders f&uuml;r Meisterschaften geeignet sind.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 6: Meldepunkte
<ul><li>
<p>Hinweis: Dieser Schritt wird nur angezeigt, wenn in Schritt 5 "Nach gemeldeten Punkten sortieren" ausgew&auml;hlt wurde.</p>
</li><li>
<p>In diesem Schritt kann festgelegt werden, nach welchen Meldepunkten die Einteilung erfolgen soll.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 7: Optionen
<ul><li>
<p>Durch "Fast leere L&auml;ufe am Ende von Altersklassen vermeiden" werden fast leere "langsamste" L&auml;ufe durch Schwimmer aus dem "zweitlangsamsten" Lauf aufgef&uuml;llt. <b>Beispiel:</b> G&auml;be es also z.B. einen Lauf mit 1 Schwimmer und der n&auml;chst bessere Lauf w&uuml;rde 5 Schwimmer enthalten, so werden zwei L&auml;ufe mit 3 Schwimmern erstellt.</p>
</li><li>
<p>&Uuml;ber "Gemischte L&auml;ufe" wird ggf. der letzte m&auml;nnliche und weibliche Lauf zusammengelegt, sofern dadurch ein Lauf gespart werden kann.</p>
</li><li>
<p>"Wenn m&ouml;glich aufeinanderfolgende L&auml;ufe zusammenfassen" &uuml;berpr&uuml;ft nach der eigentlichen Erstellung der Liste, ob L&auml;ufe, die aufeinanderfolgen, zusammengefasst werden k&ouml;nnen. Dabei wird nicht ber&uuml;cksichtigt, ob die L&auml;ufe die gleiche Disziplin oder Altersklasse enthalten.</p>
</li><li>
<p>"Bahnen rotieren" erm&ouml;glicht es eine faierere Laufliste zu erstellen, da in jedem Lauf eine andere Bahn genutzt wird.</p>
</li><li>
<p>"Normale Teilnehmer und Teilnehmer au&szlig;er Konkurrenz in unterschiedlichen L&auml;ufen" spricht eigentlich f&uuml;r sich selbst und trennt die entsprechend markierten Teilnehmer. Diese Option hat keinen Einfluss auf Option 2. Dar&uuml;ber hinaus werden die Teilnehmer nicht strikt getrennt, sondern nur entsprechend sortiert. Ist der letzte Lauf der Teilnehmer, die nicht au&szlig;er Konkurrenz starten, nicht voll besetzt, wird er durch die ersten au&szlig;er Konkurrenz Startenden aufgef&uuml;llt.</p>
</li></ul>
</p>
</li></ul>

<p><b>Hinweis 1:</b> Bei der Sortieroption "Nach Regelwerk sortieren" werden die Altersklassen nach der jeweiligen Vorgabe des eingegebenen Regelwerks durchgef&uuml;hrt. Diese k&ouml;nnen Sie im Regelwerkseditor &auml;ndern.</p>
<br/><p align="center">
<img src="pics/laufliste-neu-1.png" width="392" height="182" /><br/>
<em>Schritt 1: Allgemeine Einstellungen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-2.png" width="392" height="168" /><br/>
<em>Schritt 2: Laufliste erstellen oder nur eine leere anlegen?</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-3.png" width="398" height="548" /><br/>
<em>Schritt 3: Benutzbare Bahnen w&auml;hlen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-4.png" width="398" height="475" /><br/>
<em>Schritt 4: Reihenfolge der Disziplinen w&auml;hlen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-5.png" width="398" height="275" /><br/>
<em>Schritt 5: Sortierung festlegen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-6.png" width="398" height="251" /><br/>
<em>Schritt 6: Weitere Optionen</em></p><br/>

<p>&Uuml;ber den Unterpunkt "Bearbeiten" wird die aktuelle Liste angezeigt. Wurden seit der Erstellung der Liste weitere Teilnehmer oder Mannschaften eingetragen, erscheinen diese im rechten Teil - der sogenannten "Warteliste". Den Hauptteil des Fensters nimmt die eigentliche Liste ein, die in Tabellenform dargestellt ist. Die erste Spalte ist mit "#" beschriftet und enth&auml;lt die Laufnummer. Die Spalten "AK" und "Disziplin" enthalten den Namen der entsprechenden Altersklasse bzw. der geschwommenen Disziplin. Dabei gilt f&uuml;r die Altersklasse, dass hier der Name der Altersklasse inklusive Geschlecht angezeigt wird. Starten die Schwimmer einer Altersklasse in einem Lauf gemischt, so steht hier der Name der Altersklasse gefolgt von "gemischt". Starten in einem Lauf unterschiedliche Altersklassen steht hier nur "Gemischt". Entsprechend gilt dies f&uuml;r die Spalte "Disziplin", sobald unterschiedliche Disziplinen geschwommen werden, steht hier "Gemischt". Die restlichen Spalten stehen f&uuml;r die Nummer der Bahn und dort sind die entsprechenden Teilnehmer bzw. Mannschaften eingetragen.</p>
<br/><p align="center">
<img src="pics/laufliste-bearbeiten.png" width="898" height="426" /><br/>
<em>Laufliste</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-bearbeiten-popup.png" width="187" height="105" /><br/>
<em>Laufliste: Rechtsklick</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-bearbeiten-menu.png" width="221" height="88" /><br/>
<em>Men&uuml;</em></p><br/>

<p>Durch einen einfachen Klick auf einen Teilnehmer werden dessen Informationen am unteren Fensterrand dargestellt. Durch einen Doppelklick auf einen Schwimmer in der Liste wird er auf die Warteliste gesetzt und aus der Liste entfernt. Durch einen Doppelklick auf ein leeres Feld der Liste wird der ausgew&auml;hlte Teilnehmer der Warteliste in die Liste eingetragen und aus der Warteliste entfernt. Sie k&ouml;nnen die Listen wahlweise auch mittels Drag'n'Drop ver&auml;ndern. Ziehen Sie hierzu den Teilnehmer bzw. die Mannschaft einfach an die gew&uuml;nschte Stelle. Durch einen rechten Mausklick auf ein Feld in der Laufliste &ouml;ffnet sich ein Kontextmen&uuml;. Wenn Sie auf einen Schwimmer geklickt haben, k&ouml;nnen Sie diesen &uuml;ber den Punkt "Entfernen" aus der Laufliste entfernen. &Uuml;ber die restlichen Men&uuml;punkte k&ouml;nnen Sie einen Lauf oberhalb bzw. unterhalb des aktuellen Laufs einf&uuml;gen oder den aktuellen Lauf l&ouml;schen.</p>

<p>&Uuml;ber den Unterpunkt "Anzeigen" kann die aktuelle Lauf- bzw. HLW-Liste angezeigt werden. Der Aufbau des Fensters entspricht dem bei der Bearbeitung; es fehlt lediglich die Warteliste und eine Bearbeitung ist nicht m&ouml;glich. So k&ouml;nnen Sie sicherstellen, dass Sie nicht versehentlich die Laufliste modifizieren.</p>

<p>&Uuml;ber den Unterpunkt "Sperren" kann die Bearbeitung und die Neuerstellung unterbunden werden. Damit ist eine versehentliche &Auml;nderung der Listen nicht m&ouml;glich.</p>
<h4>HLW-Liste</h4>

<p>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Lauflisten erstellt und verwaltet werden. Dazu stehen Ihnen die folgenden Funktionen zur Verf&uuml;gung:</p>
<br/><p align="center">
<img src="pics/hlw-liste-neu-1.png" width="409" height="167" /><br/>
<em>Schritt 1: Anzahl der HLW-Puppen</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-2.png" width="409" height="172" /><br/>
<em>Schritt 2: Erstellung oder Vorbereitung</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-3.png" width="409" height="252" /><br/>
<em>Schritt 3: Reihenfolge der Altersklassen</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-4.png" width="409" height="242" /><br/>
<em>Schritt 4: Sortierung der Teilnehmer</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-5.png" width="477" height="268" /><br/>
<em>Schritt 5: Meldepunkte</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-6.png" width="409" height="184" /><br/>
<em>Schritt 6: Uhrzeit</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-7.png" width="409" height="315" /><br/>
<em>Schritt 7: Pause</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-8.png" width="477" height="235" /><br/>
<em>Schritt 8: Optionen</em></p><br/>

<p>Die Erstellung einer HLW-Liste wird &uuml;ber "Neu" durchgef&uuml;hrt. Dabei geben Sie zuerst die Anzahl der HLW-Puppen an. Im zweiten Schritt k&ouml;nnen Sie ausw&auml;hlen, ob Sie die HLW-Liste von Hand erstellen m&ouml;chten (Dann ist die Erstellung nach diesem Schritt abgeschlossen), oder ob Sie die Liste von JAuswertung erstellen lassen wollen. Im dritten Schritt legen Sie die Reihenfolge der Altersklassen fest. Der vierte Schritt gibt die Reihenfolge der Teilnehmer bzw. Mannschaften innerhalb einer Alterklasse an. Im f&uuml;nften Schritt legen Sie die Anfangsuhrzeit der HLW sowie die Dauer einer HLW fest. Im letzten Schritt k&ouml;nnen Sie noch Pause bei der HLW einplanen. Diese k&ouml;nnen Sie wahlweise zu einem festen Zeitpunkt oder nach jeder Altersklasse angeben.</p>
<br/><p align="center">
<img src="pics/hlw-liste-bearbeiten.png" width="657" height="496" /><br/>
<em>HLW-Liste</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-bearbeiten-popup.png" width="194" height="193" /><br/>
<em>HLW-Liste: Rechtsklick</em></p><br/>

<p>Sie k&ouml;nnen bestehende HLW-Listen bearbeiten, so dass Sie auch automatisch erstellte Listen Ihren W&uuml;nschen anpassen und nachgemeldete Starter einf&uuml;gen k&ouml;nnen. Dabei sehen Sie in dem Fenster links die aktuelle HLW-Liste und rechts in der "Warteliste" die Starter, die noch zur HLW eingeteilt werden m&uuml;ssen. Die Tabelle der HLW-Liste enth&auml;lt dabei die Spalten "Zeit" f&uuml;r den Zeitpunkt an dem die HLW durchzuf&uuml;hren ist sowie die Altersklasse der Starter. Gehen gemischte Geschlechter zu einer Zeit an der Start steht hier z.B. "AK 13/14 gemischt". Starten unterschiedliche Altersklassen zum gleichen Zeitpunkte so steht in dieser Spalte "Gemischt". Die restlichen Spalten stehen f&uuml;r die Nummer der Bahn bzw. HLW-Puppe und dort sind die entsprechenden Teilnehmer bzw. Mannschaften eingetragen. Eine Besonderheit stellt hier die Mannschafts-HLW dar, da hier jede Mannschaft viermal antreten muss. Einzelne Teilnehmer bzw. Mannschaften k&ouml;nnen Sie per Drag'n'Drop verschieben und so an die gew&uuml;nschte Position bringen. Pausen und L&auml;ufe k&ouml;nnen Sie &uuml;ber einen Rechtsklick-Men&uuml; hinzuf&uuml;gen bzw. entfernen.</p>

<p>Die Funktion "Anzeigen" bietet ausschlie&szlig;lich die Anzeige der HLW-Liste ohne die Bearbeitungsfunktionen. &Uuml;ber den Punkte "Sperren" k&ouml;nnen Sie die HLW-Liste vor Bearbeitungen sch&uuml;tzen. So kann diese nicht versehentlich ge&auml;ndert werden.</p>
<h4>Laufpr&auml;sentation</h4>

<p>Die Laufpr&auml;sentation dient zur Darstellung der Informationen &uuml;ber den aktuellen sowie dem n&auml;chsten Lauf z.B. &uuml;ber einen Videobeamer. Die Anzeige wechselt zeitgesteuert zwischen der aktuellen Laufnummer und dem n&auml;chsten Lauf.</p>

<p>Folgende Tasten k&ouml;nnen zum Wechsel zum n&auml;chsten Lauf genutzt werden: Pfeil rechts, Pfeil unten, Leertaste, Enter</p>

<p>Folgende Tasten k&ouml;nnen zum Wechsel zum vorherigen Lauf genutzt werden: Pfeil links, Pfeil oben, Backspace.</p>
<h4>Regelwerkseditor</h4>

<p>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Sie die Altersklassen ihres Wettkampfs bearbeiten. Beachten Sie aber, dass Sie w&auml;hrend eines Wettkampfs keine Altersklassen erstellen bzw. l&ouml;schen k&ouml;nnen, und dass die Anzahl der Disziplinen nicht ge&auml;ndert werden kann. Dar&uuml;ber hinaus k&ouml;nnen Sie weitere Einstellungen zum Regelwerk durchf&uuml;hren. Weitere Informationen zum Regelwerkseditor finden Sie im Kapitel <a href="#akse_akse">Regelwerkseditor</a>. </p>
<h4>Kampfrichter</h4>
<br/><p align="center">
<img src="pics/kampfrichter-neu.png" width="530" height="168" /><br/>
<em>Kampfrichtervorgabe w&auml;hlen</em></p><br/>
<br/><p align="center">
<img src="pics/kampfrichter.png" width="588" height="687" /><br/>
<em>Kampfrichterverwaltung</em></p><br/>
<br/><p align="center">
<img src="pics/kampfrichter-menu.png" width="118" height="111" /><br/>
<em>Men&uuml;</em></p><br/>

<p>Mit der Kampfrichterverwaltung k&ouml;nnen Kampfrichter auf die verschiedenen Positionen eingeteilt werden. Die Positionen entsprechen denen des aktuellen DLRG-Regelwerks. Sie k&ouml;nnen je nach Wettkampf die Anforderungen an die Kampfrichter festlegen. So gelten z.B. f&uuml;r Bezirksmeisterschaften geringere Anforderungen als f&uuml;r die Landesmeisterschaften. Die Einteilung der Kampfrichter kann einzeln gedruckt werden, ist aber auch Bestandteil des Protokolls.</p>

<p><b>Tipp:</b> Sie k&ouml;nnen die Einteilung der Kampfrichter auch speichern und in einem anderen Wettkampf laden. Damit m&uuml;ssen Sie die Kampfrichter nicht zweimal eintippen, wenn sich die Kampfrichter z.B. zwischen Einzel- und Mannschaftsmeisterschaften nicht &auml;ndern.</p>
<h4>Startunterlagen</h4>

<p><a name="jauswertungmenus_startunterlagen"></a>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Sie festlgen welche Schwimmer einer Startpasskontrolle unterzogen werden sollen. Dabei steht Ihnen ein Assistent zur Verf&uuml;gung, der Sie bei der Auslosung der Startunterlagenkontrolle unterst&uuml;tzt, so dass Sie die Auswahl nicht manuell vornehmen m&uuml;ssen. Diese Auswahl k&ouml;nnen Sie aber bei Bedarf jeder Zeit Ihren W&uuml;nschen anpassen.</p>
<br/><p align="center">
<img src="pics/startunterlagen-menu.png" width="118" height="71" /><br/>
<em>Startunterlagenkontrolle</em></p><br/>
<br/><p align="center">
<img src="pics/startunterlagen-menu.png" width="118" height="71" /><br/>
<em>Men&uuml;</em></p><br/>
<br/><p align="center">
<img src="pics/startunterlagen-assistent.png" width="396" height="231" /><br/>
<em>Assistent</em></p><br/>
<h4>Dopingkontrolle</h4>

<p><a name="jauswertungmenus_dopingkontrolle"></a>Die Auslosung der Dopingkontrolle ist identisch zur <a href="#jauswertungmenus_startunterlagen">Startpasskontrolle</a>.</p>
<h4>Elektronische Zeitnahme</h4>
<br/><p align="center">
<img src="pics/elektronische-zeitnahme.png" width="609" height="431" /><br/>
<em>Elektronische Zeitnahme</em></p><br/>

<p>Die Funktion "Elektronische Zeitnahme" wurde f&uuml;r die "Deutschen Meisterschaften im Rettungsswimmen" hinzugef&uuml;gt und erm&ouml;glicht die &Uuml;bernahme von Zeiten aus einer elektronischen Zeitmessanlage. Wenn JAuswertung mit einer Zeitmessanlage verbunden ist, kann &uuml;ber den Knopf "Aktualisieren" das aktuelle Ergebnis abgerufen werden. Im Bereich &Uuml;bersicht kann aus den L&auml;ufen von JAuswertung ausgew&auml;hlt werden. JAuswertung versucht dabei den passenden Lauf der elektronischen Zeitmessung im rechten Bereich zu ermitteln und anzuzeigen. Mit dem Knopf "Eintragen" werden die Zeiten aus der elektronischen Zeitmessung &uuml;bernommen.</p>

<p>Die Verbindung mit einer elektronischen Zeitnahme erfolgt &uuml;ber ein Netzwerk. Die ben&ouml;tigten Einstellungen stehen im Men&uuml;punkt Extras &rarr; Optionen zur Verf&uuml;gung.</p>

<p><b>Hinweis:</b> Ggf. stellt die Zeitnahme mehrere Zeiten pro Bahn zur Verf&uuml;gung. Aus diesen kann die gew&uuml;nschte Zeit ausgew&auml;hlt werden.</p>
<h4>Zielrichterentscheid</h4>

<p><a name="jauswertungmenus_zielrichterentscheid"></a>Der Zielrichterentscheid ist eine Besonderheit, die mit dem DLRG-Regelwerk von 2008 aus dem DSV-Regelwerk &uuml;bernommen wurde. Diese tritt dann ein, wenn in einem Lauf bei mehreren Schwimmer der gleichen Altersklasse die manuell gestoppte Zeit dem Zieleinlauf widerspricht (Bei vollautomatischer Zeitnahme tritt ein Zielrichterentscheid also nicht ein). In diesem Fall erhalten alle Schwimmer die gleiche Zeit. Die Platzierung in dieser Disziplin wird entsprechend dem Zieleinlauf festgelegt, so dass die Schwimmer trotz gleicher Zeit unterschiedliche Pl&auml;tze einnehmen. Dies gilt jedoch nur, wenn nicht in einem anderen Lauf ein weiterer Schwimmer der gleichen Altersklasse die gleiche Zeit geschwommen hat.</p>
<br/><p align="center">
<img src="pics/zielrichterentscheid.png" width="610" height="374" /><br/>
<em>Zielrichterentscheid</em></p><br/>

<p>JAuswertung geht davon aus, dass die im Falle eine Zielrichterentscheids betroffenen Schwimmer die gleiche Zeit erhalten und entsprechend eingegeben werden. Wenn Sie also einen Zielrichterentscheid hinzuf&uuml;gen m&ouml;chten, listet Ihnen JAuswertung die in Frage kommenden L&auml;ufe mit den entsprechenden Teilnehmern auf. Aus dieser Liste k&ouml;nnen Sie anschlie&szlig;end den richtigen ausw&auml;hlen. </p>

<p><b>Anmerkung:</b> Sollte Ihr Zielrichterentscheid nicht aufgef&uuml;hrt werden, so liegt wahrscheinlich ein Eingabefehler vor.</p>

<p>In der Liste der aufgef&uuml;hrten ausgew&auml;hlten Zielrichterentscheide werden die Schwimmer zuerst anhand ihrer Bahnen sortiert aufgelistet. Sie k&ouml;nnen die Reihenfolge der Schwimmer per Drag'n'Drop &auml;ndern.</p>
<br/><p align="center">
<img src="pics/zielirchterentscheid-add.png" width="220" height="197" /><br/>
<em>Zielrichterentscheid hinzuf&uuml;gen</em></p><br/>
<br/><p align="center">
<img src="pics/Zielrichterentscheid-korrektur.png" width="458" height="289" /><br/>
<em>Zielrichterentscheide korrigieren</em></p><br/>
<h4>Strafenliste</h4>

<p>Die Strafenliste zeigt alle vergebenen Strafen des aktuellen Wettkampfs nach L&auml;ufen sortiert an. Hier haben Sie die M&ouml;glichkeit, diese noch einmal auf Richtigkeit zu &uuml;berpr&uuml;fen und ggf. zu korrigieren.</p>
<br/><p align="center">
<img src="pics/strafenliste.png" width="400" height="478" /><br/>
<em>Strafenliste</em></p><br/>

<p><b>Tipp:</b> Da mit dem Regelwerk 2007 Strafen nicht mehr durchgesagt werden m&uuml;ssen, kann es sinnvoll sein, die Strafen noch einmal einzeln auszuh&auml;ngen. Zu diesem Zweck k&ouml;nnen Sie die Strafenliste im Druckbereich ausdrucken.</p>
<h4>Daten pr&uuml;fen</h4>
<br/><p align="center">
<img src="pics/daten-pruefen.png" width="265" height="698" /><br/>
<em>Daten pr&uuml;fen: &Uuml;bersicht</em></p><br/>

<p><a name="jauswertungmenus_datenpruefen"></a>&Uuml;ber diesem Men&uuml;punkt &ouml;ffnen Sie ein Fenster, dass ihnen Informationen zum aktuellen Stand der Eingabe darstellt. Sie ershalten eine &Uuml;bersicht &uuml;ber fehlerhafte bzw. korrekte Einfaben. Dabei m&uuml;ssen Sie jedoch beachten, dass diese Angaben auf Erfahrungswerten basieren und in vielen F&auml;llen auf Fehler in der Eingabe hinweisen. Es wird damit nicht garantiert, dass bestimmte Eingaben mit absoluter Sicherheit richtig oder falsch sind. Es ist aber i.d.R. gut, sich markierte Punkte genauer anzusehen.</p>
<br/><p align="center">
<img src="pics/daten-pruefen-anmeldung.png" width="359" height="223" /><br/>
<em>Daten pr&uuml;fen: Anmeldung</em></p><br/>
<br/><p align="center">
<img src="pics/daten-pruefen-zeiten.png" width="647" height="231" /><br/>
<em>Daten pr&uuml;fen: Zeiten</em></p><br/>
<br/><p align="center">
<img src="pics/daten-pruefen-hlw.png" width="647" height="201" /><br/>
<em>Daten pr&uuml;fen: HLW Punkte</em></p><br/>
<br/><p align="center">
<img src="pics/daten-pruefen-mannschaftsmitglieder.png" width="647" height="171" /><br/>
<em>Daten pr&uuml;fen: Mannschaftsmitglieder</em></p><br/>
<h4>Urkunden</h4>
<br/><p align="center">
<img src="pics/urkundeneditor.png" width="668" height="366" /><br/>
<em>Urkundeneditor</em></p><br/>

<p><a name="jauswertungmenus_urkundeneditor"></a>Mit dem Urkundeneditor k&ouml;nnen Sie bestehende Urkunde bedrucken lassen, so dass Sie diese nicht von Hand ausf&uuml;llen m&uuml;ssen. Dazu k&ouml;nnen Sie einzelne Textfelder erstellen, ausrichten und deren Schriftart &auml;ndern. &Uuml;ber das normale Druckmen&uuml; k&ouml;nnen dann die Urkunden auch Altersklassenweise gedruckt werden.</p>

<p>Folgende Texte in den Textfeldern werden automatisch ersetzt:
<ul><li>
<p>&lt;Name&gt;</p>
</li><li>
<p>&lt;Gliederung&gt;</p>
</li><li>
<p>&lt;Altersklasse&gt;</p>
</li><li>
<p>&lt;Geschlecht&gt;</p>
</li><li>
<p>&lt;Punkte&gt;</p>
</li><li>
<p>&lt;Platz&gt;</p>
</li><li>
<p>&lt;Wertung&gt;</p>
</li><li>
<p>&lt;Mitglieder&gt;</p>
</li><li>
<p>&lt;Mitglieder2&gt;</p>
</li></ul>
</p>

<p>Beachten Sie bitte die &lt; und &gt; um jedes Wort. Der Satz "&lt;Name&gt; belegte in der Altersklasse &lt;Altersklasse&gt; &lt;Geschlecht&gt; den &lt;Platz&gt;. Platz" w&uuml;rde also z.B. auf der gedruckten Urkunde wie folgt aussehen "Musterstadt 1 belegte in der Altersklasse AK 12 weiblich den 3. Platz". Die Texte &lt;Mitglieder&gt; und &lt;Mitglieder2&gt; werden bei Mannschaftswettk&auml;mpfen durch die Mannschaftsmitglieder ersetzt. &lt;Mitglieder&gt; erstellt dabei eine kommagetrennte Liste, &lt;Mitglieder2&gt; schreibt jedes Mitglied in eine eigene Zeile. Durch &lt;Wertung&gt; wird bei der Disziplinenwertung der Name der Disziplin eingesetzt; bei der Mehrkampfwertung wird hier "Mehrkampf" eingetragen.</p>
<h4>Ausgabefilter bearbeiten</h4>

<p><a name="jauswertungmenus_ausgabefilterbearbeiten"></a>&Uuml;ber diesen Men&uuml;punkt gelangen Sie in die Verwaltung der Ausgabefilter. Ausgabefilter erm&ouml;glichen es mehrere Wettk&auml;mpfe in Einem zu verwalten und trotzdem getrennte Ergebnisse, Protokolle und Meldelisten drucken und exportieren zu k&ouml;nnen. Auf der linken Seite des Fensters sehen Sie die zur Zeit eingerichteten Filter. Hier k&ouml;nnen Sie einzelne Filter hinzugef&uuml;gen bzw. entfernen. Beachten Sie, dass der Standardfilter weder entfernt noch ge&auml;ndert werden kann. Er enth&auml;lt immer alle Teilnehmer bzw. Mannschaften. Auf der rechten Seite sehen Sie den zur Zeit ausgew&auml;hlten Ausgabefilter. Hier k&ouml;nnen Sie den Namen des Filters &auml;ndern, wobei leere Namen nicht erlaubt sind. Unter dem Namen finden Sie eine Liste der Gliederungen, die zu diesem Filter geh&ouml;ren. Mit den beiden darunterliegenden Kn&ouml;pfen k&ouml;nnen Sie weitere Gliederungen zu diesem Filter hinzuf&uuml;gen bzw. entfernen.</p>
<br/><p align="center">
<img src="pics/ausgabefilter.png" width="400" height="291" /><br/>
<em>Ausgabefilter</em></p><br/>
<h3>Das Men&uuml;: Extras</h3>

<p>Das Men&uuml; "Extras" enth&auml;lt die Men&uuml;punkte Strafenkatalog und Optionen. </p>
<br/><p align="center">
<img src="pics/menu-extras.png" width="135" height="66" /><br/>
<em>Men&uuml;: Extras</em></p><br/>
<h4>Strafenkatalog</h4>

<p>Der Strafenkatalog enth&auml;lt eine Liste aller Strafen des Regelwerks, die in Kapitel und Paragraphen unterteilt sind. Werden w&auml;hrend eines Wettkampfs Strafen vergeben und ein eigener Text eingetragen, werden diese "neuen" Strafen im Kapitel "Sonstiges" aufgef&uuml;hrt. Dies ist sinnvoll, da im Regelwerk z.B. Strafen f&uuml;r fehlerhafte Wechsel vorgesehen sind. W&auml;hrend eines Wettkampfs ist aber auch der Vermerk "beim Wechsel vom 3. auf den 4. Schwimmer" sinnvoll. Wurde dies bei einer Strafe einmal eingetragen, kann diese beim n&auml;chsten Auftreten direkt ausgew&auml;hlt werden.</p>
<br/><p align="center">
<img src="pics/strafenkatalog.png" width="779" height="390" /><br/>
<em>Strafenkatalog</em></p><br/>

<p>Zur Unterst&uuml;tzung ist jeder Strafe ein Symbol zugeordnet:
<ul><li>
<p>Gr&uuml;ner Haken: Keine Strafe (0 Strafpunkte)</p>
</li><li>
<p>Blitz in gelbem Kreis: Strafpunkte</p>
</li><li>
<p>Roter Kreis mit wei&szlig;em X: Disqualifikation</p>
</li><li>
<p>Fu&szlig;spuren: Nicht angetreten</p>
</li><li>
<p>Haus: Ausschluss</p>
</li></ul>
</p>

<p><b>Anmerkung:</b> Die Regelwerke f&uuml;r Mannschaftswettk&auml;mpfe enthalten erweiterte Fehlercodes. Dabei wird neben der Strafe auch die Nummer des Verursachers bzw. des Wechsels angegeben. Z.B. kann f&uuml;r falsches Schleppen einer Puppe P2-3 gew&auml;hlt werden, so dass direkt ablesbar ist, dass der dritte Schwimmer die Strafe P2 verursacht hat. Diese Erweiterung ist jedoch im Regelwerk so nicht vorgesehen.</p>
<h4>Optionen</h4>
<br/><p align="center">
<img src="pics/optionen-allgemein.png" width="525" height="503" /><br/>
<em>Optionen</em></p><br/>

<p><a name="jauswertungmenus_optionen"></a>&Uuml;ber den Men&uuml;punkt "Optionen" k&ouml;nnen Sie ein Fenster &ouml;ffnen, in dem sich weitere Einstellungen vornehmen lassen. Das Fenster enth&auml;lt die Registerkarten "Allgemein", "Anzeige", "HTTP-Server", "Sicherung", "CSV", "Drucken", "Druckschrift", "Elektronische Zeitnahme" und "Werbung".</p>

<p>&Uuml;ber "Allgemein" k&ouml;nnen Sie einstellen, welche Art von Wettkampf also ein Einzel- bzw. Mannschaftswettkampf nach aktuellem Regelwerk beim Start erstellt werden soll. Die zweite Option legt fest, ob die Oberfl&auml;che "geteilt" sein soll. Geteilt ist die Standardeinstellung und bedeutet, dass Sie die Ergebnisse jederzeit im unteren Bereich des Fensters sehen k&ouml;nnen. Sollten Sie jedoch eine niedrige Aufl&ouml;sung oder gr&ouml;&szlig;ere Schriftarten nutzen, kann es sein, dass der Platz auf dem Bildschirm zu eng wird. Schalten Sie dann die geteilte Oberfl&auml;che aus, und die Ergebnisse erreichen Sie ab dem n&auml;chsten Start von JAuswertung &uuml;ber ein Icon an der linken Seite. Die dritte Einstellungsm&ouml;glichkeit betrifft das Drucken von Strafpunkten, wenn Sie diese Option aktivieren, wird automatisch bei jeder vergebenen Strafe ein Strafenlaufzettel mit allen n&ouml;tigen Daten gedruckt. Dies ist vor allem bei Freundschaftswettk&auml;mpfen sinnvoll, wenn der Protokollf&uuml;hrer mehrere Funktionen im Kampfgericht erf&uuml;llt. Die letzte Option betrifft die Warnung bei der Eingabe von sehr hohen Zeiten. Da im Normalfall nur Zeiten geschwommen werden, die nicht h&ouml;her sind als 5 * Rec-Wert der aktuellen Disziplin, handelt es sich hier meistens um Tippfehler. Diese k&ouml;nnen so vermieden werden.</p>
<br/><p align="center">
<img src="pics/optionen-anzeige.png" width="525" height="453" /><br/>
<em>Anzeige</em></p><br/>

<p>Im Bereich "Anzeige" kann die geteilte Ansicht gew&auml;hlt werden. Dabei wird das Fenster in einen oberen und einen unteren Bereich unterteilt. Der obere enth&auml;lt die Eingabefunktionen und der untere die Punkte Ergebniss und Drucken. Dies ist jedoch nur bei hohen Aufl&ouml;sungen sinnvoll. Daher wird bei niedrigen Aufl&ouml;sungen die geteilte Oberfl&auml;che nicht automatisch gew&auml;hlt. F&uuml;r diese Einstellung muss JAuswertung neu gestartet werden. Der zweite Punkt beeinflusst die Ausrichtunge von Texten in Lauf- und HLW-Listen. Mit dem dritten Punkt kann JAuswertung mitgeteilt werden, dass nach M&ouml;glichkeit redundante Informationen vermieden werden, um Platz auf den Ausdrucken zu sparen.</p>
<br/><p align="center">
<img src="pics/optionen-sicherung.png" width="525" height="503" /><br/>
<em>Sicherung</em></p><br/>

<p>&Uuml;ber den Bereich "Sicherung" k&ouml;nnen Sie eine automatische Sicherung anlegen lassen. Diese unterscheidet sich von der Funktion "Datei" &rarr; "Automatisch speichern" dadurch, dass den Dateinamen die aktuelle Uhrzeit hinzugef&uuml;gt wird. Dadurch existieren Backups mit denen die einzelnen &Auml;nderungen im Wettkampf nachvollzogen werden k&ouml;nnen.</p>
<br/><p align="center">
<img src="pics/optionen-csv.png" width="406" height="346" /><br/>
<em>CSV</em></p><br/>

<p>&Uuml;ber die Registerkarte "CSV" k&ouml;nnen Einstellungen zum CSV-Export und -Import vorgenommen werden. Diese beziehen sich auf die Trennzeichen, die beim CSV-Export/-Import ber&uuml;cksichtigt werden. In normalen CSV-Dateien werden "," als Trennzeichen benutzt. Microsoft Excel nutzt aber die aktuellen Spracheinstellungen zum Export und Import. Dadurch werden Zahlen mit "," getrennt z.B. "123,4" und das Trennzeichen ";" genutzt. Je nachdem mit welchen Programmen Sie arbeiten, m&uuml;ssen Sie diese Option entsprechend w&auml;hlen.</p>

<p><b>Anmerkung:</b> Auf Windows-Systemen wird automatisch die zu Excel kompatible Version gew&auml;hlt. Auf allen anderen Systemen die korrekte CSV-Darstellung.</p>
<br/><p align="center">
<img src="pics/optionen-elektronische-zeitnahme.png" width="525" height="453" /><br/>
<em>Elektronische Zeitnahme</em></p><br/>

<p>Die Verbindung von JAuswertung mit einer elektronischen Zeitmessanlage erfolgt &uuml;ber ein einfaches Netzwerkprotokoll. F&uuml;r die Zeitmessanlage "Ares 21" von "OMEGA Watches" steht eine Implementierung Namens "AlphaServer" zur Verf&uuml;gung. Als Server m&uuml;ssen Sie die Adresse des Rechners angeben, auf dem die Software l&auml;uft. </p>

<p><b>Hinweis:</b> Die Software "AlphaServer" ist ebenfalls OpenSource und damit kostenlos. Die grafische Benutzeroberfl&auml;che ist jedoch noch nicht offiziell freigegeben. Genauere Informationen zu dieser Software k&ouml;nnen unter <a target="_blank" href="info@dennismueller.de">info@dennismueller.de</a> nachgefragt werden.</p>
<br/><p align="center">
<img src="pics/optionen-werbung.png" width="525" height="453" /><br/>
<em>Werbung</em></p><br/>

<p>JAuswertung unterst&uuml;tzt das Einblenden von Werbebannern unter- bzw. oberhalb verschiedener Ausdrucke. Diese Einstellung wirkt sich nur auf Ausdrucke aus, die im Allgemeinen vor einem Wettkampf verschickt bzw. w&auml;hrend eines Wettkampfs ausgeh&auml;ngt werden. Ergebnisse k&ouml;nnen so z.B. den Logos von Sponsoren versehen werden.</p>
<br/><p align="center">
<img src="pics/optionen-http-server.png" width="525" height="453" /><br/>
<em>HTTP-Server</em></p><br/>

<p>&Uuml;ber die Registerkarte "HTTP-Server" k&ouml;nnen Sie den integrierten HTTP-Server von JAuswertung einstellen.  Zur Zeit k&ouml;nnen Sie den Port f&uuml;r den HTTP-Server &auml;ndern. Normalerweise sollten Sie den Standardport nutzen. Unter Linux kann es notwendig sein, den Port auf einen Wert &uuml;ber 1024 zu &auml;ndern, da die unteren Ports f&uuml;r Benutzer gesperrt sind. Beachten Sie aber, dass sich damit der Aufruf in ihrem Browser &auml;ndert. Der HTTP-Server kann normalerweise von ihrem Rechner aus &uuml;ber die URL "http:<i>localhost/index.html" angesprochen werden. Wenn Sie den Port auf z.B. 8080 &auml;ndern, sieht die URL wie folgt aus: "http:</i>localhost:8080/index.html". Den Port f&uuml;r den HTTP-Server k&ouml;nnen Sie nur &auml;ndern, wenn der HTTP-Server nicht gestartet ist.</p>

<p><b>Hinweis:</b> Der eigentliche Start des HTTP-Servers erfolgt &uuml;ber die Weltkugel in der oberen Knopfleiste. Mit dem HTTP-Server k&ouml;nnen Sie, wenn Sie mehrere Rechner vernetzen, direkt auf die Daten von JAuswertung zugreifen, ohne den Auswerter st&ouml;ren zu m&uuml;ssen. Beachten Sie aber, dass jede Anfrage Rechenzeit ben&ouml;tigt und den Rechner des Auswerters damit zus&auml;tzlich belastet. Dies gilt vor allem f&uuml;r den Download von PDF-Dateien. Sie sollten den HTTP-Server nur intern nutzen, da er nicht darauf ausgelegt ist, gro&szlig;e Mengen an Daten/Anfragen zu bew&auml;ltigen. </p>
<br/><p align="center">
<img src="pics/optionen-druckschrift.png" width="525" height="503" /><br/>
<em>Druckschrift</em></p><br/>

<p>&Uuml;ber die Registerkarte "Druckschrift" k&ouml;nnen Sie die Schriftart f&uuml;r Ausdrucke ausw&auml;hlen. Standardm&auml;&szlig;ig wird die Schriftart "DLRG Univers 55 Roman" gew&auml;hlt, sofern Sie vorhanden ist.</p>
<br/><p align="center">
<img src="pics/optionen-drucken.png" width="525" height="453" /><br/>
<em>Drucken</em></p><br/>

<p>&Uuml;ber die Registerkarte "Drucken" k&ouml;nnen Sie die Orientierung der Ergebnisse im Protokoll einstellen. Standardm&auml;&szlig;ig werden die Ergebnisse um 90 Grad gedreht gedruckt. Wird also das Protokoll im Hochformat gedruckt, erscheinen die Ergebnisse im Querformat. Bei dieser Einstellung werden die Ergebnisse in den meisten F&auml;llen am besten gedruckt. Wenn Sie die Ergebnisse im Hochformat erhalten wollen, so m&uuml;ssen Sie die Option "Ergebnisse waagrecht drucken" aktivieren. </p>

<p>Sie k&ouml;nnen festlegen, ob beim Druck von Lauflisten leeren Bahnen mitgedruckt werden ("Leere Bahnen drucken"). Zus&auml;tzlich k&ouml;nnen Sie festlegen, ob beim Druck von Startkarten auch f&uuml;r in einem Lauf nicht genutzte Bahnen Startkarten gedruckt werden sollen. </p>

<p>Bei der Disziplinenwertung ist es Geschacksache, ob die Punkte mitgedruckt werden sollen oder nicht ("Punkte bei der Disziplinenwertung drucken"). Zur einfacheren Unterscheidung von Ergebnissen unterst&uuml;tzt JAuswertung Checksummen, mit denen festgestellt werden kann, ob zwei Ergebnisse unterschiedlich sind. Diese Checksummen k&ouml;nnen auf jedes Ergebnis gedruckt werden ("Checksummen in Ergebnissen drucken"). Sind die Checksummen unterschiedlich, so sind auch die Ergebnisse unterschiedlich. Wenn die Checksummen gleich sind, ist die Wahrscheinlichkeit sehr hoch, dass die Ergebnisse gleich sind. In seltenen F&auml;llen kann es jedoch vorkommen, dass zwei Ergebnisse mit gleichen Checksummen unterschiedlich sind. Mit der Option "Nicht angetreten in der Strafenliste drucken" kann festgelegt werden, ob in Ausdrucken der Strafenliste auch "nicht angetretene" Schwimmer ber&uuml;cksichtigt werden. "Platzierungen in Ergebnissen drucken" erm&ouml;glicht es zu w&auml;hlen, ob die Platzierungen in den einzelnen Disziplinen bei der Mehrkampfwertung mitgedruckt werden. </p>

<p>Mit der Option "Namen der Mannschaftsmitglieder in der HLW-Liste drucken" besteht die M&ouml;glichkeit zu w&auml;hlen, ob die Namen der ersten vier Mannschaftsmitglieder in die HLW-Liste gedruckt werden sollen.</p>

<p>Die St&auml;rke von Graut&ouml;nen ist stark vom eingesetzten Drucker und den Einstellungen im Treiber abh&auml;ngig. Daher kann die Intensit&auml;t des Grautons f&uuml;r die Zeilenmarkierung in Tabellen manuell festgelegt werden. Dies geschiet &uuml;ber den Regler unter "Helligkeit der hervorgehobenen Zeilen".</p>
<h3>Das Men&uuml;: ?</h3>
<br/><p align="center">
<img src="pics/menu-info.png" width="89" height="86" /><br/>
<em>Men&uuml;: ?</em></p><br/>

<p>Dieses Men&uuml; bietet Informationen zu JAuswertung. Der Punkt "Hilfe" f&uuml;hrt zu dieser Anleitung, der Punkt "Tipps" zeigt ausgew&auml;hlte Hilfen an und der Punkt "Info", stellt einige Informationen zu JAuswertung dar.</p>
<br/><p align="center">
<img src="pics/tipps.png" width="448" height="262" /><br/>
<em>Tipps des Tages</em></p><br/>
<br/><p align="center">
<img src="pics/about.png" width="483" height="369" /><br/>
<em>&Uuml;ber JAuswertung</em></p><br/>
<hr />
<a name="knopfleisteoben__begin" /><h1 class="title">Obere Knopfleiste</h1>
<h2>Die obere Knopfleiste</h2>
<br/><p align="center">
<img src="pics/knopfleiste.png" width="810" height="29" /><br/>
<em>Obere Knopfleiste</em></p><br/>

<p>Diese Knopfleiste stellt Funktionen zur Verf&uuml;gung, die weitestgehend &uuml;ber Men&uuml;s zu erreichen sind. Die Funktionen entsprechen von Links nach Rechts den folgenden Men&uuml;punkten:
<ul><li>
<p><a href="#jauswertungmenus_neu">Datei &rarr; Neu</a></p>
</li><li>
<p><a href="#jauswertungmenus_neu">Datei &rarr; &Ouml;ffnen</a></p>
</li><li>
<p><a href="#jauswertungmenus_neu">Datei &rarr; Speichern</a></p>
</li><li>
<p><a href="#jauswertungmenus_undo">Bearbeiten &rarr; R&uuml;ckg&auml;ngig</a></p>
</li><li>
<p><a href="#jauswertungmenus_undo">Bearbeiten &rarr; Wiederholen</a></p>
</li><li>
<p><a href="#jauswertungmenus_laufliste">Werkzeuge &rarr; Laufliste &rarr; Bearbeiten/Anzeigen</a></p>
</li><li>
<p><a href="#jauswertungmenus_laufliste">Werkzeuge &rarr; HLW &rarr; Bearbeiten/Anzeigen</a></p>
</li><li>
<p><a href="#jauswertungmenus_datenpruefen">Werkzeuge &rarr; Daten pr&uuml;fen</a></p>
</li><li>
<p>HTTP-Server starten</p>
</li><li>
<p>Cache des HTTP-Servers l&ouml;schen</p>
</li><li>
<p>Ausgabefilter einstellen</p>
</li><li>
<p>Informationen &uuml;ber den aktuellen Stand der Eingabe</p>
</li></ul>
</p>

<p>Die Kn&ouml;pfe zur Bearbeitung der Laufliste und der HLW-Liste nehmen dabei eine Sonderstellung ein. Ist die Sperrung zur Bearbeitung einer Liste aktiviert, so wird der Knopf nicht deaktiviert sondern auf die Funktion "Anzeigen" umgeschaltet.</p>

<p>Mit dem Icon "Weltkugel" k&ouml;nnen Sie den HTTP-Server aktivieren bzw. wieder deaktivieren. Mit dem HTTP-Server k&ouml;nnen Sie, wenn Sie mehrere Rechner vernetzen, direkt auf die Daten von JAuswertung zugreifen, ohne den Auswerter st&ouml;ren zu m&uuml;ssen. Beachten Sie aber, dass jede Anfrage Rechenzeit ben&ouml;tigt und den Rechner des Auswerters damit zus&auml;tzlich belastet. Dies gilt vor allem f&uuml;r den Download von PDF-Dateien. Sie sollten den HTTP-Server nur intern nutzen, da er nicht darauf ausgelegt ist, gro&szlig;e Mengen an Daten/Anfragen zu bew&auml;ltigen. Beachten Sie bitte, dass der Aufruf der Seiten von der Einstellung des Ports abh&auml;ngt (siehe <a href="#jauswertungmenus_optionen">Extras &rarr; Optionen</a>).</p>

<p><a name="knopfleisteoben_ausgabefilter"></a>Rechts neben diesen Kn&ouml;pfen ist die Auswahl von "Ausgabefiltern" m&ouml;glich. Diese beeinflussen nicht die Eingabe und Auswertung eines Wettkampfs, k&ouml;nnen aber die Ausgabe einschr&auml;nken. So ist es m&ouml;glich die Meisterschaften z.B. mehrerer Bezirke in einem Wettkampf durchzuf&uuml;hren und getrennte Ergebnisse zu erstellen. Die Ausgabefilter beziehen sich nur auf die Ausgabe von Ergebnissen, Protokollen und Meldelisten beim Drucken und beim Export. Ist das Auswahlfeld deaktiviert, sind keine Ausgabefilter definiert. Sie k&ouml;nnen &uuml;ber den Men&uuml;punkt <a href="#jauswertungmenus_ausgabefilterbearbeiten">Extras &rarr; Ausgabefilter bearbeiten</a> Ausgabefilter einrichten und &auml;ndern. Funktione f&uuml;r Ausgaben z.B. Ausdrucke signalisieren, dass Sie von einem Ausgabefilter beeinflusst werden durch ein Icon "Auge".</p>
<hr />
<a name="knopfleistenlinks__begin" /><h1 class="title">Linke Knopfleisten</h1>

<p><a name="knopfleistenlinks_linkeknopfleiste"></a>&Uuml;ber die linke Knopfleisten k&ouml;nnen Sie durch die einzelnen Hauptfunktionen von JAuswertung bl&auml;ttern. Je nach ausgew&auml;hlten Knopf wird die entsprechende Funktion aktiviert. Beachten Sie, dass einige Funktionen nicht immer aktiviert sind. Wenn die gesamte Funktionalit&auml;t hinter einem Knopf deaktiviert ist, erscheint eine kurze Information dar&uuml;ber, wann diese Funktionalit&auml;t genutzt werden kann.</p>
<br/><p align="center">
<img src="pics/panel-anmeldung.png" width="400" height="513" /><br/>
<em>JAuswertung - Schwimmereingabe</em></p><br/>
<h3>Eingabe</h3>

<p>Durch einen Klick auf "Eingabe" wird die Eingabe von Teilnehmern oder Mannschaften aktiviert. Je nach aktuellem Wettkampf unterscheidet sich das Aussehen des Fensters, da bei einem Mannschaftswettkampf kein Vor- und Nachname existiert. Gelbe Felder m&uuml;ssen ausgef&uuml;llt werden, wei&szlig;e Felder k&ouml;nnen freigelassen werden. Wird keine Startnummer eingetragen, so wird automatisch die n&auml;chste freie Startnummer f&uuml;r den Schwimmer gew&auml;hlt.</p>

<p>Bei Mannschaftswettk&auml;mpfen k&ouml;nnen Sie auch mehrere Mannschaften einer Gliederung auf einmal hinzuf&uuml;gen. Geben Sie dazu wie gewohnt die Daten in den oberen Feldern ein. Zus&auml;tzlich schreiben Sie dann in das Feld Anzahl die gew&uuml;nschte Menge an Mannschaften und klicken auf den Hinzuf&uuml;gen-Knopf darunter. Die eingef&uuml;gten Mannschaften werden automatisch durchnummeriert. Wenn Sie also als Name "Musterort" gew&auml;hlt haben, werden die Mannschaften "Musterort 1", "Musterort 2", ... genannt. Beachten Sie dabei aber, dass die Mannschaften bis auf den Namen identisch sind. Sie sind also alle in der gleichen Altersklasse und nehmen mit den gleichen Meldezeiten an den gleichen Disziplinen teil.</p>

<p><b>Hinweis</b>: Wenn Sie neue Teilnehmer oder Mannschaften zu einem Wettkampf hinzuf&uuml;gen, nachdem Sie eine Laufliste erstellt haben, werden diese nicht automatisch in die Laufliste einsortiert. Sie k&ouml;nnen diese aber &uuml;ber den Lauflisteneditor manuell einsortieren, oder eine neue Laufliste erstellen.</p>
<h3>Meldungen</h3>

<p>Hier wird die aktuelle Meldeliste dargestellt. &Uuml;ber die Felder im linken Teil kann die Auswahl der dargestellten Teilnehmer bzw. Mannschaften eingeschr&auml;nkt werden. Dabei sind die Textfelder Filter, dass hei&szlig;t gibt man z.B. nur den Buchstaben g ein, werden alle Teilnehmer bzw. Mannschaften angezeigt, die den Buchstaben g im Namen tragen. Sind alle Felder leer, werden alle Teilnehmer bzw. Mannschaften dargestellt. Durch einen Rechtsklick auf einen Teilnehmer bzw. eine Mannschaft wird ein Kontextmen&uuml; ge&ouml;ffnet, dass das Bearbeiten und L&ouml;schen erlaubt, es k&ouml;nnen hier aber auch Strafen vergeben werden.</p>
<br/><p align="center">
<img src="pics/panel-meldungen.png" width="734" height="333" /><br/>
<em>Meldungen</em></p><br/>
<br/><p align="center">
<img src="pics/panel-meldungen-popup.png" width="213" height="155" /><br/>
<em>Meldungen: Rechtsklick</em></p><br/>
<br/><p align="center">
<img src="pics/panel-meldungen-laufanzeigen.png" width="202" height="231" /><br/>
<em>Meldungen: Laufanzeige</em></p><br/>
<br/><p align="center">
<img src="pics/schwimmer-bearbeiten.png" width="347" height="740" /><br/>
<em>Meldungen: Teilnehmer/Mannschaft bearbeiten</em></p><br/>
<br/><p align="center">
<img src="pics/panel-meldungen.png" width="734" height="333" /><br/>
<em>Meldungen</em></p><br/>

<p>Die Fenster zur Bearbeitung von Teilnehmern und Mannschaften unterscheiden sich nur geringf&uuml;gig und sind im Wesentlichen selbserkl&auml;rend.</p>

<p>Die Men&uuml;punkte "Disqualifizieren", "Ausschluss" und "Nicht Angetreten" f&uuml;gen dem ausgew&auml;hlten Schwimmer bzw. der ausgew&auml;hlten Mannschaft f&uuml;r alle Disziplinen diese Strafe hinzu. &Uuml;ber den Men&uuml;punkt "Strafe vergeben" k&ouml;nnen Sie &uuml;ber einen Assistenten eine genauere Strafe vergeben. </p>
<h4>Zeiteneingabe</h4>

<p>Hier k&ouml;nnen Sie Zeiten einzelner Schwimmer eingeben. Dazu k&ouml;nnen Sie im Bereich "Auswahl" angeben, welche Disziplin eingetragen werden soll und wie viele Schwimmer gleichzeitig angezeigt werden k&ouml;nnen. &Uuml;ber den Knopf "weiter" werden alle Felder wieder freigegeben. Diese Knopf ver&auml;ndert keine Daten, er schaft lediglich Platz f&uuml;r neue Eingaben. Im Bereich "Status" werden ggf. Eingabefehler angezeigt, dies soll nur zu ihrer Orientierung dienen. </p>
<br/><p align="center">
<img src="pics/panel-zeiteneingabe.png" width="683" height="379" /><br/>
<em>Zeiteneingabe mit fehlerhaften Angaben</em></p><br/>

<p>Im Bereich "Zeiteneingabe" findet die eigentlich Eingabe statt. Sie k&ouml;nnen in einem der Felder unter "Startnummer" die Startnummer eines Schwimmers eingeben. Genauere Angaben zu dem Schwimmer erscheinen dann direkt neben diesem Feld und das Feld unter "Zeiteneingabe" wird aktiviert und Sie k&ouml;nnen direkt eine Zeit eintragen. Beachten Sie, dass die Eingabe der Zeit direkt durchgef&uuml;hrt wird. Wenn Sie also eine Zeit von 1:23,4 eingeben, wird der entsprechende Schwimmer kurzzeitig eine Zeit von 0:00,1 dann von 0:01,2 dann von 0:12,3 und anschlie&szlig;end die richtige Zeit haben.</p>

<p>Es stehen zur einfacheren Eingabe folgende Tastaturk&uuml;rzel in den Feldern zur Zeiteneingabe zur Verf&uuml;gung:
<ul><li>
<p>"c" &ouml;ffnet den Dialog, um eine Strafe nach Fehlercode zu vergeben. Diese Strafe wird zu bestehenden Strafen hinzugef&uuml;gt.</p>
</li><li>
<p>"d" f&uuml;gt dem Teilnehmer/der Mannschaft eine "Disqualifikation" hinzu</p>
</li><li>
<p>"n" setzt den Teilnehmer/die Mannschaft auf "Nicht angetreten" (allerdings nur wenn keine Zeit eingegeben wurde)</p>
</li><li>
<p>"p" &ouml;ffnet ein Fenster zur Eingabe von Strafpunkten. Diese werden zu bestehenden Strafpunkten addiert.</p>
</li><li>
<p>"#" entfernt eingegebene Strafen</p>
</li></ul>
</p>
<br/><p align="center">
<img src="pics/panel-laufzeiten.png" width="729" height="425" /><br/>
<em>Laufzeiten</em></p><br/>
<br/><p align="center">
<img src="pics/strafencode.png" width="236" height="300" /><br/>
<em>Strafenvergabe mittels Code</em></p><br/>
<br/><p align="center">
<img src="pics/strafeneditor.png" width="446" height="332" /><br/>
<em>Strafeneditor</em></p><br/>
<br/><p align="center">
<img src="pics/strafeneditor-disziplin-nicht-gewaehlt.png" width="446" height="338" /><br/>
<em>Strafeneditor mit nicht gew&auml;hlter Disziplin (z.B. in derAK Offen)</em></p><br/>
<br/><p align="center">
<img src="pics/strafenwizard-code.png" width="394" height="168" /><br/>
<em>Strafenassistent: Code</em></p><br/>
<br/><p align="center">
<img src="pics/strafenwizard-details.png" width="394" height="346" /><br/>
<em>Strafenassistent: Details</em></p><br/>
<br/><p align="center">
<img src="pics/strafpunkte.png" width="236" height="300" /><br/>
<em>Strafpunkte vergeben</em></p><br/>
<h4>Laufzeiten</h4>

<p>Die Funktionen der "Laufzeiten" stehen nur zur Verf&uuml;gung wenn auch die Laufliste mit JAuswerung verwaltet wird, erm&ouml;glicht aber die h&ouml;chstm&ouml;gliche Eingabegeschwindigkeit. &Uuml;ber den Punkt "Lauf" im Bereich "&Uuml;bersicht" k&ouml;nnen Sie direkt den Lauf ausw&auml;hlen, den Sie eingeben m&ouml;chten. Im Rest des Bereichs "&Uuml;bersicht" werden n&auml;here Informationen zu dem entsprechenden Lauf dargestellt. Im Bereich "Lauf" werden die einzelnen Teilnehmer in der Reihenfolge ihrer Bahnen aufgelistet und Sie k&ouml;nnen direkt die Zeiten in dieser Reihenfolge eingeben. Die Eingabe der Zeit wird direkt durchgef&uuml;hrt und das Ergebnis aktualisiert.</p>

<p>Es stehen zur einfacheren Eingabe folgende Tastaturk&uuml;rzel in den Feldern zur Zeiteneingabe zur Verf&uuml;gung:
<ul><li>
<p>"c" &ouml;ffnet den Dialog, um eine Strafe nach Fehlercode zu vergeben. Diese Strafe wird zu bestehenden Strafen hinzugef&uuml;gt.</p>
</li><li>
<p>"d" f&uuml;gt dem Teilnehmer/der Mannschaft eine "Disqualifikation" hinzu</p>
</li><li>
<p>"n" setzt den Teilnehmer/die Mannschaft auf "Nicht angetreten" (allerdings nur wenn keine Zeit eingegeben wurde)</p>
</li><li>
<p>"p" &ouml;ffnet ein Fenster zur Eingabe von Strafpunkten. Diese werden zu bestehenden Strafpunkten addiert.</p>
</li><li>
<p>"#" entfernt eingegebene Strafen</p>
</li><li>
<p>"z" oder "," zeigen den Zieleinlauf des aktuellen Laufs an</p>
</li></ul>
</p>

<p>Der Knopf "Zielrichterentscheid" erm&ouml;glicht den Zugriff auf eine Funktion, die durch das DLRG-Regelwerk von 2008 eingef&uuml;hrt wurde. Die Beschreibung dazu finden Sie unter <a href="#jauswertungmenus_zielrichterentscheid">jauswertungmenus#zielrichterentscheid</a></p>

<p><b>Hinweis 1:</b> Mit den Cursor-Tasten k&ouml;nnen Sie zwischen den Bahnen und L&auml;ufen wechseln.</p>

<p><b>Hinweis 2:</b> Mit der Taste &lt;Enter&gt; k&ouml;nnen Sie die Eingabe einer Zeit beenden und zur n&auml;chsten Bahn wechseln. Wenn Sie die letzte Zeit eingegeben haben, wird automatisch der Zieleinlauf angezeigt.</p>
<h4>HLW Eingabe</h4>

<p>Die Eingabe der HLW-Punkte funktioniert nach dem gleichen System wie die Eingabe der Zeiten mit der "Zeiteneingabe". Als Besonderheit ist jedoch anzumerken, dass obwohl ein Teilnehmer bzw. eine Mannschaft gefunden wurde, dass Feld "HLW-Punkte" deaktiviert bleiben kann. Ist dies der Fall ist der Schwimmer in einer Altersklasse, in der keine HLW durchgef&uuml;hrt wird. Dieses Problem wird ebenfalls im Bereich "Status" angezeigt.</p>

<p>Bei der Eingabe von Mannschaften k&ouml;nnen die Punkte f&uuml;r jeden Schwimmer einzeln eingegeben werden. Dazu muss an die Startnummer ein Buchstabe "a", "b", "c" oder "d" angeh&auml;ngt werden. Der entsprechende Buchstabe wird automatisch auf die HLW-Startkarten gedruckt. Die ersten vier Schwimmer eine Mannschaft sind f&uuml;r die HLW vorgesehen. Der f&uuml;nfte Schwimmer nimmt nicht an der HLW teil.</p>
<br/><p align="center">
<img src="pics/panel-hlw-eingabe.png" width="576" height="442" /><br/>
<em>Eingabe von HLW-Punkten</em></p><br/>

<p><b>Hinweis:</b> Bei der HLW-Eingabe erm&ouml;glichen es die Texte "n" und "n.a." einen Schwimmer als "Nicht angetreten" zu markieren. Mit "d" kann ein Schwimmer als disqualifiziert markiert werden.</p>
<h4>HLW Barcodes</h4>

<p>JAuswertung druckt auf ausge&uuml;llte HLW-Checklisten und -Startkarten zwei Barcodes. Ein Barcode steht f&uuml;r "Bestanden" und der andere f&uuml;r "Nicht bestanden". Die Barcodes k&ouml;nnen mit handels&uuml;blichen Barcode-Scanners erkannt werden. Wird ein Barcode f&uuml;r einen Teilnehmer eingescannt, der bestanden hat, leuchtet "200 Punkte" in gr&uuml;n auf. Hat der Teilnehmer nicht bestanden, leuchtet "0 Punkte" in rot auf. Ist der Barcode nicht korrekt, leuchtet "Barcode nicht korrekt" in orange auf. Zus&auml;tzlich werden in den ersten beiden F&auml;llen weitere Informationen zu dem erkannten Teilnehmer angezeigt.</p>

<p><b>Hinweis:</b> Nicht alle Barcode-Scanner simulieren eine Tastatur.</p>

<p><b>Hinweis:</b> Geeignete Barcode-Scanner (1D-Code-Scanner) simulieren eine Tastatur. Achten Sie deshalb darauf, dass der Fokus auf das Eingabefeld gesetzt ist, wenn Sie einen Barcode scannen.</p>

<p><b>Hinweis:</b> Sie k&ouml;nnen diese Funktion auch ohne Barcode-Scanner nutzen. Tippen Sie dazu einfach die Ziffern unter dem Barcode in das Feld "Eingabe" und best&auml;tigen Sie mit &lt;Enter&gt;. Die Barcodes enthalten eine Checksumme und sind daher gegen Vertipper besser als die normale HLW-Eingabe abgesichert.</p>
<br/><p align="center">
<img src="pics/panel-hlw-barcodes.png" width="576" height="425" /><br/>
<em>HLW-Barcodes</em></p><br/>
<h4>Mannschaftsmitglieder</h4>

<p>In diesem Bereich k&ouml;nnen mit JTeams ausgedruckte Mannschaftsmeldeb&ouml;gen zur Meldung von Mannschaftsmitgliedern eingescannt werden. Der dort abgebildete QR-Code enth&auml;lt alle Informationen, um die eingegebenen Mannschaftsmitlieder der richtien Mannschafts zuzuordnen.</p>

<p><b>Hinweis:</b> Nicht alle 2D-Code-Scanner simulieren eine Tastatur.</p>

<p><b>Hinweis:</b> Geeignete 2D-Code-Scanner simulieren eine Tastatur. Achten Sie deshalb darauf, dass der Fokus auf das Eingabefeld gesetzt ist, wenn Sie einen QR-Code scannen.</p>

<p><b>Hinweis:</b> Es gibt neben 2D-Code-Scannern auch die M&ouml;glichkeit mittels App und Smartphone den Code einzuscannen und per Netzwerk zu &uuml;bertragen. Daf&uuml;r muss auf dem genutzen Rechner eine passende Zusatzsoftware des jeweiligen Anbieters installiert werden.</p>
<br/><p align="center">
<img src="pics/panel-mannschaftsmitglieder.png" width="773" height="510" /><br/>
<em>Mannschaftsmitglieder</em></p><br/>
<h4>Ergebnisse</h4>

<p>Die aktuellen Ergebnisse werden im unteren Bereich des Fensters dargestellt. Wenn Sie mehr Platz f&uuml;r andere Teile von JAuswertung ben&ouml;tigen, k&ouml;nnen Sie &uuml;ber die Optionen die "geteilte Darstellung" deaktivieren, wodurch die Ergebnisse &uuml;ber einen zus&auml;tzlichen Knopf in der linken Knopfleiste erreichbar sind und nicht mehr dauerhaft den unteren Fensterbereich belegen.</p>
<br/><p align="center">
<img src="pics/panel-ergebnisse.png" width="799" height="354" /><br/>
<em>Ergebnisse</em></p><br/>
<br/><p align="center">
<img src="pics/panel-ergebnisse-popup.png" width="154" height="101" /><br/>
<em>Ergebnisse: Rechtsklick</em></p><br/>

<p>Durch die Kn&ouml;pfe im oberen Bereich kann die gew&uuml;nschte Altersklasse sowie das Geschlecht ausgew&auml;hlt werden. Die Ansicht der Ergebniss kann auch zur Bearbeitung einzelner Schwimmer bzw. Mannschaften genutzt werden. &Uuml;ber einen Rechtsklick &ouml;ffnet sich das Popup-Men&uuml;, das bereits unter "Meldeliste" beschrieben wurde. Zus&auml;tzlich k&ouml;nnen bestimmte Funktionen per Doppelklick durchgef&uuml;hrt werden. Diese h&auml;ngen von der Spalte ab, in die geklickt wurde:
<ul><li>
<p>Platz, Name, Gliederung, Jahrgang, Punkte, Diff: &Ouml;ffnet das Fenster zum Bearbeiten eines Schwimmers bzw. einer Mannschaft.</p>
</li><li>
<p>Zeit, Punkte (Je Disziplin): &Ouml;ffnet ein Fenster zur Eingabe der Zeit f&uuml;r diese Diziplin.</p>
</li><li>
<p>Strafe (Je Disziplin): &Ouml;ffnet den Assistenten zur Vergabe einer Strafe f&uuml;r diese Disziplin.</p>
</li><li>
<p>HLW: &Ouml;ffnet ein Fenster zur Eingabe der HLW-Punkte.</p>
</li></ul>
</p>

<p><b>Hinweis:</b> Bei der HLW-Eingabe erm&ouml;glichen es die Texte "n" und "n.a." einen Schwimmer als "Nicht angetreten" zu markieren.</p>
<h4>Drucken</h4>

<p>Hier k&ouml;nnen die Daten in verschiedenen Varianten gedruckt werden. Die Kn&ouml;pfe sind nur dann aktiviert, wenn die entsprechenden Daten gedruckt werden k&ouml;nnen. Zu jeder Druckfunktion existiert eine Vorschau. &Uuml;ber diese kann auch das Seitenlayout eingestellt werden. Diese Einstellungen werden gespeichert und sind beim n&auml;chsten Start von JAuswertung wieder verf&uuml;gbar.</p>

<p>Um die Druckfunktionen &uuml;bersichtlicher zu gestalten wurden diese gruppiert. Die Gruppen haben die &Uuml;berschrift "Wettkampf", "Protokoll", "Ergebnisse", "Laufliste", "HLW-Liste" und "Vordrucke". Jede einzelne Gruppe k&ouml;nnen Sie durch eine Klick auf die Titelzeile ein- bzw. ausblenden, so dass Sie nur die Funktionen sehen, die Sie zur Zeit ben&ouml;tigen. Beim Start von JAuswertung ist nur die Gruppe "Wettkampf" ausgeklappt.</p>
<br/><p align="center">
<img src="pics/panel-drucken.png" width="517" height="248" /><br/>
<em>Drucken</em></p><br/>

<ul><li>
<p>Wettkampf:
<ul><li>
<p>Meldungen: Ausdruck einer kompakten Liste der Meldungen</p>
</li><li>
<p>Meldezeiten: Ausdruck aller Meldungen mit Meldezeiten</p>
</li><li>
<p>Startunterlagenkontrolle: Ausdruck der zur Kontrolle ausgelosten Teilnehmer bzw. Mannschaften</p>
</li><li>
<p>Dopingkontrolle: Ausdruck der zur Kontrolle ausgelosten Teilnehmer bzw. Mannschaften</p>
</li><li>
<p>Regelwerkseinstellungen: Detailierter Ausdruck aller Einstellung des Regelwerkseditors</p>
</li><li>
<p>Disziplinen: Kompakte Liste aller Disziplinen nach Altersklassen</p>
</li><li>
<p>Statistiken: Statistiken zum Wettkampf wie Teilnehmerzahlen und teilnehmende Gliederungen sowie gliederungssezifische Statistiken</p>
</li><li>
<p>Strafenkatalog: Liste aller Strafen des Strafenkatalogs</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-wettkampf.png" width="775" height="245" /><br/>
<em>Drucken: Wettkampf</em></p><br/>

<ul><li>
<p>Protokoll:
<ul><li>
<p>Protokoll: Vollst&auml;ndiges Protokoll des Wettkampfs gem&auml;&szlig; Regelwerk</p>
</li><li>
<p>Veranstaltungsinformationen: Ausdruck der Informationen aus "Datei" &rarr; "Eigenschaften"</p>
</li><li>
<p>Kampfrichter: Liste der Kampfrichter</p>
</li><li>
<p>Informationsseite: Ausdruck der Informationsseite aus "Datei" &rarr; "Eigenschaften"</p>
</li><li>
<p>Zielrichterentscheide: Liste der Zielrichterentscheide</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-protokoll.png" width="775" height="190" /><br/>
<em>Drucken: Protokoll</em></p><br/>

<ul><li>
<p>Ergebnisse:
<ul><li>
<p>Ergebnisse: Liste der Ergebnisse</p>
</li><li>
<p>Disziplinenwertung: Ergebnisse der Disziplinenwertung</p>
</li><li>
<p>Disziplinenwertung (altersklassen&uuml;bergreifend): Ergebnisse der Disziplinenwertung, wobei nur nach Disziplinen nicht aber nach Alterklassen unterschieden wird.</p>
</li><li>
<p>Gesamtwertung: Gesamtwertung des Wettkampfs</p>
</li><li>
<p>Siegerliste: Liste der ersten drei Pl&auml;tze f&uuml;r jede Altersklasse</p>
</li><li>
<p>Siegerliste je Disziplin: Liste der ersten drei Pl&auml;tze f&uuml;r jede Disziplin.</p>
</li><li>
<p>Medaillenspiegel: Ausdruck eines Medaillenspiegels</p>
</li><li>
<p>Laufzeiten: Tabellarischer Ausdruck der Zeiten nach L&auml;ufen</p>
</li><li>
<p>Strafenliste: Liste der vergebenen Strafen</p>
</li><li>
<p>Urkunden: Ausgef&uuml;llte Urkunden</p>
</li><li>
<p>Urkunden der Disziplinenwertung: Ausgef&uuml;llte Urkunden f&uuml;r die Disziplinenwertung</p>
</li><li>
<p>Weitermeldung: Ausdruck eines Meldebogens mit den Ergebnissen des Wettkampfs</p>
</li><li>
<p>HLW-Ergebnisse: Ausdruck der Ergebnisse der HLW</p>
</li><li>
<p>Schnellste Zeiten: Schnellste Zeiten je Disziplin und Altersklasse</p>
</li><li>
<p>Gebrochene Rec-Werte: Liste der gebrochenen Rec-Werte</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-ergebnisse.png" width="861" height="465" /><br/>
<em>Drucken: Ergebnisse</em></p><br/>

<ul><li>
<p>Laufliste:
<ul><li>
<p>Laufliste: Tabellarische Laufliste</p>
</li><li>
<p>Sprecherliste: Detaillierte Laufliste f&uuml;r Veranstaltungssprecher</p>
</li><li>
<p>Laufliste f&uuml;r Kampfrichter: Kompakte und &uuml;bersichtliche Laufliste f&uuml;r Kampfrichter (Wenn die Schriftart nicht zu breit ist, werden zwei L&auml;ufe in einer Zeile ausgedruckt)</p>
</li><li>
<p>Lauf&uuml;bersicht: Kurze &Uuml;bersicht &uuml;ber den Verlauf des Wettkampfs</p>
</li><li>
<p>Laufeinteilung: Liste der Teilnehmer bzw. Mannschaften mit den jeweiligen Starts</p>
</li><li>
<p>Kompakte Laufeinteilung: Kompakte Version der Laufeinteilung (ob diese gedruckt werden kann, h&auml;ngt von der Laufliste ab)</p>
</li><li>
<p>Bahnenliste: Liste der Starts je Bahn f&uuml;r Zeitnehmer</p>
</li><li>
<p>Ausgef&uuml;llte Startkarten: Ausgef&uuml;llte Startkarten (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li><li>
<p>Ausgef&uuml;llte Zieleinlaufkarten: Zieleinlaufkarten mit ausgef&uuml;lltem Lauf und Disziplin (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-laufliste.png" width="893" height="300" /><br/>
<em>Drucken: Laufliste</em></p><br/>

<ul><li>
<p>HLW-Liste
<ul><li>
<p>HLW-Liste: Tabellarische HLW-Laufliste</p>
</li><li>
<p>Puppenliste: Liste der Teilnehmer je Bahn f&uuml;r HLW-Kampfrichter</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Startkarten: Ausgef&uuml;llte HLW-Startkarten f&uuml;r Kampfrichter (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Checklisten: Ausgef&uuml;llte HLW-Checklisten f&uuml;r Kampfrichter</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Startkarten (ohne Zeiten und Bahnen): Ausgef&uuml;llte HLW-Startkarten - die Fehler Zeit und Bahn sind jedoch leer (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Checklisten (ohne Zeiten und Bahnen): Ausgef&uuml;llte HLW-Checklisten - die Fehler Zeit und Bahn sind jedoch leer</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-hlw-liste.png" width="893" height="190" /><br/>
<em>Drucken: HLW-Liste</em></p><br/>

<ul><li>
<p>Vordrucke:
<ul><li>
<p>Startkarten: Leere Startkarten</p>
</li><li>
<p>HLW-Startkarten: Leere HLW-Startkarten</p>
</li><li>
<p>HLW-Checkliste: Leere HLW-Checkliste</p>
</li><li>
<p>Zieleinlaufkarten: Leere Zieleinlaufkarten</p>
</li><li>
<p>Fehlermeldekarten: Leere Fehlermeldekarten</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-vordrucke.png" width="893" height="190" /><br/>
<em>Drucken: Vordrucke</em></p><br/>

<p>Einige Druckfunktionen werden durch die Ausgabefilter beeinflusst. Genaueres dazu erfahren Sie unter <a href="#jauswertungmenus_ausgabefilterbearbeiten">Ausgabefilter bearbeiten</a> und <a href="#knopfleisteoben_ausgabefilter">Ausgabefilter ausw&auml;hlen</a>. Wird eine Druckfunktion gerade durch einen Ausgabefilter beeinflusst, wird dies durch ein Symbol mit einem Auge dargestellt.</p>

<p><b>Tipp 1:</b> Zur Unterst&uuml;tzung beim Drucken von Ergebnissen und Protokollen werden unvollst&auml;ndige Eingaben, d.h. fehlende Zeiten bzw. HLW-Punkte, durch ein gelbes Ausrufezeichen signalisiert.</p>

<p><b>Tipp 2:</b> Die Startkarten f&uuml;r den Schwimmwettkampf und die HLW werden so gedruckt, dass die Startkarten einer Bahn hintereinander liegen.</p>

<p><b>Tipp 3:</b> Wenn Ausgabefilter aktiv sind, werden Funktionen, die davon betroffen sind, mit einem Symbol "Auge" markiert.</p>
<hr />
<a name="akse__begin" /><h1 class="title">Regelwerkseditor</h1>

<p><a name="akse_akse"></a>Der Regelwerkseditor dient zum Festlegen der folgenden Punkte:</p>

<ul><li>
<p>Formel zur Punktevergabe</p>
</li><li>
<p>Anzahl und Namen der Alterklassen</p>
</li><li>
<p>Anzahl der Disziplinen je Altersklasse (inkl. Festlegung von Rec-Werten und Namen)</p>
</li><li>
<p>Durchf&uuml;hrung einer HLW</p>
</li><li>
<p>Wertung in der Gesamtwertung</p>
</li><li>
<p>Einzelwertung ggf. mit HLW (Pl&auml;tze werden auch f&uuml;r jede einzelne Disziplin vergeben ggf. werden nur Teilnehmer ber&uuml;cksichtigt, die die HLW bestanden haben)</p>
</li><li>
<p>Auswahl von Disziplinen (Teilnehmer m&uuml;ssen nicht alle Disziplinen absolvieren. In diesen F&auml;llen kann festgelegt werden, wie viele Disziplinen mindestens und wie viele maximal geschwommen werden d&uuml;rfen.)</p>
</li><li>
<p>Bevorzugte Sortiermethode bei der Lauflistenerstellung</p>
</li></ul>
<br/><p align="center">
<img src="pics/aks-einzel.png" width="832" height="700" /><br/>
<em>Regelwerkseditor (Einzel)</em></p><br/>
<br/><p align="center">
<img src="pics/aks-mannschaft.png" width="832" height="700" /><br/>
<em>Regelwerkseditor (Mannschaft)</em></p><br/>
<br/><p align="center">
<img src="pics/aks-datei.png" width="163" height="197" /><br/>
<em>Men&uuml;: Datei</em></p><br/>
<br/><p align="center">
<img src="pics/aks-neu.png" width="445" height="267" /><br/>
<em>Neues Regelwerk anlegen</em></p><br/>
<br/><p align="center">
<img src="pics/aks-bearbeiten.png" width="127" height="69" /><br/>
<em>Men&uuml;: Bearbeiten</em></p><br/>

<p>Die zu bearbeitende Altersklasse kann in der linken Liste ausgew&auml;hlt werden. Ihre Einstellungen werden dann im rechten Bereich dargestellt. Mittels Drag'n'Drop k&ouml;nnen Sie die Reihenfolge der Altersklassen &auml;ndern und dar&uuml;ber hinaus steht ihnen ein Kontextmen&uuml; (rechte Maustaste) mit weiteren Funktionen wie z.B. dem Hinzuf&uuml;gen einer neuen Altersklasse zur Verf&uuml;gung.</p>
<h3>Regelwerkseditor w&auml;hrend eines Wettkampfs</h3>

<p>Wird der Regelwerkseditor w&auml;hrend der Auswertung eines Wettkampfes gestartet, k&ouml;nnen nur die folgenden Werte ge&auml;ndert werden:</p>

<ul><li>
<p>Formel zur Punktevergabe</p>
</li><li>
<p>Name der Altersklassen</p>
</li><li>
<p>Anzahl, Name und Rec-Werte der Disziplinen</p>
</li><li>
<p>Teilnahme an der HLW</p>
</li><li>
<p>Wertung in der Gesamtwertung</p>
</li><li>
<p>Einzelwertung ggf. mit HLW (Pl&auml;tze werden auch f&uuml;r jede einzelne Disziplin vergeben ggf. werden nur Teilnehmer ber&uuml;cksichtigt, die die HLW bestanden haben)</p>
</li><li>
<p>Auswahl von Disziplinen (Teilnehmer m&uuml;ssen nicht alle Disziplinen absolvieren. In diesen F&auml;llen kann festgelegt werden, wie viele Disziplinen mindestens und wie viele maximal geschwommen werden d&uuml;rfen.)</p>
</li><li>
<p>Bevorzugte Sortiermethode bei der Lauflistenerstellung</p>
</li></ul>
<h3>Gesamtwertung</h3>

<p>Dar&uuml;ber hinaus kann festgelegt werden, ob eine Gesamtwertung (eine Bewertung des Erfolgs der einzelnen Gliederungen) durchgef&uuml;hrt werden soll. Dabei stehen folgende Einstellungen zur Verf&uuml;gung:
<ul><li>
<p>"Gliederung muss an allen Altersklassen teilnehmen": Eine Gliederung, die in der Gesamtwertung aufgef&uuml;hrt werden m&ouml;chte, muss an allen Altersklassen teilnehmen. Dabei werden nur die Altersklassen ber&uuml;cksichtigt, die mit "Gesamtwertung" markiert sind.</p>
</li><li>
<p>"Punkte je Altersklasse normieren": Die Punkte jeder Altersklasse werden durch die Anzahl der Disziplinen geteilt. Dadurch wird sichergestellt, dass alle Altersklassen gleich gewichtet werden.</p>
</li><li>
<p>Gesamtwertungsmodus:
<ul><li>
<p>"Alle Mannschaften bzw. Teilnehmer werten": Es werden die Punkte aller Teilnehmer zur Gesamtwertung addiert.</p>
</li><li>
<p>"Beste Mannschaft bzw. besten Teilnehmer je Disziplin werten": Je Altersklasse und Disziplin wird jeweils nur der beste Teilnehmer gewertet.</p>
</li><li>
<p>"Beste Mannschaft bzw. besten Teilnehmer werten": In jeder Altersklasse wird nur der beste Teilnehmer gewertet.</p>
</li></ul>
</p>
</li></ul>
</p>

<p>Auch w&auml;hrend eines Wettkampfes k&ouml;nnen die Altersklassen in einer einzelnen Datei gespeichert werden, so dass diese sp&auml;ter wiederverwendet werden k&ouml;nnen.</p>
<br/><p align="center">
<img src="pics/aks-eigenschaften-1.png" width="701" height="695" /><br/>
<em>Eigenschaften: Allgemein</em></p><br/>
<br/><p align="center">
<img src="pics/aks-eigenschaften-2.png" width="701" height="695" /><br/>
<em>Eigenschaften: Gesamtwertung</em></p><br/>
<hr />
<a name="veranstaltungswertung__begin" /><h1 class="title">Veranstaltungswertung</h1>
<br/><p align="center">
<img src="pics/veranstaltungswertung-wettkaempfe.png" width="556" height="525" /><br/>
<em>Wettk&auml;mpfe</em></p><br/>
<br/><p align="center">
<img src="pics/veranstaltungswertung-gesamtwertung.png" width="556" height="525" /><br/>
<em>Wertung</em></p><br/>
<br/><p align="center">
<img src="pics/veranstaltungswertung-schriftart.png" width="556" height="525" /><br/>
<em>Schriftart</em></p><br/>
<br/><p align="center">
<img src="pics/veranstaltungswertung-ausgabe.png" width="556" height="525" /><br/>
<em>Ausgabe</em></p><br/>
<hr />
<a name="JTeams__begin" /><h1 class="title">JTeams</h1>
<hr />
<a name="alphaserver__begin" /><h1 class="title">AlphaServer</h1>
<hr />
<a name="Dateien__begin" /><h1 class="title">Enthaltene Dateien</h1>

<p><a name="Dateien_veranstaltungswertung"></a>Im Installationspaket sind nebem den Programmen ein paar Dateien enthalten, die w&auml;hrend eines Wettkampf n&uuml;tzlich sein k&ouml;nne.</p>
<hr />
<a name="punktetabellen__begin" /><h1 class="title">Punktetabellen</h1>

<p>Die Punktetabellen erm&ouml;glichen eine schnelle Einordnung einer Zeit in einen Punktebereich. Diese ist mit dem Regelwerk von 2007 aus zwei Gr&uuml;nden komplizierter geworden:</p>

<ul><li>
<p>Die gleiche Zeit in der gleichen Disziplin kann in zwei unterschiedlichen Altersklassen zu unterschiedlichen Punkten f&uuml;hren. Dies gilt insbesondere f&uuml;r die Altersklassen 12 bis Offen.</p>
</li><li>
<p>Die Rec-Werte werden nun jedes Jahr angepasst, so dass die Ergebnisse des letzten Jahres nicht mehr als Anhaltspunkt genutzt werden k&ouml;nnen.</p>
</li></ul>

<p>Es existiert jeweils eine Datei f&uuml;r die Einzel- und eine f&uuml;r die Mannschaftsdisziplinen. Die Dateien sind tabellarisch aufgebaut, wobei die Spalten zu einer bestimmten Altersklasse und Disziplin geh&ouml;ren. In den Zeilen sind die Zeiten angegeben, die man erreichen muss um mindestens die in der linken Spalte angegebene Punktzahl zu erreichen.</p>

<p><b>Anmerkung:</b> Wenn es nicht m&ouml;glich ist, die links angegebene Punktzahl genau zu treffen, so ist jeweils die Zeit angegeben, die als erste zu einer h&ouml;heren Punktzahl f&uuml;hrt.</p>

<p><b>Hinweis:</b> Die Punktetabellen d&uuml;rfen auch ohne JAuswertung weitergegeben werden. Bei einer Ver&auml;nderung der Datei m&uuml;ssen Hinweise auf alle Autoren sichtbar sein.</p>
<hr />
<a name="bahnenprotokoll__begin" /><h1 class="title">HLW-Bahnenprotkoll</h1>

<p>Mit dem HLW-Bahnenprotokoll kann jeder HLW-Richter aufzeichnen, welche Entscheidungen bisher getroffen worden sind. Dies erleichtert die Nachverfolgung und Beseitigung von Unstimmigkeiten. Es ist nicht zwingend f&uuml;r die HLW vorgesehen, erleichtert aber die Dokumentation.</p>

<p><b>Hinweis:</b> Das HLW-Bahnenprotokoll darf auch ohne JAuswertung weitergegeben werden. Bei einer Ver&auml;nderung der Datei m&uuml;ssen Hinweise auf alle Autoren sichtbar sein.</p>
<hr />
<a name="ablauf__begin" /><h1 class="title">Ablauf eines Wettkampfs</h1>

<p>Dieses Kapitel beschreibt, wie ein Wettkampf mit JAuswertung durchgef&uuml;hrt werden kann. Dabei f&auml;ngt ein Wettkampf bereits mit der Ausschreibung an und endet mit dem ver&ouml;ffentlichen der Ergebnisse im Internet. Dem entsprechend ergibt sich folgende Gliederung:</p>

<ul><li>
<p>Vorbereitungen: Was ist fr&uuml;hzeitig vor einem Wettkampf zu erledigen? Wie kann ich mir sp&auml;tere Arbeiten erleichtern?</p>
</li><li>
<p>Vor dem Wettkampf: Was ist kurz vor dem Wettkampf zu tun?</p>
</li><li>
<p>W&auml;hrend des Wettkampfs: Was ist w&auml;hrend des eigentlichen Wettkampfs zu tun?</p>
</li><li>
<p>Nach dem Wettkampf: Urkunden und Co.</p>
</li></ul>
<hr />
<a name="vorbereitungen__begin" /><h1 class="title">Vorbereitungen</h1>

<p>In dieser Phase gibt es vor allem zwei Fragen, die beantwortet werden m&uuml;ssen:</p>

<ol><li>
<p>Nach welchem Regelwerk soll geschwommen werden?</p>
</li><li>
<p>Wie sollen die Meldeunterlagen aussehen?</p>
</li><li>
<p>Soll die Meldung elektronisch erfolgen?</p>
</li></ol>
<h2>Regelwerk</h2>

<p>Die Frage des Regelwerks stellt sich bei den meisten Wettk&auml;mpfen. Dabei m&uuml;ssen folgende Kategorien von Wettk&auml;mpfen unterschieden werden:</p>

<ul><li>
<p>Meisterschaften</p>
</li><li>
<p>Freundschaftswettk&auml;mpfe (FWK)</p>
</li><li>
<p>Spa&szlig;wettk&auml;mpfe</p>
</li></ul>

<p>Bei Meisterschaften muss das aktuelle Regelwerk genutzt werden. FWKs werden meist in Anlehnung an das aktuelle Regelwerk durchgef&uuml;hrt und die Diszipline direkt oder leicht abgewandelt &uuml;bernommen. Bei Spa&szlig;wettk&auml;mpfen werden in der Regel vollst&auml;ndig eigene Disziplinen erstellt. Letztendlich bilden die gew&auml;hlten Disziplinen auch die Grundlage f&uuml;r die Ausschreibung und die Meldeunterlagen. Wenn Sie eigene Disziplinen einf&uuml;hren, m&uuml;ssen Sie mit dem <a href="#akse_akse">Regelwerkseditor</a> diese eingeben. Nur dann k&ouml;nnen Sie sp&auml;ter einen Wettkampf mit diesen Disziplinen durchf&uuml;hren.</p>
<h2>Meldungeunterlagen</h2>

<p>Die Meldundeunterlagen sollten so aussehen, wie die, die auf www.dennismueller.de ver&ouml;ffentlicht sind. Sie finden dort unterschiedliche Vorlagen f&uuml;r die jeweiligen Wettk&auml;mpfe z.B. Meisterschaften oder Freundschaftswettk&auml;mpfe.</p>
<h2>Elektronische Meldung</h2>

<p>Die elektronische Meldung hat folgende Vorteile:
<ul><li>
<p>Einfachere &Uuml;bernahme der Daten in das Auswertungsprogramm</p>
</li><li>
<p>Die Eingabe kann eingeschr&auml;nkt werden, so dass nur sinnvolle Eingaben m&ouml;glich sind</p>
</li><li>
<p>Kein Papier und keine Versandkosten</p>
</li></ul>
</p>

<p>Sie hat allerdings auch einige Nachteile:
<ul><li>
<p>Ein Internetzugang f&uuml;r jede meldende Gliederung ist n&ouml;tig.</p>
</li><li>
<p>Ein gewisses technisches Verst&auml;ndnis wird vorausgesetzt.</p>
</li><li>
<p>Ggf. m&uuml;ssen die Meldelisten in unterschiedlichen Dateiformaten zur Verf&uuml;gung gestellt werden, um keine Personen auszuschlie&szlig;en.</p>
</li></ul>
</p>

<p>Letztendlich ist es ihre Entscheidung.</p>
<hr />
<a name="vordemwettkampf__begin" /><h1 class="title">Vor dem Wettkampf</h1>

<p>Kurz vor dem Wettkampf stehen folgende T&auml;tigkeiten an:</p>

<ul><li>
<p>Eingabe bzw. Import der Meldungen</p>
</li><li>
<p>Erstellen einer offiziellen Meldeliste</p>
</li><li>
<p>Erstellen von Lauf- und HLW-Listen</p>
</li><li>
<p>Ausdruck von Unterlagen f&uuml;r Kampfrichter und Betreuer</p>
</li></ul>
<h2>Eingabe bzw. Import der Meldungen</h2>

<p>Wie die &Uuml;berschrift bereits sagt, haben Sie zwei M&ouml;glichkeiten die Daten in einen Wettkampf einzupflegen: Eingabe oder Import. Bevor Sie dies jedoch machen k&ouml;nnen m&uuml;ssen Sie einen neuen Wettkampf erstellen. Die tun Sie &uuml;ber "Datei" &rarr; "Neu". Hier k&ouml;nnen Sie die Art des Wettkampfs und das verwendete Regelwerk ausw&auml;hlen. Wenn Sie ein eigenes Regelwerk (&uuml;ber den Regelwerkseditor) definiert haben, k&ouml;nnen Sie dieses &uuml;ber "benutzerdefiniert" ausw&auml;hlen.</p>

<p>Wollen Sie eine Meldeliste importieren, so k&ouml;nnen Sie dies &uuml;ber "Datei" &rarr; "Importieren" tun. Folgen Sie einfach den Schritten des Importassistenten. Am Ende des Assistenten werden ihnen alle Eintr&auml;ge angezeigt, die importiert werden. Sie k&ouml;nnen so &uuml;berpr&uuml;fen, ob wirklich alles importiert werden konnte.</p>

<p>Wenn Sie die Daten manuell eingeben wollen, so w&auml;hlen Sie in der linken Knopfleiste den Punkt "Eingabe". Im Bereich rechts davon erscheint nun eine Eingabemaske. Hier k&ouml;nnen Sie die Teilnehmer bzw. Mannschaften nacheinander eingeben. Wenn eine Gliederung mehrere Mannschaften in einer Altersklasse gemeldet hat, k&ouml;nnen Sie die entsprechende Menge im Feld "Anzahl" eingeben und den darunterliegenenden Knopf "Hinzuf&uuml;gen" w&auml;hlen. Es werden dann automatisch mehrere Mannschaften hinzugef&uuml;gt. Die Namen der Mannschaften werden dabei durchnummeriert. Nachdem Sie auf diese Weise alle Teilnehmer bzw. Mannschaften eingetragen haben, k&ouml;nnen Sie noch &uuml;ber den Men&uuml;punkt "Bearbeiten" &rarr; "Meldezeiten" die Meldezeiten der einzelnen Schwimmer eintragen. Dies ist aber nur erforderlich, wenn Sie die Laufliste nach Meldezeiten erstellen wollen.</p>
<h2>Erstellen einer offiziellen Meldeliste</h2>

<p>Nachdem Sie die Eingabe abgeschlossen haben, k&ouml;nnen Sie &uuml;ber den Men&uuml;punkt "Datei" &rarr; "Exportieren", die Meldeliste in einem Format ihrer Wahl exportieren. Am besten geeignet ist sind zu diesem Zweck die Formate Excel und PDF.</p>
<h2>Erstellen von Lauf- und HLW-Listen</h2>

<p>Da die Erstellung von Lauf- und HLW-Listen im wesentlichen gleich funktioniert, soll hier nur die Erstellung von Lauflisten besprochen werden. &Uuml;ber den Men&uuml;punkt "Bearbeiten" &rarr; "Laufliste" &rarr; "Neu" rufen Sie den Assistenten zur Erstellung von Lauflisten auf. Dieser f&uuml;hrt Sie schrittweise durch die Erstellung. </p>

<p>&Uuml;ber den Men&uuml;punkt "Bearbeiten" &rarr; "Laufliste" &rarr; "Bearbeiten", k&ouml;nnen Sie sich das Ergebnis anzeigen lassen und &auml;ndern. Dies ist vor allem dann sinnvoll, wenn einige Altersklassen nicht so stark besetzt sind. Sie k&ouml;nnen hier einzelne Eintr&auml;ge durch Doppelklick entfernen oder via Drag'n'Drop verschieben. Entfernte Eintr&auml;ge werden (genauso wie nach der Erstellung eingegebene Teilnehmer) in der Warteliste aufgef&uuml;hrt und k&ouml;nnen sp&auml;ter wieder in die Laufliste &uuml;bernommen werden. Sie k&ouml;nnen also auf diese Weise z.B. L&auml;ufe zusammenlegen oder die Zusammenstellung &auml;ndern. Ob Sie dabei Altersklassen oder Disziplinen mischen, wird ihnen f&uuml;r jeden Lauf angezeigt:
<ul><li>
<p>Wenn Sie in einem Lauf AK 12 m&auml;nnlich und weiblich mischen, so steht in der zweiten Spalte "AK 12 gemischt".</p>
</li><li>
<p>Wenn Sie in einem Lauf AK 12 und AK 13/14 mischen, so steht in der zweiten Spalte "Gemischt".</p>
</li></ul>
</p>

<p>&Uuml;ber ein Kontextmen&uuml; (rechte Maustaste) k&ouml;nnen Sie neue L&auml;ufe hinzuf&uuml;gen bzw. bestehende entfernen. Eingef&uuml;gte L&auml;ufe werden dabei durchbuchstabiert, so dass ein Lauf, der nach Lauf 10 eingef&uuml;gt wird, z.B. 10a hei&szlig;t. So m&uuml;ssen die Nummern der nachfolgenden L&auml;ufe nicht ver&auml;ndert werden. Dies ist vor allem w&auml;hrend des Wettkampfs n&ouml;tig, damit gedruckte Startkarten ihre G&uuml;ltigkeit behalten. Da dies bisher nicht geschehen ist, kann die Nummerierung der L&auml;ufe &uuml;ber das Men&uuml; "Datei" zur&uuml;ckgesetzt werden, so dass die L&auml;ufe wieder fortlaufend nummeriert sind.</p>
<h2>Ausdruck von Unterlagen f&uuml;r Kampfrichter und Betreuer</h2>

<p>JAuswertung bietet eine Reihe von Druckm&ouml;glichkeiten f&uuml;r unterschiedliche Zielgruppen. Dies erm&ouml;glicht es, f&uuml;r jeden die gew&uuml;nschten Information so zu pr&auml;sentieren, wie er Sie ben&ouml;tigt.</p>

<ul><li>
<p>Zeitnehmer: Ausgef&uuml;llte Startkarten, Bahnenliste (Liste aller Schwimmer einer Bahn)</p>
</li><li>
<p>Zieleinlauf: Ausgef&uuml;llte Zieleinlaufkarten (Lauf, Wettkampf, Altersklasse und Geschlecht)</p>
</li><li>
<p>Sprecher: Sprecherliste (Detailierte Laufliste)</p>
</li><li>
<p>HLW-Kampfrichter: Ausgef&uuml;llte HLW-Startkarten oder -Checklisten, Puppenliste (Liste aller Teilnehmer an einer Puppe)</p>
</li><li>
<p>Wettkampfleiter, Starter, Wenderichter, ...: Lauf&uuml;bersicht</p>
</li><li>
<p>Betreuer und Schwimmer: (kompakte) Laufeinteilung</p>
</li></ul>

<p>Dar&uuml;ber hinaus sollten noch eine Reihe von nicht ausgef&uuml;llten Zieleinlaufkarten, Startkarten etc. vorhanden sein. Diese k&ouml;nnen Sie ebenfalls mit JAuswertung ausdrucken (Bereich "Vordrucke").</p>

<p><b>Anmerkung:</b> Die kompakten Laufeinteilungen stehen nur zur Verf&uuml;gung, wenn die Laufliste einige Anforderungen erf&uuml;llt. Ist dies nicht der Fall m&uuml;ssen Sie normalen Laufeinteilungen nutzen.</p>
<hr />
<a name="whrenddeswettkampfs__begin" /><h1 class="title">W&auml;hrend des Wettkampfs</h1>

<p>W&auml;hrend des Wettkampfs haben Sie eigentlich nur zwei Aufgaben:</p>

<ol><li>
<p>Eingabe von Zeiten und Strafen</p>
</li><li>
<p>Aushang von (Zwischen-) Ergebnissen</p>
</li></ol>

<p>Bei Freundschafts- und Spa&szlig;wettk&auml;mpfen kommen noch regelm&auml;&szlig;ige &Auml;nderungen von Name und Teilnahmen hinzu, dies soll aber nicht weiter st&ouml;ren.</p>
<h2>Eingabe von Zeiten</h2>

<p>Solange Sie die Laufeinteilung des Wettkampfs ebenfalls mit JAuswertung durchf&uuml;hren, werden Sie f&uuml;r die Eingabe der Zeiten nicht viel Zeit ben&ouml;tigen. W&auml;hlen Sie in der linken Knopfleiste dazu den Punkt "Laufzeiten". Daraufhin erscheint auf der rechten Seite eine Eingabemaske, in der Sie die Zeiten eines Laufs eingeben k&ouml;nnen.</p>

<p>Die Zeiten werden f&uuml;r jede Bahn ohne Zusatzzeichen eingegeben. Aus der Zeit 1:02,34 wird als 10234. Im Feld neben dem Eingabefeld wird dann die Zeit korrekt (mit Zeichen) dargestellt. Zwischen den einzelnen Bahnen k&ouml;nnen Sie mit der Pfeiltaste unten (n&auml;chste Bahn) und der Pfeiltaste oben (vorherige Bahn) wechseln. Zwischen den L&auml;ufen k&ouml;nnen Sie wechseln, indem Sie in der der letzten belegten Bahn die Pfeiltaste unten (n&auml;chster Lauf) und in der ersten belegten Bahn die Pfeiltaste oben (vorheriger Lauf) dr&uuml;cken. Dar&uuml;ber hinaus k&ouml;nnen Sie einen Schwimmer mit n als "Nicht angetreten" markieren. Mit # k&ouml;nnen Sie vergebene Strafen annullieren.</p>

<p>Bei Freundschafts- und Spa&szlig;wettk&auml;mpfen k&ouml;nnen Sie zus&auml;tzlich &uuml;ber d (Disqualifikation), p (Strafpunkte) und a (Ausschluss) Strafen vergeben. F&uuml;r Meisterschaften sollten die Strafen genau (Mit Begr&uuml;ndung und Strafencode) festgelegt werden.</p>

<p>Nachdem Sie einen Lauf eingegeben haben, k&ouml;nnen Sie sich mit z oder , den Zieleinlauf anzeigen lassen. Dieser sollte mit dem offiziellen Zieleinlauf &uuml;bereinstimmen. Ist dies nicht der Fall, sollten Sie zuerst Ihre Eingabe &uuml;berpr&uuml;fen und in dem Fall, dass die Eingabe korrekt ist, den Lauf zur endg&uuml;ltigen Entscheidung weiterreichen. Normalerweise &uuml;bernimmt die Kampfrichterposition "Auswerter" (Sie sind streng genommen der "Protokollf&uuml;hrer") bereits diese &Uuml;berpr&uuml;fung. Es gibt aber F&auml;lle bei denen diese Position nicht besetzt wird (z.B. bei Freundschaftswettk&auml;mpfen) oder sich der Auswerter auch mal "verliest".</p>
<h3>&Uuml;bersicht der Tastaturk&uuml;rzel</h3>

<ul><li>
<p>Cursor unten: N&auml;chste Zeile</p>
</li><li>
<p>Cursor oben: Vorherige Zeile</p>
</li><li>
<p>n: Nicht Angetreten</p>
</li><li>
<p>d: Disqualifikation</p>
</li><li>
<p>a: Ausschluss</p>
</li><li>
<p>p: Strafpunkte</p>
</li><li>
<p>c: Strafenvergabe nach Code</p>
</li><li>
<p>#: Strafe annullieren</p>
</li><li>
<p>z oder ,: Zieleinlauf anzeigen</p>
</li></ul>

<p><b>Tipp:</b> Zur Eingabe von Zeiten in dieser Maske gen&uuml;gt der Nummernblock einer Tastatur.</p>
<h2>Eingabe von Strafen</h2>

<p>Die Eingabe von Strafen kann wie oben angegeben &uuml;ber Tastaturk&uuml;rzel bei der Zeiteneingabe genutzt werden. Alternativ k&ouml;nnen Sie den Knopf "Strafe" nutzen, der in der Zeiteneingabe und in der Laufzeiteneingabe zur Verf&uuml;gung steht.</p>

<p>Eine weitere Alternative besteht darin, in der Ergebnistabelle auf das entsprechende Feld (also Zeile des betroffenen Schwimmers und Spalte der Disziplin) mit der rechten Maustaste zu klicken und dort "Strafe vergeben" auszuw&auml;hlen.</p>
<h2>Aushang von (Zwischen-) Ergebnissen</h2>

<p>Im Bereich "Ergebnisse" k&ouml;nnen Sie Ergebnisse und Zwischenergebnisse gedruckt werden. In der Auswahlbox k&ouml;nnen Sie ausw&auml;hlen bis zu welcher Disziplin der Ausdruck erfolgen soll. Damit k&ouml;nnen Sie auch dann noch Zwischenergebnisse aush&auml;ngen, wenn Sie bereits Zeiten der n&auml;chsten Disziplin eingegeben haben.</p>

<p><b>Tipp 1:</b> Ein gelbes Dreieck mit wei&szlig;em Blitz signalisiert, dass Sie noch nicht alle Daten eingegeben haben, die f&uuml;r diesen Ausdruck ben&ouml;tigt werden. W&auml;hlen Sie dann "Bearbeiten" &rarr; "Daten pr&uuml;fen", um eine Liste aller noch nicht eingegebenen Daten zu erhalten. Dort ist nat&uuml;rlich auch die direkte Eingabe m&ouml;glich.</p>

<p><b>Tipp 2:</b> Nutzen Sie regelm&auml;&szlig;ig die Funktion "Bearbeiten" &rarr; "Daten pr&uuml;fen". Damit k&ouml;nnen Sie m&ouml;gliche Fehler bereits fr&uuml;h erkennen.</p>

<p><b>Tipp 3:</b> Die HLW-Punkte werden nur mit den Endergebnissen gedruckt.</p>

<p><b>Tipp 4:</b> Da mit dem Regelwerk 2007 eine Durchsage von Strafpunkten nicht mehr notwendig ist, kann es sinnvoll sein zus&auml;tzlich zu den Ergebnissen eine Strafenliste auszuh&auml;ngen.</p>
<hr />
<a name="nachdemwettkampf__begin" /><h1 class="title">Nach dem Wettkampf</h1>

<p>Abschlie&szlig;end bleiben noch zwei Aufgaben offen:</p>

<ul><li>
<p>Urkundendruck</p>
</li><li>
<p>Ver&ouml;ffentlichung der Endergebnisse</p>
</li></ul>
<h2>Urkundendruck</h2>

<p>Um die Urkunden automatisch zu drucken, k&ouml;nnen Sie mit JAuswertung die Ergebnisse vorzugsweise in eine Excel- oder CSV-Datei exportieren. Diese beiden Formate k&ouml;nnen von den meisten Textverarbeitungsprogrammen problemlos als Quelle f&uuml;r einen Seriendruck genutzt werden.</p>

<p>Wenn Sie alle Urkunden w&auml;hrend der Siegerehrung verteilen wollen, sollten Sie fr&uuml;h anfangen, diese zu drucken. Dies bedeutet in der Regel, dass die ersten Urkunden gedruckt werden, sobald die erste Altersklasse alle Disziplinen absolviert hat bzw. die Einspruchsfrist verstrichen ist. Solange nicht mehrere schnelle Drucker zur Verf&uuml;gung stehen, sollten Sie von einem vollst&auml;ndigen Urkundendruck absehen.</p>

<p><b>Tipp:</b> Viele Drucker kann man beschleunigen, indem man auf aufw&auml;ndige Grafiken verzichtet. Es ist also ggf. sinnvoll Grafiken bereits vorher zu drucken bzw. drucken zu lassen und am Wettkampftag nur noch den Text zu drucken.</p>
<h2>Ver&ouml;ffentlichung der Endergebnisse</h2>

<p>Die Endergebnisse k&ouml;nnen in verschiedenen Formaten ver&ouml;ffentlicht werden. Dies geschieht &uuml;ber den Men&uuml;punkt "Datei" &rarr; "Exportieren". F&uuml;r die Ver&ouml;ffentlichung im Internet bieten sich vor allem folgende Formate an:</p>

<ul><li>
<p>HTML: Zum direkten Lesen im Browser</p>
</li><li>
<p>Zipped HTML: Bietet eine Zip-Datei, in der jede Altersklasse eine eigene HTML-Datei besitzt. Zur Ver&ouml;ffentlichung im Netz sollte das Archiv entpackt werden.</p>
</li><li>
<p>PDF: Zum Herunterladen, Archivieren und Ausdrucken</p>
</li><li>
<p>Excel/CSV: Zur leichteren Weiterverwendung der Daten</p>
</li></ul>
<hr />
<a name="system__begin" /><h1 class="title">Systemvoraussetzungen</h1>
<h2>Betriebssysteme</h2>
<h3>Unterst&uuml;tzt:</h3>

<ul><li>
<p>Windows XP, Vista, 7</p>
</li><li>
<p>Linux</p>
</li><li>
<p>MacOS X</p>
</li></ul>
<h3>Empfohlen:</h3>

<ul><li>
<p>Windows XP oder 7</p>
</li><li>
<p>Linux</p>
</li></ul>
<h2>Systemkonfiguration</h2>
<h3>Minimalkonfiguration</h3>

<ul><li>
<p>Hardware
<ul><li>
<p>Pentium III (oder entsprechender Prozessor) mit 500Mhz</p>
</li><li>
<p>128 MB Arbeitsspeicher</p>
</li><li>
<p>100 MB freie Festplattenkapazit&auml;t</p>
</li><li>
<p>Grafikkarte und Monitor mit einer genutzten Aufl&ouml;sung von 1024x768</p>
</li></ul>
</p>
</li><li>
<p>Programme
<ul><li>
<p>Java Runtime Environment 6 (kostenlos)</p>
</li><li>
<p>Zur Anzeige von HTML-Dateien: Internet Explorer (kostenlos), Firefox (kostenlos) oder andere</p>
</li></ul>
</p>
</li></ul>
<h3>Empfohlene Konfiguration</h3>

<ul><li>
<p>Hardware
<ul><li>
<p>Pentium IV (oder entsprechender Prozessor) mit 1Ghz</p>
</li><li>
<p>512 MB Arbeitsspeicher</p>
</li><li>
<p>500 MB freie Festplattenkapazit&auml;t</p>
</li><li>
<p>Grafikkarte und Monitor mit einer genutzten Aufl&ouml;sung von 1280x1024 Pixel</p>
</li><li>
<p>Drucker</p>
</li></ul>
</p>
</li><li>
<p>Software
<ul><li>
<p>Java Runtime Environment 6.0 Update 20 (kostenlos)</p>
</li><li>
<p>Zur Anzeige von HTML-Dateien: Internet Explorer (kostenlos), Firefox (kostenlos) oder andere</p>
</li><li>
<p>Zur Bearbeitung von Excel-Dateien: Microsoft Office oder OpenOffice (kostenlos)</p>
</li><li>
<p>Zur Anzeige von PDF-Dateien: Adobe Acrobat Reader (kostenlos)</p>
</li></ul>
</p>
</li></ul>
<hr />
<a name="download__begin" /><h1 class="title">Download</h1>

<p>Das Installationsprogramm und JAuswertung ben&ouml;tigen eine installierte Java-Version (1.6 oder h&ouml;her). Sollte diese nicht installiert sein, k&ouml;nnen Sie die aktuelle Version auf den Java-Seiten der Firma Sun Microsystems (<a target="_blank" href="http://www.java.com">http://www.java.com</a>) herunterladen. Vor der Installation einer neuen Version von JAuswertung sollten Sie unbedingt vorhandene &auml;ltere Versionen deinstallieren. Beachten Sie bitte die <a href="#system__begin">Systemvoraussetzungen</a>.</p>
<h2>Namensgebung der Downloads</h2>

<p>Installationsprogramm f&uuml;r Windows: JAuswertung-???.exe<br />
Installationsprogramm alle anderen Betriebssysteme: JAuswertung-???.jar<br />
Quelltext: JAuswertung-???-src.zip</p>

<p><b>Hinweis:</b> Die Fragezeichen stehen f&uuml;r die jeweilige Versionsnummer (z.B. 9.0).</p>

<p><b>Hinweis:</b> Die beiden Windows-Installationsprogramme unterscheiden sich darin, ob Sie eine Java-Runtime enthalten oder nicht. Wenn Sie sich nicht sicher sind, welches Installationsprogramm Sie ben&ouml;tigen, sollten Sie die Version mit Java nutzen.</p>
<h2>Downloadseiten</h2>

<p>Die Dateien finden Sie im Downloadbereich von <a target="_blank" href="www.dennismueller.de">www.dennismueller.de</a>. Die Dateien werden nicht direkt auf meiner Homepage angeboten, sondern nutzen den Download-Bereich von SourceForge.net. Daher sind zum Download dieser Dateien einige Englischkenntnisse notwendig. Sollten Sie Probleme beim Download von JAuswertung haben, wenden Sie sich an support@dennismueller.de.</p>
<hr />
<h1 class="title">Anhang</h1>
<hr />
<h1 class="title">FAQ</h1>
<h3>Was bedeuten die unterschiedlichen Farben in Eingabefeldern?</h3>

<p>Gelb markiert Felder m&uuml;ssen ausgef&uuml;llt werden. Rot markierte Felder enthalten fehlerhafte Angaben.</p>
<h3>JAuswertung wird w&auml;hrend der Ausf&uuml;hrung langsamer und belegt mehr Speicher. Woran liegt das?</h3>

<p>JAuswertung richtet einige Funktionen erst dann ein, wenn Sie zum ersten mal ben&ouml;tigt wurden. Dies reduziert zum Einen die Zeit, die zum Starten ben&ouml;tigt wird, und zum Anderen auch den Speicherbedarf w&auml;hrend des Betriebs. Jedes mal, wenn Sie eine Funktion aufrufen, die Sie bisher nicht ben&ouml;tigt haben, wird diese eingerichtet und belegt ab diesem Zeitpunkt zus&auml;tzlichen Arbeitsspeicher.</p>
<h3>Ich habe einen Fehler gefunden, wo kann ich diesen melden?</h3>

<p>Fehler im Programm k&ouml;nnen Sie an support@dennismueller.de schicken oder im Forum auf der Webseite melden.</p>
<h3>Wie kann ich die Warnung bei hohen Zeiten abschalten?</h3>

<p>&Uuml;ber den Men&uuml;punkt Extras&rarr;Option k&ouml;nnen Sie im Register Allgemein die Warnung abschalten.</p>
<h3>Welche Tastaturk&uuml;rzel stehen bei der Eingabe zur Verf&uuml;gung?</h3>

<p>Antwort: Bei der Zeiten- und Laufzeiteneingabe k&ouml;nnen direkt Strafen vergeben werden: "n" setzt nur solange keine Zeit eingetragen wurde "Nicht Angetreten", "d" setzt immer "Disqualifiziert", "p" &ouml;ffnet ein Fenster zur Strafpunkteeingabe und "#" l&ouml;scht immer eine Strafe.</p>

<p>Bei der Zeiten-, Laufzeiten- und HLW-Eingabe k&ouml;nnen Sie zwischen den einzelnen Zeilen durch dr&uuml;cken der Tasten Pfeiltaste oben und unten wechseln. Mit "Strg + Enter" dr&uuml;cken Sie den Button "weiter". Bei der Laufzeiteneingabe k&ouml;nnen Sie mit den Pfeiltasten oben und unten zwischen den einzelnen Bahnen wechseln, sind Sie in der ersten oder letzten belegten Bahn angekommen, k&ouml;nnen Sie durch erneutes Dr&uuml;cken der jeweiligen Pfeiltaste zum n&auml;chsten Lauf wechseln.</p>
<h3>Beim Seriendruck mit Microsoft Word werden die Punkte teilweise mit sehr vielen Nachkommastellen angegeben. Ist das ein Fehler?</h3>

<p>Jein, es ist ein Fehler in Microsoft Word, der mit der Darstellung von Dezimalzahlen in Computern zusammenh&auml;ngt. </p>

<p>Umgehung des Fehlers: Exportieren Sie die Ergebnisse von JAuswertung in eine CSV-Datei. Diese kann mit Microsoft Word ebenfalls als Datenquelle genutzt werden. Da hier die Punkte als Text gespeichert werden, hat Microsoft Word keine Probleme mit der Darstellung, da diese bereits von JAuswertung korrekt vorgenommen wurde.</p>

<p><b>Erkl&auml;rung:</b> Microsoft Word ignoriert beim Seriendruck s&auml;mtliche Formatierungen, die in Excel vorgenommen wurden und stellt die Zahlen so dar, wie Sie gespeichert wurden. Leider k&ouml;nnen nicht alle Dezimalzahlen exakt gespeichert werden, so dass die n&auml;chstm&ouml;gliche Zahl gespeichert wird. Z.B.:</p>

<ul><li>
<p>1320,64: 1320,6400000000001</p>
</li><li>
<p>1257,31: 1257,3099999999999</p>
</li></ul>

<p>Die Zahlen unterscheiden sich um ca 0,0000000000001 vom richtigen Wert, was normalerweise v&ouml;llig ausreichend ist. Bei der Anzeige sieht es allerdings nicht so gut aus.</p>
<h3>JAuswertung kann einige Excel-Dateien nicht &ouml;ffnen. Mit Excel ist das problemlos m&ouml;glich.</h3>

<p>JAuswertung nutzt ein freies Programm, um Excel-Datei zu lesen. Daher kann es zu Problemen mit einigen Elementen kommen. Zu diesen geh&ouml;ren</p>

<ul><li>
<p>Bilder,</p>
</li><li>
<p>Diagramme,</p>
</li><li>
<p>Formulare und</p>
</li><li>
<p>einige Formeln und Makros.</p>
</li></ul>

<p>Sollten Sie Probleme haben, speichern Sie die Datei einfach als CSV-Datei. Dieses Format bereitet weniger Probleme.</p>
<h3>Beim PDF-Export zeigt mir die Statusanzeige immer eine Seite mehr an, als anschlie&szlig;end im PDF-Dokument enthalten sind.</h3>

<p>Die Seiten werden nacheinander geschrieben. Dabei wird jeweils gepr&uuml;ft, ob auf eine Seite etwas ausgegeben werden muss. W&auml;hrend dieser &Uuml;berpr&uuml;fung wird eine Seite mehr angegeben, als anschlie&szlig;end im Dokument erscheinen.</p>

<p>Diese Anzeige bleibt so lange bestehen, bis alle Daten geschrieben wurden. Es ist also nicht die &Uuml;berpr&uuml;fung, die an dieser Stelle die meiste Zeit beansprucht.</p>
<h3>JAuswertung kann Excel-Dateien nicht &ouml;ffnen, die mit Office 95 oder &auml;lter erstellt wurden.</h3>

<p>Microsoft hat mit der Version 97 ein neues Dateiformat eingef&uuml;hrt. Speichern Sie ihre Dateien einfach vor dem Import in JAuswertung im Format, dass mit Excel 97-2003 kompatibel ist.</p>
<h3>JAuswertung kann Excel-Dateien nicht &ouml;ffnen, die mit Office 2007 erstellt wurden.</h3>

<p>Microsoft hat mit dieser Version ein neues Dateiformat eingef&uuml;hrt. Speichern Sie ihre Dateien einfach vor dem Import in JAuswertung im alten Format. Dieses k&ouml;nnen Sie an der Endung ".xls" erkennen.</p>
<h3>Anstatt der normalen Funktion hat sich ein Fenster mit dem Titel "Bug-Report" ge&ouml;ffnet. Was hat das zu bedeuten?</h3>

<p>Sie sind leider auf einen Fehler in JAuswertung gesto&szlig;en. Das Fenster erm&ouml;glicht es Ihnen die internen Fehlermeldungen zu speichern. Wenn Sie mir diese Datei per Email schicken, erleichtert mir das den Fehler zu beseitigen.</p>
<h3>&Uuml;bertr&auml;gt der "Bug-Report" automatisch private Daten ins Internet?</h3>

<p>Der "Bug-Report" &uuml;bertr&auml;gt gar keine Dateien ins Internet. Es werden ausschlie&szlig;lich Informationen gesammelt, die Sie in eine Datei speichern k&ouml;nnen.</p>
<h3>Enth&auml;lt die Datei, die im "Bug-Report" gespeichert wurde, private Daten?</h3>

<p>Der Bug-Report speichert eine Datei, in unter anderem der Informationen des Systems (Prozessor, Arbeitsspeicher etc.) und der aktuelle Wettkampf enthalten sind. Dies sind die einzigen privaten Daten, die gespeichert werden. &Uuml;ber den Knopf "Anonymisieren" k&ouml;nnen Sie verhindern, dass diese Informationen gespeichert werden. Die Datei enth&auml;lt dann ausschlie&szlig;lich Daten, die sich direkt auf den Fehler beziehen. Beachten Sie aber bitte, dass mir alle zus&auml;tzlichen Informationen helfen k&ouml;nnen, den Fehler zu beseitigen. Dar&uuml;ber hinaus werden die Daten an Dritte <b>nicht weitergeleitet</b> und nach der Beseitigung des Fehlers <b>gel&ouml;scht</b>.</p>
<hr />
<a name="xslt__begin" /><h1 class="title">HTML-Vorlagen</h1>

<p>Der Export von HTML-Dateien sowie die Ausgabe des HTTP-Servers wird durch so genannte XSL-Templates festgelegt. Sie k&ouml;nnen auf diese Weise die Ausgabe beliebig anpassen. Der interne Ablauf der Erstellung von HTML-Dateien verl&auml;uft dabei wie folgt:
<ol><li>
<p>JAuswertung erstellt aus dem aktuellen Wettkampf ein XML-Datei, die alle n&ouml;tigen Daten enth&auml;lt.</p>
</li><li>
<p>&Uuml;ber einen sogenannten Transformer wird die XML-Datei mit einer XSLT-Datei verkn&uuml;pft und so die HTML-Datei erstellt.</p>
</li></ol>
</p>

<p>Der Aufbau der XML-Dateien entspricht dabei dem der Dateien, die von JAuswertung exportiert werden k&ouml;nnen. Wenn Sie also die Ausgabe anpassen wollen, m&uuml;ssen Sie nur die entsprechenden Dateien im Unterverzeichnis "xsl" im Installationsordner von JAuswertung entsprechend anpassen.</p>

<p><b>Anmerkung 1:</b> Auf eine genaue Beschreibung zum Umgang mit XSLT wird hier verzichtet, da entsprechende Beschreibungen im Internet in ausreichender Menge und Qualit&auml;t vorhanden sind.</p>

<p><b>Anmerkung 2:</b> Ein Fehler in der XSLT-Datei f&uuml;hrt dazu, dass die Transformation nicht durchgef&uuml;hrt werden kann. JAuswertung meldet daraufhin, dass die Datei nicht gespeichert werden konnte.</p>
<hr />
<h1 class="title">Links</h1>
<h2>Internet Browser</h2>

<ul><li>
<p>Firefox: <a target="_blank" href="http://www.mozilla.org/">http://www.mozilla.org/</a></p>
</li><li>
<p>Internet Explorer: <a target="_blank" href="http://www.microsoft.com/">http://www.microsoft.com/</a></p>
</li></ul>
<h2>Java</h2>

<ul><li>
<p>Java Runtime Environment: <a target="_blank" href="http://www.java.com/">http://www.java.com/</a></p>
</li><li>
<p>Apache Ant (Build-Skript): <a target="_blank" href="http://ant.apache.org/">http://ant.apache.org/</a></p>
</li><li>
<p>Apache POI: <a target="_blank" href="http://jakarta.apache.org/poi">http://jakarta.apache.org/poi</a></p>
</li><li>
<p>Apache Commons Logging: <a target="_blank" href="http://jakarta.apache.org/commons">http://jakarta.apache.org/commons</a></p>
</li><li>
<p>JUnit: <a target="_blank" href="http://junit.sourceforge.net/">http://junit.sourceforge.net/</a></p>
</li><li>
<p>NSIS: <a target="_blank" href="http://nsis.sourceforge.net/">http://nsis.sourceforge.net/</a></p>
</li><li>
<p>IzPack: <a target="_blank" href="http://www.izforge.com/">http://www.izforge.com/</a></p>
</li><li>
<p>Everaldo Crystal Icons: <a target="_blank" href="http://www.everaldo.com/">http://www.everaldo.com/</a></p>
</li><li>
<p>JGoodies: <a target="_blank" href="http://www.jgoodies.com/">http://www.jgoodies.com/</a></p>
</li><li>
<p>RenderPack: <a target="_blank" href="https://renderpack.dev.java.net/">https://renderpack.dev.java.net/</a></p>
</li><li>
<p>L2FProd Commons: <a target="_blank" href="http://www.l2fprod.com/">http://www.l2fprod.com/</a></p>
</li></ul>
<h2>Sonstiges</h2>

<ul><li>
<p>FreePDF: <a target="_blank" href="http://shbox.de/">http://shbox.de/</a></p>
</li><li>
<p>OpenOffice: <a target="_blank" href="http://www.openoffice.org/">http://www.openoffice.org/</a></p>
</li><li>
<p>Microsoft Office: <a target="_blank" href="http://office.microsoft.com/">http://office.microsoft.com/</a></p>
</li></ul>
<hr />
<h1 class="title">Lizenzbedingungen</h1>

<p>JAuswertung ist unter der GNU Lesser General Public License (LGPL) ver&ouml;ffentlicht, dabei werden Bibliotheken benutzt, die unter folgenden Lizenzen ver&ouml;ffentlich werden:</p>

<ul><li>
<p>Apache Commons Logging: Apache Software License (ASL)</p>
</li><li>
<p>Apache Commons HTTP-Client: ASL</p>
</li><li>
<p>Apache POI: ASL</p>
</li><li>
<p>Datatips: BSD License</p>
</li><li>
<p>itext: LGPL</p>
</li><li>
<p>JGoodies Forms: BSD License</p>
</li><li>
<p>JGoodies Looks: BSD License</p>
</li><li>
<p>JDIC: LGPL</p>
</li><li>
<p>JLauncher: LGPL</p>
</li><li>
<p>JavaHelp: Binary Code License by Sun Microsystems</p>
</li><li>
<p>JUtils: LGPL</p>
</li><li>
<p>JUnit: GPL</p>
</li><li>
<p>L2FProd Commons: ASL</p>
</li><li>
<p>RenderPack: BSD License</p>
</li><li>
<p>SwingFX: BSD License</p>
</li><li>
<p>SwingWorker: LGPL</p>
</li><li>
<p>uistate: BSD License</p>
</li><li>
<p>XStream: BSD License</p>
</li><li>
<p>xpp3: ASL</p>
</li></ul>

<p>Die Texte der Lizenzen finden Sie im Verzeichnis "legal" Ihrer Installation.</p>
</body>
</html>
