<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-15" />
<meta name="author" content="Dennis Fabri" />
<meta name="date" content="20161012224319" />
<!-- created with HelpSetMaker, ID=doc24 -->
<title>Features</title>
</head>
<body class="doc">
<h1 class="title">Features</h1>
<h2>Die wichtigsten Eigenschaften in K&uuml;rze</h2>

<ul><li>
<p>Die Eingabe von Daten ist einfach, schnell und intuitiv.</p>
</li><li>
<p>Komfortable Eingabe von Schwimmern und Teams sowie zahlreiche Import- und Exportfunktionen.</p>
</li><li>
<p>Es werden das Regelwerk der DLRG, sowie Teile des internationalen Regelwerks unterst&uuml;tzt. Dar&uuml;ber hinaus k&ouml;nnen auf Wunsch auch weitere Regelwerke eingebunden werden.</p>
</li><li>
<p>Lauf- und HLW-Listen k&ouml;nnen automatisch erstellt und nach Belieben ver&auml;ndert werden.</p>
</li><li>
<p>Altersklassen k&ouml;nnen inklusive der dazugeh&ouml;rigen Disziplinen frei definiert und zur Wiederverwendung gespeichert werden. &Auml;nderungen an den Altersklassen sind auch w&auml;hrend eines Wettkampfs noch m&ouml;glich.</p>
</li><li>
<p>Kombinierte Auswertung mehrerer Wettk&auml;mpfe mit getrennten Ergebnissen.</p>
</li><li>
<p>Die Regelwerksverst&ouml;&szlig;e des  Regelwerks der DLRG sind komplett verf&uuml;gbar. Dar&uuml;ber hinaus k&ouml;nnen w&auml;hrend eines Wettkampfs neue definiert bzw. aus bestehenden abge&auml;ndert werden (z.B. bei einem Fr&uuml;hstart wird bei der Vergabe der Strafe "des dritten Schwimmers" hinzugef&uuml;gt). Zur Unterst&uuml;tzung k&ouml;nnen vergebene Strafen mit allen n&ouml;tigen Informationen (Schwimmer, Lauf, Bahn, Strafpunkte etc.) direkt ausgedruckt werden.</p>
</li><li>
<p>Umfangreiche Druckfunktionen aller ben&ouml;tigten Daten:
<ul><li>
<p>Lauflisten (in unterschiedlichen Versionen f&uuml;r Mannschaftsbetreuer und verschiedene Kampfrichterpositionen), Startkarten (auch HLW), Ergebnisse, ...</p>
</li><li>
<p>Leere Start-, Zieleinlauf- und Strafpunktekarten sowie HLW-Checklisten</p>
</li></ul>
</p>
</li></ul>
<h2>Datenimport und -export</h2>

<p>Sie k&ouml;nnen Meldungen, Kampfrichterliste, Mannschaftsmitglieder sowie die Ergebnisse der HLW direkt aus CSV- oder Excel-Dateien importieren. Dazu verwenden Sie am besten die offiziellen Vorlagen. Diese finden Sie in einem einzelnen Download auf <a target="_blank" href="http://www.dennismueller.de">http://www.dennismueller.de</a></p>

<p>Sie k&ouml;nnen die Daten wie z.B. Meldelisten, Startkarten (Seriendruckvorlage), Lauflisten, HLW-Listen oder Ergebnisse eines Wettkampfs auch exportieren. Dabei stehen Ihnen verschiedene Formate wie z.B. Excel, HTML, XML, CSV oder PDF zu Auswahl bereit. So k&ouml;nnen die Informationen direkt im Internet pr&auml;sentiert (HTML), zum Download angeboten (z.B. Excel und PDF) oder zur Aufbereitung z.B. zum Urkundendruck (XML, CSV und Excel) weitergegeben werden.</p>
</body>
</html>
