<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-15" />
<meta name="author" content="Dennis Fabri" />
<meta name="date" content="20161012224319" />
<!-- created with HelpSetMaker, ID=7316219d -->
<title>Men&uuml;s</title>
</head>
<body class="doc">
<h1 class="title">Men&uuml;s</h1>
<h2>Die Men&uuml;s</h2>
<br/><p align="center">
<img src="pics/menu.png" width="163" height="18" /><br/>
<em>Men&uuml;s</em></p><br/>

<p>JAuswertung bietet vier Men&uuml;s. Das Men&uuml; "Datei" befasst sich mit allen Informationen und Vorg&auml;ngen zum Laden und Speichern von Dateien. Das Men&uuml; "Werkzeuge" enth&auml;lt die Funktionen, die Sie bei der Verwaltung eines Wettkampfes ben&ouml;tigen. Das Men&uuml; Extras enth&auml;lt weitere Funktionen, die nicht direkt mit der Auswertung von Wettk&auml;mpfen zu tun haben. Das Men&uuml; "?" enth&auml;lt weitere Informationen &uuml;ber JAuswertung.</p>
<h3>Das Men&uuml;: Datei</h3>
<br/><p align="center">
<img src="pics/menu-datei.png" width="395" height="254" /><br/>
<em>Men&uuml;: Datei</em></p><br/>
<h4>Neu, &Ouml;ffnen, Speichern, Speichern unter...</h4>
<br/><p align="center">
<img src="pics/neuer-wettkampf.png" width="528" height="267" /><br/>
<em>Neuen Wettkampf erstellen</em></p><br/>

<p><a name="neu"></a>&Uuml;ber den Men&uuml;punkt "Neu" k&ouml;nnen Sie einen neuen Wettkampf erstellen. Es &ouml;ffnet sich ein Fenster, wie es in Abbildung "Neuen Wettkampf erstellen" dargestellt ist. W&auml;hlen Sie einfach die Art von Wettkampf, die Sie durchf&uuml;hren m&ouml;chten. Sie haben dabei die Wahl zwischen Einzel- und Mannschaftswettk&auml;mpfen. Benutzerdefinierte Wettk&auml;mpfe k&ouml;nnen ebenfalls erstellt werden, dazu k&ouml;nnen &uuml;ber die Kn&ouml;pfe "Benutzerdefiniert" mit dem Regelwerkseditor erstellte Dateien geladen werden. &Uuml;ber die Men&uuml;punkte "&Ouml;ffnen", "Speichern" und "Speichern unter ..." stehen die &uuml;blichen Funktionen zur Verf&uuml;gung.</p>
<h4>Importieren, Exportieren, Automatisch speichern</h4>

<p>Sie k&ouml;nnen verschiedene Daten importieren bzw. exportieren. Ein Assistent begleitet den Vorgang und bietet die zur Verf&uuml;gung stehenden M&ouml;glichkeiten an. Importiert werden k&ouml;nnen dabei Meldedaten, Mannschaftsmitglieder, Kampfrichter und HLW-Punkte aus Excel- und CSV-Dateien. Exportiert werden k&ouml;nnen Meldedaten, Lauflisten, HLW-Listen, Kampfrichter, Startkarten, Mannschaftsmitglieder, HLW-Punkte und Ergebnisse in mindestens eins der Formate HMTL, CSV, XML, Excel oder PDF.</p>

<p><b>Hinweis:</b> Sie k&ouml;nnen auch alle Informationen, die Sie aus JAuswertung drucken k&ouml;nnen, als PDF-Datei speichern. Nutzten Sie dazu im Druckbereich die Vorschaufunktion. W&auml;hrend die Vorschau angezeigt wird, steht dort auch ein Knopf "Speichern als PDF" zur Verf&uuml;gung.</p>
<br/><p align="center">
<img src="pics/importieren-daten.png" width="394" height="314" /><br/>
<em>Daten</em></p><br/>

<p><b>Details zum Import</b></p>

<p>Beim Import von Tabellen in JAuswertung m&uuml;ssen einige Bedingungen erf&uuml;llt sein. Verwenden Sie zum Import von Meldungen am besten die offiziellen Vorlagen, die Sie auf <a target="_blank" href="http://www.dennismueller.de">www.dennismueller.de</a> finden.</p>

<p><b>Was wird importiert?</b> Enth&auml;lt eine Tabelle mehr als ein Tabellenblatt, so werden die Daten aller Bl&auml;tter importiert. Tabellenbl&auml;tter, die nicht den Anspr&uuml;chen gen&uuml;gen werden ignoriert. </p>

<p><b>Wie kann ich Probleme beim Import vermeiden?</b> Tabellen sollten keine verbundenen Zellen und keine Formeln enthalten. Die erste Zeile einer Tabelle darf nicht leer sein.</p>

<p><b>Wie muss eine importierbare Tabelle aufgebaut sein?</b> Die erste Zeile der Tabelle wird als &Uuml;berschrift interpretiert. Dabei werden die folgenden Texte erkannt "S#" und "Startnummer" (f&uuml;r Startnummer), "Name" (bei Einzelwettk&auml;mpfen "Vorname" und "Nachname"), "Gliederung", "Altersklasse", "Geschlecht", "Meldepunkte" und "Gemeldete Punkte", "Au&szlig;er Konkurrenz". Es wird erwartet, dass jede Zeile in der Tabelle genau einem Teilnehmer entspricht. Dabei wird davon ausgegangen, dass z.B. in der Spalte mit dem Titel "Name" die Namen der Mannschaften aufgef&uuml;hrt sind. Die Tabelle darf beliebig viele Spalten enthalten; Spalten deren Titel JAuswertung unbekannt ist, werden einfach ignoriert. Beachten Sie aber, dass die Felder "Name" (bzw. "Vorname" und "Nachname"), "Gliederung", "Altersklasse" und "Geschlecht" Pflichtfelder sind. Fehlt eines dieser Felder, kann JAuswertung die Tabelle nicht importieren. </p>

<p><b>Hinweis:</b> Es werden nur Excel-Dateien ab der Versionen 97 unterst&uuml;tzt. Dateien &auml;lterer Versionen m&uuml;ssen zuerst in einem neueren Format gespeichert werden.</p>

<p><b>Hinweis:</b> Beachten Sie bitte ebenfalls, dass nach dem Regelwerk in der offenen Altersklasse eine Wahlm&ouml;glichkeit bei den Disziplinen besteht. In diesem Fall ist auch die Festlegung der Disziplinen beim Import Pflicht. Wie die Disziplinen festgelegt werden k&ouml;nnen, ist im n&auml;chsten Abschnitt beschrieben.</p>

<p><b>Welche zus&auml;tzlichen Informationen k&ouml;nnen importiert werden?</b> Dar&uuml;ber hinaus k&ouml;nnen f&uuml;r die jeweiligen Disziplinen Zeiten gemeldet werden, die bei der Lauflistenerstellung ber&uuml;cksichtigt werden k&ouml;nnen. Dazu m&uuml;ssen Sie nur f&uuml;r jede Disziplin eine Spalte anlegen, deren Titel der Name der Disziplin ist. Dort k&ouml;nnen Sie dann die Zeit im Formt "m:ss,00" (also Minuten:Sekunden,hundertstel) eintragen. Nach dem Regelwerk von 2007 darf die Offene Altersklasse ihre Disziplinen w&auml;hlen. Diese Informationen k&ouml;nnen ebenfalls importiert werden. Ist in einer Spalte einer Disziplin keine Meldezeit angegeben, so wird der Teilnehmer hier nicht gemeldet. K&ouml;nnen Sie keine Zeit angeben gen&uuml;gt ein "+" zur Meldung des Schwimmers.</p>
<br/><p align="center">
<img src="pics/exportieren-daten.png" width="396" height="431" /><br/>
<em>Daten</em></p><br/>

<p><b>Automatisch speichern</b></p>

<p>Die Option "Automatisch speichern" speichert die aktuelle Datei alle 5 Minuten. Dabei wird der aktuelle Name der Datei um "-autosave" erweitert. Hei&szlig;t ihr Wettkampf "BezMei06.wk" (".wk" ist die Endung, die von JAuswertung f&uuml;r Wettk&auml;mpfe benutzt wird), wird alle 5 Minuten eine Datei unter dem Namen "BezMei06-autosave.wk" gespeichert. Wurde eine Datei neu erstellt und noch nicht gespeichert, ist automatisches Speichern nicht m&ouml;glich!</p>
<h4>Drucken</h4>

<p>Das Drucken ist in JAuswertung &uuml;ber eine der linken Knopfleisten verf&uuml;gbar. Dies ist notwendigt, da JAuswertung wesentlich mehr Druckm&ouml;glichkeiten bietet als die meisten anderen Programme. Da aber ein Men&uuml;punkt "Drucken" an dieser Stelle erwartet wird, ist dieser hier eingef&uuml;gt, und wechselt auf die entsprechende Druckansicht.</p>
<h4>Eigenschaften</h4>

<p><a name="eigenschaften"></a>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen verschiedene Angaben zum Wettkampf wie z.B. Name, Ort und Datum eingetragen werden, die f&uuml;r ein Protokoll ben&ouml;tigt werden. Einige Angaben wie z.B. der Name des Wettkampfs werden auch im Titel der Ergebnisse aufgef&uuml;hrt. Diese Angaben werden f&uuml;r das Protokoll ben&ouml;tigt.</p>

<p>Die Eingaben der Registerkarten "Wettkampf" und "Veranstaltungsort" enthalten strukturierte Informationen zum Wettkampf. Dar&uuml;ber hinaus werden die Felder "Name", "Ort" und "Datum" auf alle Seiten gedruckt. Die Registerkarte "Informationsseite" enth&auml;lt ein Feld zur freien Texteingabe. Diese Informationen k&ouml;nnen &uuml;ber "Informationsseite" gedruckt werden. F&uuml;r das Deckblatt des Protokolls k&ouml;nnen Sie &uuml;ber die Registerkarte "Logo" ein Veranstaltungslogo ausw&auml;hlen.</p>
<br/><p align="center">
<img src="pics/eigenschaften-wettkampf.png" width="500" height="400" /><br/>
<em>Wettkampf</em></p><br/>
<br/><p align="center">
<img src="pics/eigenschaften-veranstaltungsort.png" width="500" height="536" /><br/>
<em>Veranstaltungsort</em></p><br/>
<br/><p align="center">
<img src="pics/eigenschaften-infoseite.png" width="500" height="390" /><br/>
<em>Infoseite</em></p><br/>
<br/><p align="center">
<img src="pics/eigenschaften-logo.png" width="500" height="390" /><br/>
<em>Logo</em></p><br/>
<h4>Zuletzt genutzte Dateien</h4>

<p>In der Liste der zuletzt genutzten Dateien, werden die vier letzten ge&ouml;ffneten bzw. gespeicherten Dateien angezeigt. Durch einen Mausklick werden diese direkt geladen.</p>
<h4>Beenden</h4>

<p>&Uuml;ber diesen Men&uuml;punkt wir JAuswertung beendet. Dies kann je nach Betriebssystem auch &uuml;ber das "X" in der rechten oberen Ecke des Hauptfensters geschehen. Wurden seit dem letzten Speichern Daten ge&auml;ndert, erfolgt eine Sicherheitsabfrage.</p>
<h3>Das Men&uuml;: Bearbeiten</h3>

<p>Das Men&uuml; "Bearbeiten" enth&auml;lt die Funktionen, die Sie bei der Verwaltung ihres Wettkampfs unterst&uuml;tzen. Dazu geh&ouml;rt das Erzeugen und Verwalten von Lauf- und HLW-Listen, der Einsatz von Kampfrichtern, die &Auml;nderung des Regelwerks, die Strafenliste, fehlende Eingaben und die Kampfrichterverwaltung.</p>
<br/><p align="center">
<img src="pics/menu-bearbeiten.png" width="211" height="385" /><br/>
<em>Men&uuml;: Bearbeiten</em></p><br/>
<h4>R&uuml;ckg&auml;ngig und Wiederholen</h4>

<p><a name="undo"></a>&Uuml;ber den Punkt "R&uuml;ckg&auml;ngig" k&ouml;nnen Sie jeweils die letzte &Auml;nderung zur&uuml;cknehmen. Durch mehrfaches Ausw&auml;hlen dieses Punkts k&ouml;nnen Sie auch mehrere Schritte zur&uuml;ckgehen. Sollten Sie einmal einen Schritt zu weit zur&uuml;ck gegangen sein, k&ouml;nnen Sie diesen Schritt &uuml;ber den Men&uuml;punkt "Wiederholen" wieder herstellen. Es ist auch m&ouml;glich mehrere Schritte wiederherzustellen.</p>
<h4>Meldezeiten</h4>
<br/><p align="center">
<img src="pics/meldezeiten.png" width="856" height="467" /><br/>
<em>Meldezeiten</em></p><br/>

<p>Meldezeiten werden zur gerechteren Einteilung der L&auml;ufe ben&ouml;tigt. Wenn Sie also eine Laufliste mit der Option "Nach Meldezeiten sortieren" erstellen wollen, sollten Sie zuerst hier die entsprechenden Meldezeiten eingeben. </p>

<p>Im oberen Bereich des Fensters k&ouml;nnen Sie die Altersklasse und das Geschlecht f&uuml;r die Eingabe w&auml;hlen. Im Hauptbereich werden dann alle Schwimmer dieser Auswahl mit den Meldezeiten jeder Disziplin angezeigt. Sind f&uuml;r Schwimmer einzelne Diszplinen deaktiviert, so nimmt der Schwimmer an diesen Disziplinen nicht teil.</p>
<h4>Meldepunkte sch&auml;tzen</h4>
<br/><p align="center">
<img src="pics/meldepunkte-schaetzen.png" width="158" height="331" /><br/>
<em>Meldepunkte sch&auml;tzen</em></p><br/>

<p>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Sie Meldepunkte auf der Basis gemeldeter Zeiten sch&auml;tzen lassen. Dabei wird allen Schwimmern die Punktzahl zugewiesen, die sie mit diesen Zeiten (ohne HLW und Punkteabz&uuml;ge) erhalten w&uuml;rden. </p>

<p><b>Hinweis:</b> Sind bereits Meldepunkte gesetzt, werden diese beibehalten.</p>
<h4>Zulassung</h4>

<p>Die Zulassung hat 2 Unterpunkte: Neu, Nicht qualifizierte entfernen. Mit dem ersten Punkt kann &uuml;ber einen Assistenten eine neue Zulassung durchgef&uuml;hrt werden. Schwimmer, die bereits als gesetzt markiert werden, werden dadurch nicht ver&auml;ndert. Die restlichen Schwimmer werden auf der Basis der Einstellungen als Direktqualifiziert (z.B. f&uuml;r Landesmeister), Punkte (Nachr&uuml;cker nach Punkten) und nicht qualifiziert gesetzt. </p>

<p>Wird keine Zulassung durchgef&uuml;hrt, sind alle Schwimmer auf "offen" gesetzt. Die Zulassung kann auch f&uuml;r jeden Schwimmer einzeln gesetzt werden. Daf&uuml;r steht die Funktion "Bearbeiten" z.B. unter Meldungen zur Verf&uuml;gung.</p>
<h4>Laufliste</h4>

<p><a name="laufliste"></a>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Lauflisten erstellt und verwaltet werden. Dazu stehen Ihnen die folgenden Funktionen zur Verf&uuml;gung:</p>

<p>Der Unterpunkt "Neu" erstellt automatisch eine neue Liste, in der alle Teilnehmer bzw. Teams ber&uuml;cksichtigt werden. Sie werden durch einen Assistenten durch die Erstellung der Liste begleitet und k&ouml;nnen die Einstellungen ihren W&uuml;nschen anpassen:</p>

<ul><li>
<p>Schritt 1: Allgemeine Einstellungen
<ul><li>
<p>Festlegung der Anzahl der Bahnen des Schwimmbeckens</p>
</li><li>
<p>Nummer des ersten Laufs</p>
</li></ul>
</p>
</li><li>
<p>Schritt 2: Art der Erstellung
<ul><li>
<p>Hier k&ouml;nnen Sie w&auml;hlen, ob sie den Assistenten fortsetzen und eine Laufliste automatisch erstellen wollen oder ob Sie eine leere Laufliste erstellen wollen, in der Sie die L&auml;ufe selbst einteilen.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 3: Bahnenauswahl
<ul><li>
<p>Hier k&ouml;nnen Sie f&uuml;r jede Disziplin festlegen, welche Bahnen genutzt werden sollen. In einigen Schwimmb&auml;dern kann es aus baulichen Gr&uuml;nden n&ouml;tig sein, z.B. bei der Disziplin "50m Retten" wegen ungleicher Beckentiefe auf eine Bahn zu verzichten.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 4: Reihenfolge der Altersklassen und Disziplinen
<ul><li>
<p>In diesem Schritt k&ouml;nnen Sie festlegen welche Disziplinen und welche Altersklassen in welcher Reihenfolge geschwommen werden sollen. Die Standardreihenfolge soll allen Schwimmern einen m&ouml;glichst gro&szlig;en Abstand zwischen zwei Starts erm&ouml;glichen.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 5: Sortierung der Schwimmer je Altersklasse
<ul><li>
<p>Dieser Schritt legt fest, wie die Schwimmer innerhalb einer Altersklasse auf die L&auml;ufe verteilt werden. Die Punkte "Zuf&auml;llig", "Nach Gliederungen sortieren" und "Gleiche Gliederung auf unterschiedliche L&auml;ufe verteilen" bieten sich vor allem f&uuml;r Freundschaftswettk&auml;mpfe an, w&auml;hrend "Nach gemeldeten Punkten sortieren", "Nach gemeldeten Zeiten sortieren (je Disziplin)" und "Nach Regelwerk sortieren" besonders f&uuml;r Meisterschaften geeignet sind.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 6: Meldepunkte
<ul><li>
<p>Hinweis: Dieser Schritt wird nur angezeigt, wenn in Schritt 5 "Nach gemeldeten Punkten sortieren" ausgew&auml;hlt wurde.</p>
</li><li>
<p>In diesem Schritt kann festgelegt werden, nach welchen Meldepunkten die Einteilung erfolgen soll.</p>
</li></ul>
</p>
</li><li>
<p>Schritt 7: Optionen
<ul><li>
<p>Durch "Fast leere L&auml;ufe am Ende von Altersklassen vermeiden" werden fast leere "langsamste" L&auml;ufe durch Schwimmer aus dem "zweitlangsamsten" Lauf aufgef&uuml;llt. <b>Beispiel:</b> G&auml;be es also z.B. einen Lauf mit 1 Schwimmer und der n&auml;chst bessere Lauf w&uuml;rde 5 Schwimmer enthalten, so werden zwei L&auml;ufe mit 3 Schwimmern erstellt.</p>
</li><li>
<p>&Uuml;ber "Gemischte L&auml;ufe" wird ggf. der letzte m&auml;nnliche und weibliche Lauf zusammengelegt, sofern dadurch ein Lauf gespart werden kann.</p>
</li><li>
<p>"Wenn m&ouml;glich aufeinanderfolgende L&auml;ufe zusammenfassen" &uuml;berpr&uuml;ft nach der eigentlichen Erstellung der Liste, ob L&auml;ufe, die aufeinanderfolgen, zusammengefasst werden k&ouml;nnen. Dabei wird nicht ber&uuml;cksichtigt, ob die L&auml;ufe die gleiche Disziplin oder Altersklasse enthalten.</p>
</li><li>
<p>"Bahnen rotieren" erm&ouml;glicht es eine faierere Laufliste zu erstellen, da in jedem Lauf eine andere Bahn genutzt wird.</p>
</li><li>
<p>"Normale Teilnehmer und Teilnehmer au&szlig;er Konkurrenz in unterschiedlichen L&auml;ufen" spricht eigentlich f&uuml;r sich selbst und trennt die entsprechend markierten Teilnehmer. Diese Option hat keinen Einfluss auf Option 2. Dar&uuml;ber hinaus werden die Teilnehmer nicht strikt getrennt, sondern nur entsprechend sortiert. Ist der letzte Lauf der Teilnehmer, die nicht au&szlig;er Konkurrenz starten, nicht voll besetzt, wird er durch die ersten au&szlig;er Konkurrenz Startenden aufgef&uuml;llt.</p>
</li></ul>
</p>
</li></ul>

<p><b>Hinweis 1:</b> Bei der Sortieroption "Nach Regelwerk sortieren" werden die Altersklassen nach der jeweiligen Vorgabe des eingegebenen Regelwerks durchgef&uuml;hrt. Diese k&ouml;nnen Sie im Regelwerkseditor &auml;ndern.</p>
<br/><p align="center">
<img src="pics/laufliste-neu-1.png" width="392" height="182" /><br/>
<em>Schritt 1: Allgemeine Einstellungen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-2.png" width="392" height="168" /><br/>
<em>Schritt 2: Laufliste erstellen oder nur eine leere anlegen?</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-3.png" width="398" height="548" /><br/>
<em>Schritt 3: Benutzbare Bahnen w&auml;hlen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-4.png" width="398" height="475" /><br/>
<em>Schritt 4: Reihenfolge der Disziplinen w&auml;hlen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-5.png" width="398" height="275" /><br/>
<em>Schritt 5: Sortierung festlegen</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-neu-6.png" width="398" height="251" /><br/>
<em>Schritt 6: Weitere Optionen</em></p><br/>

<p>&Uuml;ber den Unterpunkt "Bearbeiten" wird die aktuelle Liste angezeigt. Wurden seit der Erstellung der Liste weitere Teilnehmer oder Mannschaften eingetragen, erscheinen diese im rechten Teil - der sogenannten "Warteliste". Den Hauptteil des Fensters nimmt die eigentliche Liste ein, die in Tabellenform dargestellt ist. Die erste Spalte ist mit "#" beschriftet und enth&auml;lt die Laufnummer. Die Spalten "AK" und "Disziplin" enthalten den Namen der entsprechenden Altersklasse bzw. der geschwommenen Disziplin. Dabei gilt f&uuml;r die Altersklasse, dass hier der Name der Altersklasse inklusive Geschlecht angezeigt wird. Starten die Schwimmer einer Altersklasse in einem Lauf gemischt, so steht hier der Name der Altersklasse gefolgt von "gemischt". Starten in einem Lauf unterschiedliche Altersklassen steht hier nur "Gemischt". Entsprechend gilt dies f&uuml;r die Spalte "Disziplin", sobald unterschiedliche Disziplinen geschwommen werden, steht hier "Gemischt". Die restlichen Spalten stehen f&uuml;r die Nummer der Bahn und dort sind die entsprechenden Teilnehmer bzw. Mannschaften eingetragen.</p>
<br/><p align="center">
<img src="pics/laufliste-bearbeiten.png" width="898" height="426" /><br/>
<em>Laufliste</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-bearbeiten-popup.png" width="187" height="105" /><br/>
<em>Laufliste: Rechtsklick</em></p><br/>
<br/><p align="center">
<img src="pics/laufliste-bearbeiten-menu.png" width="221" height="88" /><br/>
<em>Men&uuml;</em></p><br/>

<p>Durch einen einfachen Klick auf einen Teilnehmer werden dessen Informationen am unteren Fensterrand dargestellt. Durch einen Doppelklick auf einen Schwimmer in der Liste wird er auf die Warteliste gesetzt und aus der Liste entfernt. Durch einen Doppelklick auf ein leeres Feld der Liste wird der ausgew&auml;hlte Teilnehmer der Warteliste in die Liste eingetragen und aus der Warteliste entfernt. Sie k&ouml;nnen die Listen wahlweise auch mittels Drag'n'Drop ver&auml;ndern. Ziehen Sie hierzu den Teilnehmer bzw. die Mannschaft einfach an die gew&uuml;nschte Stelle. Durch einen rechten Mausklick auf ein Feld in der Laufliste &ouml;ffnet sich ein Kontextmen&uuml;. Wenn Sie auf einen Schwimmer geklickt haben, k&ouml;nnen Sie diesen &uuml;ber den Punkt "Entfernen" aus der Laufliste entfernen. &Uuml;ber die restlichen Men&uuml;punkte k&ouml;nnen Sie einen Lauf oberhalb bzw. unterhalb des aktuellen Laufs einf&uuml;gen oder den aktuellen Lauf l&ouml;schen.</p>

<p>&Uuml;ber den Unterpunkt "Anzeigen" kann die aktuelle Lauf- bzw. HLW-Liste angezeigt werden. Der Aufbau des Fensters entspricht dem bei der Bearbeitung; es fehlt lediglich die Warteliste und eine Bearbeitung ist nicht m&ouml;glich. So k&ouml;nnen Sie sicherstellen, dass Sie nicht versehentlich die Laufliste modifizieren.</p>

<p>&Uuml;ber den Unterpunkt "Sperren" kann die Bearbeitung und die Neuerstellung unterbunden werden. Damit ist eine versehentliche &Auml;nderung der Listen nicht m&ouml;glich.</p>
<h4>HLW-Liste</h4>

<p>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Lauflisten erstellt und verwaltet werden. Dazu stehen Ihnen die folgenden Funktionen zur Verf&uuml;gung:</p>
<br/><p align="center">
<img src="pics/hlw-liste-neu-1.png" width="409" height="167" /><br/>
<em>Schritt 1: Anzahl der HLW-Puppen</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-2.png" width="409" height="172" /><br/>
<em>Schritt 2: Erstellung oder Vorbereitung</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-3.png" width="409" height="252" /><br/>
<em>Schritt 3: Reihenfolge der Altersklassen</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-4.png" width="409" height="242" /><br/>
<em>Schritt 4: Sortierung der Teilnehmer</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-5.png" width="477" height="268" /><br/>
<em>Schritt 5: Meldepunkte</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-6.png" width="409" height="184" /><br/>
<em>Schritt 6: Uhrzeit</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-7.png" width="409" height="315" /><br/>
<em>Schritt 7: Pause</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-neu-8.png" width="477" height="235" /><br/>
<em>Schritt 8: Optionen</em></p><br/>

<p>Die Erstellung einer HLW-Liste wird &uuml;ber "Neu" durchgef&uuml;hrt. Dabei geben Sie zuerst die Anzahl der HLW-Puppen an. Im zweiten Schritt k&ouml;nnen Sie ausw&auml;hlen, ob Sie die HLW-Liste von Hand erstellen m&ouml;chten (Dann ist die Erstellung nach diesem Schritt abgeschlossen), oder ob Sie die Liste von JAuswertung erstellen lassen wollen. Im dritten Schritt legen Sie die Reihenfolge der Altersklassen fest. Der vierte Schritt gibt die Reihenfolge der Teilnehmer bzw. Mannschaften innerhalb einer Alterklasse an. Im f&uuml;nften Schritt legen Sie die Anfangsuhrzeit der HLW sowie die Dauer einer HLW fest. Im letzten Schritt k&ouml;nnen Sie noch Pause bei der HLW einplanen. Diese k&ouml;nnen Sie wahlweise zu einem festen Zeitpunkt oder nach jeder Altersklasse angeben.</p>
<br/><p align="center">
<img src="pics/hlw-liste-bearbeiten.png" width="657" height="496" /><br/>
<em>HLW-Liste</em></p><br/>
<br/><p align="center">
<img src="pics/hlw-liste-bearbeiten-popup.png" width="194" height="193" /><br/>
<em>HLW-Liste: Rechtsklick</em></p><br/>

<p>Sie k&ouml;nnen bestehende HLW-Listen bearbeiten, so dass Sie auch automatisch erstellte Listen Ihren W&uuml;nschen anpassen und nachgemeldete Starter einf&uuml;gen k&ouml;nnen. Dabei sehen Sie in dem Fenster links die aktuelle HLW-Liste und rechts in der "Warteliste" die Starter, die noch zur HLW eingeteilt werden m&uuml;ssen. Die Tabelle der HLW-Liste enth&auml;lt dabei die Spalten "Zeit" f&uuml;r den Zeitpunkt an dem die HLW durchzuf&uuml;hren ist sowie die Altersklasse der Starter. Gehen gemischte Geschlechter zu einer Zeit an der Start steht hier z.B. "AK 13/14 gemischt". Starten unterschiedliche Altersklassen zum gleichen Zeitpunkte so steht in dieser Spalte "Gemischt". Die restlichen Spalten stehen f&uuml;r die Nummer der Bahn bzw. HLW-Puppe und dort sind die entsprechenden Teilnehmer bzw. Mannschaften eingetragen. Eine Besonderheit stellt hier die Mannschafts-HLW dar, da hier jede Mannschaft viermal antreten muss. Einzelne Teilnehmer bzw. Mannschaften k&ouml;nnen Sie per Drag'n'Drop verschieben und so an die gew&uuml;nschte Position bringen. Pausen und L&auml;ufe k&ouml;nnen Sie &uuml;ber einen Rechtsklick-Men&uuml; hinzuf&uuml;gen bzw. entfernen.</p>

<p>Die Funktion "Anzeigen" bietet ausschlie&szlig;lich die Anzeige der HLW-Liste ohne die Bearbeitungsfunktionen. &Uuml;ber den Punkte "Sperren" k&ouml;nnen Sie die HLW-Liste vor Bearbeitungen sch&uuml;tzen. So kann diese nicht versehentlich ge&auml;ndert werden.</p>
<h4>Laufpr&auml;sentation</h4>

<p>Die Laufpr&auml;sentation dient zur Darstellung der Informationen &uuml;ber den aktuellen sowie dem n&auml;chsten Lauf z.B. &uuml;ber einen Videobeamer. Die Anzeige wechselt zeitgesteuert zwischen der aktuellen Laufnummer und dem n&auml;chsten Lauf.</p>

<p>Folgende Tasten k&ouml;nnen zum Wechsel zum n&auml;chsten Lauf genutzt werden: Pfeil rechts, Pfeil unten, Leertaste, Enter</p>

<p>Folgende Tasten k&ouml;nnen zum Wechsel zum vorherigen Lauf genutzt werden: Pfeil links, Pfeil oben, Backspace.</p>
<h4>Regelwerkseditor</h4>

<p>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Sie die Altersklassen ihres Wettkampfs bearbeiten. Beachten Sie aber, dass Sie w&auml;hrend eines Wettkampfs keine Altersklassen erstellen bzw. l&ouml;schen k&ouml;nnen, und dass die Anzahl der Disziplinen nicht ge&auml;ndert werden kann. Dar&uuml;ber hinaus k&ouml;nnen Sie weitere Einstellungen zum Regelwerk durchf&uuml;hren. Weitere Informationen zum Regelwerkseditor finden Sie im Kapitel <a href="akse.html#akse">Regelwerkseditor</a>. </p>
<h4>Kampfrichter</h4>
<br/><p align="center">
<img src="pics/kampfrichter-neu.png" width="530" height="168" /><br/>
<em>Kampfrichtervorgabe w&auml;hlen</em></p><br/>
<br/><p align="center">
<img src="pics/kampfrichter.png" width="588" height="687" /><br/>
<em>Kampfrichterverwaltung</em></p><br/>
<br/><p align="center">
<img src="pics/kampfrichter-menu.png" width="118" height="111" /><br/>
<em>Men&uuml;</em></p><br/>

<p>Mit der Kampfrichterverwaltung k&ouml;nnen Kampfrichter auf die verschiedenen Positionen eingeteilt werden. Die Positionen entsprechen denen des aktuellen DLRG-Regelwerks. Sie k&ouml;nnen je nach Wettkampf die Anforderungen an die Kampfrichter festlegen. So gelten z.B. f&uuml;r Bezirksmeisterschaften geringere Anforderungen als f&uuml;r die Landesmeisterschaften. Die Einteilung der Kampfrichter kann einzeln gedruckt werden, ist aber auch Bestandteil des Protokolls.</p>

<p><b>Tipp:</b> Sie k&ouml;nnen die Einteilung der Kampfrichter auch speichern und in einem anderen Wettkampf laden. Damit m&uuml;ssen Sie die Kampfrichter nicht zweimal eintippen, wenn sich die Kampfrichter z.B. zwischen Einzel- und Mannschaftsmeisterschaften nicht &auml;ndern.</p>
<h4>Startunterlagen</h4>

<p><a name="startunterlagen"></a>&Uuml;ber diesen Men&uuml;punkt k&ouml;nnen Sie festlgen welche Schwimmer einer Startpasskontrolle unterzogen werden sollen. Dabei steht Ihnen ein Assistent zur Verf&uuml;gung, der Sie bei der Auslosung der Startunterlagenkontrolle unterst&uuml;tzt, so dass Sie die Auswahl nicht manuell vornehmen m&uuml;ssen. Diese Auswahl k&ouml;nnen Sie aber bei Bedarf jeder Zeit Ihren W&uuml;nschen anpassen.</p>
<br/><p align="center">
<img src="pics/startunterlagen-menu.png" width="118" height="71" /><br/>
<em>Startunterlagenkontrolle</em></p><br/>
<br/><p align="center">
<img src="pics/startunterlagen-menu.png" width="118" height="71" /><br/>
<em>Men&uuml;</em></p><br/>
<br/><p align="center">
<img src="pics/startunterlagen-assistent.png" width="396" height="231" /><br/>
<em>Assistent</em></p><br/>
<h4>Dopingkontrolle</h4>

<p><a name="dopingkontrolle"></a>Die Auslosung der Dopingkontrolle ist identisch zur <a href="jauswertungmenus.html#startunterlagen">Startpasskontrolle</a>.</p>
<h4>Elektronische Zeitnahme</h4>
<br/><p align="center">
<img src="pics/elektronische-zeitnahme.png" width="609" height="431" /><br/>
<em>Elektronische Zeitnahme</em></p><br/>

<p>Die Funktion "Elektronische Zeitnahme" wurde f&uuml;r die "Deutschen Meisterschaften im Rettungsswimmen" hinzugef&uuml;gt und erm&ouml;glicht die &Uuml;bernahme von Zeiten aus einer elektronischen Zeitmessanlage. Wenn JAuswertung mit einer Zeitmessanlage verbunden ist, kann &uuml;ber den Knopf "Aktualisieren" das aktuelle Ergebnis abgerufen werden. Im Bereich &Uuml;bersicht kann aus den L&auml;ufen von JAuswertung ausgew&auml;hlt werden. JAuswertung versucht dabei den passenden Lauf der elektronischen Zeitmessung im rechten Bereich zu ermitteln und anzuzeigen. Mit dem Knopf "Eintragen" werden die Zeiten aus der elektronischen Zeitmessung &uuml;bernommen.</p>

<p>Die Verbindung mit einer elektronischen Zeitnahme erfolgt &uuml;ber ein Netzwerk. Die ben&ouml;tigten Einstellungen stehen im Men&uuml;punkt Extras &rarr; Optionen zur Verf&uuml;gung.</p>

<p><b>Hinweis:</b> Ggf. stellt die Zeitnahme mehrere Zeiten pro Bahn zur Verf&uuml;gung. Aus diesen kann die gew&uuml;nschte Zeit ausgew&auml;hlt werden.</p>
<h4>Zielrichterentscheid</h4>

<p><a name="zielrichterentscheid"></a>Der Zielrichterentscheid ist eine Besonderheit, die mit dem DLRG-Regelwerk von 2008 aus dem DSV-Regelwerk &uuml;bernommen wurde. Diese tritt dann ein, wenn in einem Lauf bei mehreren Schwimmer der gleichen Altersklasse die manuell gestoppte Zeit dem Zieleinlauf widerspricht (Bei vollautomatischer Zeitnahme tritt ein Zielrichterentscheid also nicht ein). In diesem Fall erhalten alle Schwimmer die gleiche Zeit. Die Platzierung in dieser Disziplin wird entsprechend dem Zieleinlauf festgelegt, so dass die Schwimmer trotz gleicher Zeit unterschiedliche Pl&auml;tze einnehmen. Dies gilt jedoch nur, wenn nicht in einem anderen Lauf ein weiterer Schwimmer der gleichen Altersklasse die gleiche Zeit geschwommen hat.</p>
<br/><p align="center">
<img src="pics/zielrichterentscheid.png" width="610" height="374" /><br/>
<em>Zielrichterentscheid</em></p><br/>

<p>JAuswertung geht davon aus, dass die im Falle eine Zielrichterentscheids betroffenen Schwimmer die gleiche Zeit erhalten und entsprechend eingegeben werden. Wenn Sie also einen Zielrichterentscheid hinzuf&uuml;gen m&ouml;chten, listet Ihnen JAuswertung die in Frage kommenden L&auml;ufe mit den entsprechenden Teilnehmern auf. Aus dieser Liste k&ouml;nnen Sie anschlie&szlig;end den richtigen ausw&auml;hlen. </p>

<p><b>Anmerkung:</b> Sollte Ihr Zielrichterentscheid nicht aufgef&uuml;hrt werden, so liegt wahrscheinlich ein Eingabefehler vor.</p>

<p>In der Liste der aufgef&uuml;hrten ausgew&auml;hlten Zielrichterentscheide werden die Schwimmer zuerst anhand ihrer Bahnen sortiert aufgelistet. Sie k&ouml;nnen die Reihenfolge der Schwimmer per Drag'n'Drop &auml;ndern.</p>
<br/><p align="center">
<img src="pics/zielirchterentscheid-add.png" width="220" height="197" /><br/>
<em>Zielrichterentscheid hinzuf&uuml;gen</em></p><br/>
<br/><p align="center">
<img src="pics/Zielrichterentscheid-korrektur.png" width="458" height="289" /><br/>
<em>Zielrichterentscheide korrigieren</em></p><br/>
<h4>Strafenliste</h4>

<p>Die Strafenliste zeigt alle vergebenen Strafen des aktuellen Wettkampfs nach L&auml;ufen sortiert an. Hier haben Sie die M&ouml;glichkeit, diese noch einmal auf Richtigkeit zu &uuml;berpr&uuml;fen und ggf. zu korrigieren.</p>
<br/><p align="center">
<img src="pics/strafenliste.png" width="400" height="478" /><br/>
<em>Strafenliste</em></p><br/>

<p><b>Tipp:</b> Da mit dem Regelwerk 2007 Strafen nicht mehr durchgesagt werden m&uuml;ssen, kann es sinnvoll sein, die Strafen noch einmal einzeln auszuh&auml;ngen. Zu diesem Zweck k&ouml;nnen Sie die Strafenliste im Druckbereich ausdrucken.</p>
<h4>Daten pr&uuml;fen</h4>
<br/><p align="center">
<img src="pics/daten-pruefen.png" width="265" height="698" /><br/>
<em>Daten pr&uuml;fen: &Uuml;bersicht</em></p><br/>

<p><a name="datenpruefen"></a>&Uuml;ber diesem Men&uuml;punkt &ouml;ffnen Sie ein Fenster, dass ihnen Informationen zum aktuellen Stand der Eingabe darstellt. Sie ershalten eine &Uuml;bersicht &uuml;ber fehlerhafte bzw. korrekte Einfaben. Dabei m&uuml;ssen Sie jedoch beachten, dass diese Angaben auf Erfahrungswerten basieren und in vielen F&auml;llen auf Fehler in der Eingabe hinweisen. Es wird damit nicht garantiert, dass bestimmte Eingaben mit absoluter Sicherheit richtig oder falsch sind. Es ist aber i.d.R. gut, sich markierte Punkte genauer anzusehen.</p>
<br/><p align="center">
<img src="pics/daten-pruefen-anmeldung.png" width="359" height="223" /><br/>
<em>Daten pr&uuml;fen: Anmeldung</em></p><br/>
<br/><p align="center">
<img src="pics/daten-pruefen-zeiten.png" width="647" height="231" /><br/>
<em>Daten pr&uuml;fen: Zeiten</em></p><br/>
<br/><p align="center">
<img src="pics/daten-pruefen-hlw.png" width="647" height="201" /><br/>
<em>Daten pr&uuml;fen: HLW Punkte</em></p><br/>
<br/><p align="center">
<img src="pics/daten-pruefen-mannschaftsmitglieder.png" width="647" height="171" /><br/>
<em>Daten pr&uuml;fen: Mannschaftsmitglieder</em></p><br/>
<h4>Urkunden</h4>
<br/><p align="center">
<img src="pics/urkundeneditor.png" width="668" height="366" /><br/>
<em>Urkundeneditor</em></p><br/>

<p><a name="urkundeneditor"></a>Mit dem Urkundeneditor k&ouml;nnen Sie bestehende Urkunde bedrucken lassen, so dass Sie diese nicht von Hand ausf&uuml;llen m&uuml;ssen. Dazu k&ouml;nnen Sie einzelne Textfelder erstellen, ausrichten und deren Schriftart &auml;ndern. &Uuml;ber das normale Druckmen&uuml; k&ouml;nnen dann die Urkunden auch Altersklassenweise gedruckt werden.</p>

<p>Folgende Texte in den Textfeldern werden automatisch ersetzt:
<ul><li>
<p>&lt;Name&gt;</p>
</li><li>
<p>&lt;Gliederung&gt;</p>
</li><li>
<p>&lt;Altersklasse&gt;</p>
</li><li>
<p>&lt;Geschlecht&gt;</p>
</li><li>
<p>&lt;Punkte&gt;</p>
</li><li>
<p>&lt;Platz&gt;</p>
</li><li>
<p>&lt;Wertung&gt;</p>
</li><li>
<p>&lt;Mitglieder&gt;</p>
</li><li>
<p>&lt;Mitglieder2&gt;</p>
</li></ul>
</p>

<p>Beachten Sie bitte die &lt; und &gt; um jedes Wort. Der Satz "&lt;Name&gt; belegte in der Altersklasse &lt;Altersklasse&gt; &lt;Geschlecht&gt; den &lt;Platz&gt;. Platz" w&uuml;rde also z.B. auf der gedruckten Urkunde wie folgt aussehen "Musterstadt 1 belegte in der Altersklasse AK 12 weiblich den 3. Platz". Die Texte &lt;Mitglieder&gt; und &lt;Mitglieder2&gt; werden bei Mannschaftswettk&auml;mpfen durch die Mannschaftsmitglieder ersetzt. &lt;Mitglieder&gt; erstellt dabei eine kommagetrennte Liste, &lt;Mitglieder2&gt; schreibt jedes Mitglied in eine eigene Zeile. Durch &lt;Wertung&gt; wird bei der Disziplinenwertung der Name der Disziplin eingesetzt; bei der Mehrkampfwertung wird hier "Mehrkampf" eingetragen.</p>
<h4>Ausgabefilter bearbeiten</h4>

<p><a name="ausgabefilterbearbeiten"></a>&Uuml;ber diesen Men&uuml;punkt gelangen Sie in die Verwaltung der Ausgabefilter. Ausgabefilter erm&ouml;glichen es mehrere Wettk&auml;mpfe in Einem zu verwalten und trotzdem getrennte Ergebnisse, Protokolle und Meldelisten drucken und exportieren zu k&ouml;nnen. Auf der linken Seite des Fensters sehen Sie die zur Zeit eingerichteten Filter. Hier k&ouml;nnen Sie einzelne Filter hinzugef&uuml;gen bzw. entfernen. Beachten Sie, dass der Standardfilter weder entfernt noch ge&auml;ndert werden kann. Er enth&auml;lt immer alle Teilnehmer bzw. Mannschaften. Auf der rechten Seite sehen Sie den zur Zeit ausgew&auml;hlten Ausgabefilter. Hier k&ouml;nnen Sie den Namen des Filters &auml;ndern, wobei leere Namen nicht erlaubt sind. Unter dem Namen finden Sie eine Liste der Gliederungen, die zu diesem Filter geh&ouml;ren. Mit den beiden darunterliegenden Kn&ouml;pfen k&ouml;nnen Sie weitere Gliederungen zu diesem Filter hinzuf&uuml;gen bzw. entfernen.</p>
<br/><p align="center">
<img src="pics/ausgabefilter.png" width="400" height="291" /><br/>
<em>Ausgabefilter</em></p><br/>
<h3>Das Men&uuml;: Extras</h3>

<p>Das Men&uuml; "Extras" enth&auml;lt die Men&uuml;punkte Strafenkatalog und Optionen. </p>
<br/><p align="center">
<img src="pics/menu-extras.png" width="135" height="66" /><br/>
<em>Men&uuml;: Extras</em></p><br/>
<h4>Strafenkatalog</h4>

<p>Der Strafenkatalog enth&auml;lt eine Liste aller Strafen des Regelwerks, die in Kapitel und Paragraphen unterteilt sind. Werden w&auml;hrend eines Wettkampfs Strafen vergeben und ein eigener Text eingetragen, werden diese "neuen" Strafen im Kapitel "Sonstiges" aufgef&uuml;hrt. Dies ist sinnvoll, da im Regelwerk z.B. Strafen f&uuml;r fehlerhafte Wechsel vorgesehen sind. W&auml;hrend eines Wettkampfs ist aber auch der Vermerk "beim Wechsel vom 3. auf den 4. Schwimmer" sinnvoll. Wurde dies bei einer Strafe einmal eingetragen, kann diese beim n&auml;chsten Auftreten direkt ausgew&auml;hlt werden.</p>
<br/><p align="center">
<img src="pics/strafenkatalog.png" width="779" height="390" /><br/>
<em>Strafenkatalog</em></p><br/>

<p>Zur Unterst&uuml;tzung ist jeder Strafe ein Symbol zugeordnet:
<ul><li>
<p>Gr&uuml;ner Haken: Keine Strafe (0 Strafpunkte)</p>
</li><li>
<p>Blitz in gelbem Kreis: Strafpunkte</p>
</li><li>
<p>Roter Kreis mit wei&szlig;em X: Disqualifikation</p>
</li><li>
<p>Fu&szlig;spuren: Nicht angetreten</p>
</li><li>
<p>Haus: Ausschluss</p>
</li></ul>
</p>

<p><b>Anmerkung:</b> Die Regelwerke f&uuml;r Mannschaftswettk&auml;mpfe enthalten erweiterte Fehlercodes. Dabei wird neben der Strafe auch die Nummer des Verursachers bzw. des Wechsels angegeben. Z.B. kann f&uuml;r falsches Schleppen einer Puppe P2-3 gew&auml;hlt werden, so dass direkt ablesbar ist, dass der dritte Schwimmer die Strafe P2 verursacht hat. Diese Erweiterung ist jedoch im Regelwerk so nicht vorgesehen.</p>
<h4>Optionen</h4>
<br/><p align="center">
<img src="pics/optionen-allgemein.png" width="525" height="503" /><br/>
<em>Optionen</em></p><br/>

<p><a name="optionen"></a>&Uuml;ber den Men&uuml;punkt "Optionen" k&ouml;nnen Sie ein Fenster &ouml;ffnen, in dem sich weitere Einstellungen vornehmen lassen. Das Fenster enth&auml;lt die Registerkarten "Allgemein", "Anzeige", "HTTP-Server", "Sicherung", "CSV", "Drucken", "Druckschrift", "Elektronische Zeitnahme" und "Werbung".</p>

<p>&Uuml;ber "Allgemein" k&ouml;nnen Sie einstellen, welche Art von Wettkampf also ein Einzel- bzw. Mannschaftswettkampf nach aktuellem Regelwerk beim Start erstellt werden soll. Die zweite Option legt fest, ob die Oberfl&auml;che "geteilt" sein soll. Geteilt ist die Standardeinstellung und bedeutet, dass Sie die Ergebnisse jederzeit im unteren Bereich des Fensters sehen k&ouml;nnen. Sollten Sie jedoch eine niedrige Aufl&ouml;sung oder gr&ouml;&szlig;ere Schriftarten nutzen, kann es sein, dass der Platz auf dem Bildschirm zu eng wird. Schalten Sie dann die geteilte Oberfl&auml;che aus, und die Ergebnisse erreichen Sie ab dem n&auml;chsten Start von JAuswertung &uuml;ber ein Icon an der linken Seite. Die dritte Einstellungsm&ouml;glichkeit betrifft das Drucken von Strafpunkten, wenn Sie diese Option aktivieren, wird automatisch bei jeder vergebenen Strafe ein Strafenlaufzettel mit allen n&ouml;tigen Daten gedruckt. Dies ist vor allem bei Freundschaftswettk&auml;mpfen sinnvoll, wenn der Protokollf&uuml;hrer mehrere Funktionen im Kampfgericht erf&uuml;llt. Die letzte Option betrifft die Warnung bei der Eingabe von sehr hohen Zeiten. Da im Normalfall nur Zeiten geschwommen werden, die nicht h&ouml;her sind als 5 * Rec-Wert der aktuellen Disziplin, handelt es sich hier meistens um Tippfehler. Diese k&ouml;nnen so vermieden werden.</p>
<br/><p align="center">
<img src="pics/optionen-anzeige.png" width="525" height="453" /><br/>
<em>Anzeige</em></p><br/>

<p>Im Bereich "Anzeige" kann die geteilte Ansicht gew&auml;hlt werden. Dabei wird das Fenster in einen oberen und einen unteren Bereich unterteilt. Der obere enth&auml;lt die Eingabefunktionen und der untere die Punkte Ergebniss und Drucken. Dies ist jedoch nur bei hohen Aufl&ouml;sungen sinnvoll. Daher wird bei niedrigen Aufl&ouml;sungen die geteilte Oberfl&auml;che nicht automatisch gew&auml;hlt. F&uuml;r diese Einstellung muss JAuswertung neu gestartet werden. Der zweite Punkt beeinflusst die Ausrichtunge von Texten in Lauf- und HLW-Listen. Mit dem dritten Punkt kann JAuswertung mitgeteilt werden, dass nach M&ouml;glichkeit redundante Informationen vermieden werden, um Platz auf den Ausdrucken zu sparen.</p>
<br/><p align="center">
<img src="pics/optionen-sicherung.png" width="525" height="503" /><br/>
<em>Sicherung</em></p><br/>

<p>&Uuml;ber den Bereich "Sicherung" k&ouml;nnen Sie eine automatische Sicherung anlegen lassen. Diese unterscheidet sich von der Funktion "Datei" &rarr; "Automatisch speichern" dadurch, dass den Dateinamen die aktuelle Uhrzeit hinzugef&uuml;gt wird. Dadurch existieren Backups mit denen die einzelnen &Auml;nderungen im Wettkampf nachvollzogen werden k&ouml;nnen.</p>
<br/><p align="center">
<img src="pics/optionen-csv.png" width="406" height="346" /><br/>
<em>CSV</em></p><br/>

<p>&Uuml;ber die Registerkarte "CSV" k&ouml;nnen Einstellungen zum CSV-Export und -Import vorgenommen werden. Diese beziehen sich auf die Trennzeichen, die beim CSV-Export/-Import ber&uuml;cksichtigt werden. In normalen CSV-Dateien werden "," als Trennzeichen benutzt. Microsoft Excel nutzt aber die aktuellen Spracheinstellungen zum Export und Import. Dadurch werden Zahlen mit "," getrennt z.B. "123,4" und das Trennzeichen ";" genutzt. Je nachdem mit welchen Programmen Sie arbeiten, m&uuml;ssen Sie diese Option entsprechend w&auml;hlen.</p>

<p><b>Anmerkung:</b> Auf Windows-Systemen wird automatisch die zu Excel kompatible Version gew&auml;hlt. Auf allen anderen Systemen die korrekte CSV-Darstellung.</p>
<br/><p align="center">
<img src="pics/optionen-elektronische-zeitnahme.png" width="525" height="453" /><br/>
<em>Elektronische Zeitnahme</em></p><br/>

<p>Die Verbindung von JAuswertung mit einer elektronischen Zeitmessanlage erfolgt &uuml;ber ein einfaches Netzwerkprotokoll. F&uuml;r die Zeitmessanlage "Ares 21" von "OMEGA Watches" steht eine Implementierung Namens "AlphaServer" zur Verf&uuml;gung. Als Server m&uuml;ssen Sie die Adresse des Rechners angeben, auf dem die Software l&auml;uft. </p>

<p><b>Hinweis:</b> Die Software "AlphaServer" ist ebenfalls OpenSource und damit kostenlos. Die grafische Benutzeroberfl&auml;che ist jedoch noch nicht offiziell freigegeben. Genauere Informationen zu dieser Software k&ouml;nnen unter <a target="_blank" href="info@dennismueller.de">info@dennismueller.de</a> nachgefragt werden.</p>
<br/><p align="center">
<img src="pics/optionen-werbung.png" width="525" height="453" /><br/>
<em>Werbung</em></p><br/>

<p>JAuswertung unterst&uuml;tzt das Einblenden von Werbebannern unter- bzw. oberhalb verschiedener Ausdrucke. Diese Einstellung wirkt sich nur auf Ausdrucke aus, die im Allgemeinen vor einem Wettkampf verschickt bzw. w&auml;hrend eines Wettkampfs ausgeh&auml;ngt werden. Ergebnisse k&ouml;nnen so z.B. den Logos von Sponsoren versehen werden.</p>
<br/><p align="center">
<img src="pics/optionen-http-server.png" width="525" height="453" /><br/>
<em>HTTP-Server</em></p><br/>

<p>&Uuml;ber die Registerkarte "HTTP-Server" k&ouml;nnen Sie den integrierten HTTP-Server von JAuswertung einstellen.  Zur Zeit k&ouml;nnen Sie den Port f&uuml;r den HTTP-Server &auml;ndern. Normalerweise sollten Sie den Standardport nutzen. Unter Linux kann es notwendig sein, den Port auf einen Wert &uuml;ber 1024 zu &auml;ndern, da die unteren Ports f&uuml;r Benutzer gesperrt sind. Beachten Sie aber, dass sich damit der Aufruf in ihrem Browser &auml;ndert. Der HTTP-Server kann normalerweise von ihrem Rechner aus &uuml;ber die URL "http:<i>localhost/index.html" angesprochen werden. Wenn Sie den Port auf z.B. 8080 &auml;ndern, sieht die URL wie folgt aus: "http:</i>localhost:8080/index.html". Den Port f&uuml;r den HTTP-Server k&ouml;nnen Sie nur &auml;ndern, wenn der HTTP-Server nicht gestartet ist.</p>

<p><b>Hinweis:</b> Der eigentliche Start des HTTP-Servers erfolgt &uuml;ber die Weltkugel in der oberen Knopfleiste. Mit dem HTTP-Server k&ouml;nnen Sie, wenn Sie mehrere Rechner vernetzen, direkt auf die Daten von JAuswertung zugreifen, ohne den Auswerter st&ouml;ren zu m&uuml;ssen. Beachten Sie aber, dass jede Anfrage Rechenzeit ben&ouml;tigt und den Rechner des Auswerters damit zus&auml;tzlich belastet. Dies gilt vor allem f&uuml;r den Download von PDF-Dateien. Sie sollten den HTTP-Server nur intern nutzen, da er nicht darauf ausgelegt ist, gro&szlig;e Mengen an Daten/Anfragen zu bew&auml;ltigen. </p>
<br/><p align="center">
<img src="pics/optionen-druckschrift.png" width="525" height="503" /><br/>
<em>Druckschrift</em></p><br/>

<p>&Uuml;ber die Registerkarte "Druckschrift" k&ouml;nnen Sie die Schriftart f&uuml;r Ausdrucke ausw&auml;hlen. Standardm&auml;&szlig;ig wird die Schriftart "DLRG Univers 55 Roman" gew&auml;hlt, sofern Sie vorhanden ist.</p>
<br/><p align="center">
<img src="pics/optionen-drucken.png" width="525" height="453" /><br/>
<em>Drucken</em></p><br/>

<p>&Uuml;ber die Registerkarte "Drucken" k&ouml;nnen Sie die Orientierung der Ergebnisse im Protokoll einstellen. Standardm&auml;&szlig;ig werden die Ergebnisse um 90 Grad gedreht gedruckt. Wird also das Protokoll im Hochformat gedruckt, erscheinen die Ergebnisse im Querformat. Bei dieser Einstellung werden die Ergebnisse in den meisten F&auml;llen am besten gedruckt. Wenn Sie die Ergebnisse im Hochformat erhalten wollen, so m&uuml;ssen Sie die Option "Ergebnisse waagrecht drucken" aktivieren. </p>

<p>Sie k&ouml;nnen festlegen, ob beim Druck von Lauflisten leeren Bahnen mitgedruckt werden ("Leere Bahnen drucken"). Zus&auml;tzlich k&ouml;nnen Sie festlegen, ob beim Druck von Startkarten auch f&uuml;r in einem Lauf nicht genutzte Bahnen Startkarten gedruckt werden sollen. </p>

<p>Bei der Disziplinenwertung ist es Geschacksache, ob die Punkte mitgedruckt werden sollen oder nicht ("Punkte bei der Disziplinenwertung drucken"). Zur einfacheren Unterscheidung von Ergebnissen unterst&uuml;tzt JAuswertung Checksummen, mit denen festgestellt werden kann, ob zwei Ergebnisse unterschiedlich sind. Diese Checksummen k&ouml;nnen auf jedes Ergebnis gedruckt werden ("Checksummen in Ergebnissen drucken"). Sind die Checksummen unterschiedlich, so sind auch die Ergebnisse unterschiedlich. Wenn die Checksummen gleich sind, ist die Wahrscheinlichkeit sehr hoch, dass die Ergebnisse gleich sind. In seltenen F&auml;llen kann es jedoch vorkommen, dass zwei Ergebnisse mit gleichen Checksummen unterschiedlich sind. Mit der Option "Nicht angetreten in der Strafenliste drucken" kann festgelegt werden, ob in Ausdrucken der Strafenliste auch "nicht angetretene" Schwimmer ber&uuml;cksichtigt werden. "Platzierungen in Ergebnissen drucken" erm&ouml;glicht es zu w&auml;hlen, ob die Platzierungen in den einzelnen Disziplinen bei der Mehrkampfwertung mitgedruckt werden. </p>

<p>Mit der Option "Namen der Mannschaftsmitglieder in der HLW-Liste drucken" besteht die M&ouml;glichkeit zu w&auml;hlen, ob die Namen der ersten vier Mannschaftsmitglieder in die HLW-Liste gedruckt werden sollen.</p>

<p>Die St&auml;rke von Graut&ouml;nen ist stark vom eingesetzten Drucker und den Einstellungen im Treiber abh&auml;ngig. Daher kann die Intensit&auml;t des Grautons f&uuml;r die Zeilenmarkierung in Tabellen manuell festgelegt werden. Dies geschiet &uuml;ber den Regler unter "Helligkeit der hervorgehobenen Zeilen".</p>
<h3>Das Men&uuml;: ?</h3>
<br/><p align="center">
<img src="pics/menu-info.png" width="89" height="86" /><br/>
<em>Men&uuml;: ?</em></p><br/>

<p>Dieses Men&uuml; bietet Informationen zu JAuswertung. Der Punkt "Hilfe" f&uuml;hrt zu dieser Anleitung, der Punkt "Tipps" zeigt ausgew&auml;hlte Hilfen an und der Punkt "Info", stellt einige Informationen zu JAuswertung dar.</p>
<br/><p align="center">
<img src="pics/tipps.png" width="448" height="262" /><br/>
<em>Tipps des Tages</em></p><br/>
<br/><p align="center">
<img src="pics/about.png" width="483" height="369" /><br/>
<em>&Uuml;ber JAuswertung</em></p><br/>
</body>
</html>
