<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-15" />
<meta name="author" content="Dennis Fabri" />
<meta name="date" content="20161012224319" />
<!-- created with HelpSetMaker, ID=8bdb9f44 -->
<title>Obere Knopfleiste</title>
</head>
<body class="doc">
<h1 class="title">Obere Knopfleiste</h1>
<h2>Die obere Knopfleiste</h2>
<br/><p align="center">
<img src="pics/knopfleiste.png" width="810" height="29" /><br/>
<em>Obere Knopfleiste</em></p><br/>

<p>Diese Knopfleiste stellt Funktionen zur Verf&uuml;gung, die weitestgehend &uuml;ber Men&uuml;s zu erreichen sind. Die Funktionen entsprechen von Links nach Rechts den folgenden Men&uuml;punkten:
<ul><li>
<p><a href="jauswertungmenus.html#neu">Datei &rarr; Neu</a></p>
</li><li>
<p><a href="jauswertungmenus.html#neu">Datei &rarr; &Ouml;ffnen</a></p>
</li><li>
<p><a href="jauswertungmenus.html#neu">Datei &rarr; Speichern</a></p>
</li><li>
<p><a href="jauswertungmenus.html#undo">Bearbeiten &rarr; R&uuml;ckg&auml;ngig</a></p>
</li><li>
<p><a href="jauswertungmenus.html#undo">Bearbeiten &rarr; Wiederholen</a></p>
</li><li>
<p><a href="jauswertungmenus.html#laufliste">Werkzeuge &rarr; Laufliste &rarr; Bearbeiten/Anzeigen</a></p>
</li><li>
<p><a href="jauswertungmenus.html#laufliste">Werkzeuge &rarr; HLW &rarr; Bearbeiten/Anzeigen</a></p>
</li><li>
<p><a href="jauswertungmenus.html#datenpruefen">Werkzeuge &rarr; Daten pr&uuml;fen</a></p>
</li><li>
<p>HTTP-Server starten</p>
</li><li>
<p>Cache des HTTP-Servers l&ouml;schen</p>
</li><li>
<p>Ausgabefilter einstellen</p>
</li><li>
<p>Informationen &uuml;ber den aktuellen Stand der Eingabe</p>
</li></ul>
</p>

<p>Die Kn&ouml;pfe zur Bearbeitung der Laufliste und der HLW-Liste nehmen dabei eine Sonderstellung ein. Ist die Sperrung zur Bearbeitung einer Liste aktiviert, so wird der Knopf nicht deaktiviert sondern auf die Funktion "Anzeigen" umgeschaltet.</p>

<p>Mit dem Icon "Weltkugel" k&ouml;nnen Sie den HTTP-Server aktivieren bzw. wieder deaktivieren. Mit dem HTTP-Server k&ouml;nnen Sie, wenn Sie mehrere Rechner vernetzen, direkt auf die Daten von JAuswertung zugreifen, ohne den Auswerter st&ouml;ren zu m&uuml;ssen. Beachten Sie aber, dass jede Anfrage Rechenzeit ben&ouml;tigt und den Rechner des Auswerters damit zus&auml;tzlich belastet. Dies gilt vor allem f&uuml;r den Download von PDF-Dateien. Sie sollten den HTTP-Server nur intern nutzen, da er nicht darauf ausgelegt ist, gro&szlig;e Mengen an Daten/Anfragen zu bew&auml;ltigen. Beachten Sie bitte, dass der Aufruf der Seiten von der Einstellung des Ports abh&auml;ngt (siehe <a href="jauswertungmenus.html#optionen">Extras &rarr; Optionen</a>).</p>

<p><a name="ausgabefilter"></a>Rechts neben diesen Kn&ouml;pfen ist die Auswahl von "Ausgabefiltern" m&ouml;glich. Diese beeinflussen nicht die Eingabe und Auswertung eines Wettkampfs, k&ouml;nnen aber die Ausgabe einschr&auml;nken. So ist es m&ouml;glich die Meisterschaften z.B. mehrerer Bezirke in einem Wettkampf durchzuf&uuml;hren und getrennte Ergebnisse zu erstellen. Die Ausgabefilter beziehen sich nur auf die Ausgabe von Ergebnissen, Protokollen und Meldelisten beim Drucken und beim Export. Ist das Auswahlfeld deaktiviert, sind keine Ausgabefilter definiert. Sie k&ouml;nnen &uuml;ber den Men&uuml;punkt <a href="jauswertungmenus.html#ausgabefilterbearbeiten">Extras &rarr; Ausgabefilter bearbeiten</a> Ausgabefilter einrichten und &auml;ndern. Funktione f&uuml;r Ausgaben z.B. Ausdrucke signalisieren, dass Sie von einem Ausgabefilter beeinflusst werden durch ein Icon "Auge".</p>
</body>
</html>
