<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-15" />
<meta name="author" content="Dennis Fabri" />
<meta name="date" content="20161012224319" />
<!-- created with HelpSetMaker, ID=30c8ebe1 -->
<title>Linke Knopfleisten</title>
</head>
<body class="doc">
<h1 class="title">Linke Knopfleisten</h1>

<p><a name="linkeknopfleiste"></a>&Uuml;ber die linke Knopfleisten k&ouml;nnen Sie durch die einzelnen Hauptfunktionen von JAuswertung bl&auml;ttern. Je nach ausgew&auml;hlten Knopf wird die entsprechende Funktion aktiviert. Beachten Sie, dass einige Funktionen nicht immer aktiviert sind. Wenn die gesamte Funktionalit&auml;t hinter einem Knopf deaktiviert ist, erscheint eine kurze Information dar&uuml;ber, wann diese Funktionalit&auml;t genutzt werden kann.</p>
<br/><p align="center">
<img src="pics/panel-anmeldung.png" width="400" height="513" /><br/>
<em>JAuswertung - Schwimmereingabe</em></p><br/>
<h3>Eingabe</h3>

<p>Durch einen Klick auf "Eingabe" wird die Eingabe von Teilnehmern oder Mannschaften aktiviert. Je nach aktuellem Wettkampf unterscheidet sich das Aussehen des Fensters, da bei einem Mannschaftswettkampf kein Vor- und Nachname existiert. Gelbe Felder m&uuml;ssen ausgef&uuml;llt werden, wei&szlig;e Felder k&ouml;nnen freigelassen werden. Wird keine Startnummer eingetragen, so wird automatisch die n&auml;chste freie Startnummer f&uuml;r den Schwimmer gew&auml;hlt.</p>

<p>Bei Mannschaftswettk&auml;mpfen k&ouml;nnen Sie auch mehrere Mannschaften einer Gliederung auf einmal hinzuf&uuml;gen. Geben Sie dazu wie gewohnt die Daten in den oberen Feldern ein. Zus&auml;tzlich schreiben Sie dann in das Feld Anzahl die gew&uuml;nschte Menge an Mannschaften und klicken auf den Hinzuf&uuml;gen-Knopf darunter. Die eingef&uuml;gten Mannschaften werden automatisch durchnummeriert. Wenn Sie also als Name "Musterort" gew&auml;hlt haben, werden die Mannschaften "Musterort 1", "Musterort 2", ... genannt. Beachten Sie dabei aber, dass die Mannschaften bis auf den Namen identisch sind. Sie sind also alle in der gleichen Altersklasse und nehmen mit den gleichen Meldezeiten an den gleichen Disziplinen teil.</p>

<p><b>Hinweis</b>: Wenn Sie neue Teilnehmer oder Mannschaften zu einem Wettkampf hinzuf&uuml;gen, nachdem Sie eine Laufliste erstellt haben, werden diese nicht automatisch in die Laufliste einsortiert. Sie k&ouml;nnen diese aber &uuml;ber den Lauflisteneditor manuell einsortieren, oder eine neue Laufliste erstellen.</p>
<h3>Meldungen</h3>

<p>Hier wird die aktuelle Meldeliste dargestellt. &Uuml;ber die Felder im linken Teil kann die Auswahl der dargestellten Teilnehmer bzw. Mannschaften eingeschr&auml;nkt werden. Dabei sind die Textfelder Filter, dass hei&szlig;t gibt man z.B. nur den Buchstaben g ein, werden alle Teilnehmer bzw. Mannschaften angezeigt, die den Buchstaben g im Namen tragen. Sind alle Felder leer, werden alle Teilnehmer bzw. Mannschaften dargestellt. Durch einen Rechtsklick auf einen Teilnehmer bzw. eine Mannschaft wird ein Kontextmen&uuml; ge&ouml;ffnet, dass das Bearbeiten und L&ouml;schen erlaubt, es k&ouml;nnen hier aber auch Strafen vergeben werden.</p>
<br/><p align="center">
<img src="pics/panel-meldungen.png" width="734" height="333" /><br/>
<em>Meldungen</em></p><br/>
<br/><p align="center">
<img src="pics/panel-meldungen-popup.png" width="213" height="155" /><br/>
<em>Meldungen: Rechtsklick</em></p><br/>
<br/><p align="center">
<img src="pics/panel-meldungen-laufanzeigen.png" width="202" height="231" /><br/>
<em>Meldungen: Laufanzeige</em></p><br/>
<br/><p align="center">
<img src="pics/schwimmer-bearbeiten.png" width="347" height="740" /><br/>
<em>Meldungen: Teilnehmer/Mannschaft bearbeiten</em></p><br/>
<br/><p align="center">
<img src="pics/panel-meldungen.png" width="734" height="333" /><br/>
<em>Meldungen</em></p><br/>

<p>Die Fenster zur Bearbeitung von Teilnehmern und Mannschaften unterscheiden sich nur geringf&uuml;gig und sind im Wesentlichen selbserkl&auml;rend.</p>

<p>Die Men&uuml;punkte "Disqualifizieren", "Ausschluss" und "Nicht Angetreten" f&uuml;gen dem ausgew&auml;hlten Schwimmer bzw. der ausgew&auml;hlten Mannschaft f&uuml;r alle Disziplinen diese Strafe hinzu. &Uuml;ber den Men&uuml;punkt "Strafe vergeben" k&ouml;nnen Sie &uuml;ber einen Assistenten eine genauere Strafe vergeben. </p>
<h4>Zeiteneingabe</h4>

<p>Hier k&ouml;nnen Sie Zeiten einzelner Schwimmer eingeben. Dazu k&ouml;nnen Sie im Bereich "Auswahl" angeben, welche Disziplin eingetragen werden soll und wie viele Schwimmer gleichzeitig angezeigt werden k&ouml;nnen. &Uuml;ber den Knopf "weiter" werden alle Felder wieder freigegeben. Diese Knopf ver&auml;ndert keine Daten, er schaft lediglich Platz f&uuml;r neue Eingaben. Im Bereich "Status" werden ggf. Eingabefehler angezeigt, dies soll nur zu ihrer Orientierung dienen. </p>
<br/><p align="center">
<img src="pics/panel-zeiteneingabe.png" width="683" height="379" /><br/>
<em>Zeiteneingabe mit fehlerhaften Angaben</em></p><br/>

<p>Im Bereich "Zeiteneingabe" findet die eigentlich Eingabe statt. Sie k&ouml;nnen in einem der Felder unter "Startnummer" die Startnummer eines Schwimmers eingeben. Genauere Angaben zu dem Schwimmer erscheinen dann direkt neben diesem Feld und das Feld unter "Zeiteneingabe" wird aktiviert und Sie k&ouml;nnen direkt eine Zeit eintragen. Beachten Sie, dass die Eingabe der Zeit direkt durchgef&uuml;hrt wird. Wenn Sie also eine Zeit von 1:23,4 eingeben, wird der entsprechende Schwimmer kurzzeitig eine Zeit von 0:00,1 dann von 0:01,2 dann von 0:12,3 und anschlie&szlig;end die richtige Zeit haben.</p>

<p>Es stehen zur einfacheren Eingabe folgende Tastaturk&uuml;rzel in den Feldern zur Zeiteneingabe zur Verf&uuml;gung:
<ul><li>
<p>"c" &ouml;ffnet den Dialog, um eine Strafe nach Fehlercode zu vergeben. Diese Strafe wird zu bestehenden Strafen hinzugef&uuml;gt.</p>
</li><li>
<p>"d" f&uuml;gt dem Teilnehmer/der Mannschaft eine "Disqualifikation" hinzu</p>
</li><li>
<p>"n" setzt den Teilnehmer/die Mannschaft auf "Nicht angetreten" (allerdings nur wenn keine Zeit eingegeben wurde)</p>
</li><li>
<p>"p" &ouml;ffnet ein Fenster zur Eingabe von Strafpunkten. Diese werden zu bestehenden Strafpunkten addiert.</p>
</li><li>
<p>"#" entfernt eingegebene Strafen</p>
</li></ul>
</p>
<br/><p align="center">
<img src="pics/panel-laufzeiten.png" width="729" height="425" /><br/>
<em>Laufzeiten</em></p><br/>
<br/><p align="center">
<img src="pics/strafencode.png" width="236" height="300" /><br/>
<em>Strafenvergabe mittels Code</em></p><br/>
<br/><p align="center">
<img src="pics/strafeneditor.png" width="446" height="332" /><br/>
<em>Strafeneditor</em></p><br/>
<br/><p align="center">
<img src="pics/strafeneditor-disziplin-nicht-gewaehlt.png" width="446" height="338" /><br/>
<em>Strafeneditor mit nicht gew&auml;hlter Disziplin (z.B. in derAK Offen)</em></p><br/>
<br/><p align="center">
<img src="pics/strafenwizard-code.png" width="394" height="168" /><br/>
<em>Strafenassistent: Code</em></p><br/>
<br/><p align="center">
<img src="pics/strafenwizard-details.png" width="394" height="346" /><br/>
<em>Strafenassistent: Details</em></p><br/>
<br/><p align="center">
<img src="pics/strafpunkte.png" width="236" height="300" /><br/>
<em>Strafpunkte vergeben</em></p><br/>
<h4>Laufzeiten</h4>

<p>Die Funktionen der "Laufzeiten" stehen nur zur Verf&uuml;gung wenn auch die Laufliste mit JAuswerung verwaltet wird, erm&ouml;glicht aber die h&ouml;chstm&ouml;gliche Eingabegeschwindigkeit. &Uuml;ber den Punkt "Lauf" im Bereich "&Uuml;bersicht" k&ouml;nnen Sie direkt den Lauf ausw&auml;hlen, den Sie eingeben m&ouml;chten. Im Rest des Bereichs "&Uuml;bersicht" werden n&auml;here Informationen zu dem entsprechenden Lauf dargestellt. Im Bereich "Lauf" werden die einzelnen Teilnehmer in der Reihenfolge ihrer Bahnen aufgelistet und Sie k&ouml;nnen direkt die Zeiten in dieser Reihenfolge eingeben. Die Eingabe der Zeit wird direkt durchgef&uuml;hrt und das Ergebnis aktualisiert.</p>

<p>Es stehen zur einfacheren Eingabe folgende Tastaturk&uuml;rzel in den Feldern zur Zeiteneingabe zur Verf&uuml;gung:
<ul><li>
<p>"c" &ouml;ffnet den Dialog, um eine Strafe nach Fehlercode zu vergeben. Diese Strafe wird zu bestehenden Strafen hinzugef&uuml;gt.</p>
</li><li>
<p>"d" f&uuml;gt dem Teilnehmer/der Mannschaft eine "Disqualifikation" hinzu</p>
</li><li>
<p>"n" setzt den Teilnehmer/die Mannschaft auf "Nicht angetreten" (allerdings nur wenn keine Zeit eingegeben wurde)</p>
</li><li>
<p>"p" &ouml;ffnet ein Fenster zur Eingabe von Strafpunkten. Diese werden zu bestehenden Strafpunkten addiert.</p>
</li><li>
<p>"#" entfernt eingegebene Strafen</p>
</li><li>
<p>"z" oder "," zeigen den Zieleinlauf des aktuellen Laufs an</p>
</li></ul>
</p>

<p>Der Knopf "Zielrichterentscheid" erm&ouml;glicht den Zugriff auf eine Funktion, die durch das DLRG-Regelwerk von 2008 eingef&uuml;hrt wurde. Die Beschreibung dazu finden Sie unter <a href="jauswertungmenus.html#zielrichterentscheid">jauswertungmenus#zielrichterentscheid</a></p>

<p><b>Hinweis 1:</b> Mit den Cursor-Tasten k&ouml;nnen Sie zwischen den Bahnen und L&auml;ufen wechseln.</p>

<p><b>Hinweis 2:</b> Mit der Taste &lt;Enter&gt; k&ouml;nnen Sie die Eingabe einer Zeit beenden und zur n&auml;chsten Bahn wechseln. Wenn Sie die letzte Zeit eingegeben haben, wird automatisch der Zieleinlauf angezeigt.</p>
<h4>HLW Eingabe</h4>

<p>Die Eingabe der HLW-Punkte funktioniert nach dem gleichen System wie die Eingabe der Zeiten mit der "Zeiteneingabe". Als Besonderheit ist jedoch anzumerken, dass obwohl ein Teilnehmer bzw. eine Mannschaft gefunden wurde, dass Feld "HLW-Punkte" deaktiviert bleiben kann. Ist dies der Fall ist der Schwimmer in einer Altersklasse, in der keine HLW durchgef&uuml;hrt wird. Dieses Problem wird ebenfalls im Bereich "Status" angezeigt.</p>

<p>Bei der Eingabe von Mannschaften k&ouml;nnen die Punkte f&uuml;r jeden Schwimmer einzeln eingegeben werden. Dazu muss an die Startnummer ein Buchstabe "a", "b", "c" oder "d" angeh&auml;ngt werden. Der entsprechende Buchstabe wird automatisch auf die HLW-Startkarten gedruckt. Die ersten vier Schwimmer eine Mannschaft sind f&uuml;r die HLW vorgesehen. Der f&uuml;nfte Schwimmer nimmt nicht an der HLW teil.</p>
<br/><p align="center">
<img src="pics/panel-hlw-eingabe.png" width="576" height="442" /><br/>
<em>Eingabe von HLW-Punkten</em></p><br/>

<p><b>Hinweis:</b> Bei der HLW-Eingabe erm&ouml;glichen es die Texte "n" und "n.a." einen Schwimmer als "Nicht angetreten" zu markieren. Mit "d" kann ein Schwimmer als disqualifiziert markiert werden.</p>
<h4>HLW Barcodes</h4>

<p>JAuswertung druckt auf ausge&uuml;llte HLW-Checklisten und -Startkarten zwei Barcodes. Ein Barcode steht f&uuml;r "Bestanden" und der andere f&uuml;r "Nicht bestanden". Die Barcodes k&ouml;nnen mit handels&uuml;blichen Barcode-Scanners erkannt werden. Wird ein Barcode f&uuml;r einen Teilnehmer eingescannt, der bestanden hat, leuchtet "200 Punkte" in gr&uuml;n auf. Hat der Teilnehmer nicht bestanden, leuchtet "0 Punkte" in rot auf. Ist der Barcode nicht korrekt, leuchtet "Barcode nicht korrekt" in orange auf. Zus&auml;tzlich werden in den ersten beiden F&auml;llen weitere Informationen zu dem erkannten Teilnehmer angezeigt.</p>

<p><b>Hinweis:</b> Nicht alle Barcode-Scanner simulieren eine Tastatur.</p>

<p><b>Hinweis:</b> Geeignete Barcode-Scanner (1D-Code-Scanner) simulieren eine Tastatur. Achten Sie deshalb darauf, dass der Fokus auf das Eingabefeld gesetzt ist, wenn Sie einen Barcode scannen.</p>

<p><b>Hinweis:</b> Sie k&ouml;nnen diese Funktion auch ohne Barcode-Scanner nutzen. Tippen Sie dazu einfach die Ziffern unter dem Barcode in das Feld "Eingabe" und best&auml;tigen Sie mit &lt;Enter&gt;. Die Barcodes enthalten eine Checksumme und sind daher gegen Vertipper besser als die normale HLW-Eingabe abgesichert.</p>
<br/><p align="center">
<img src="pics/panel-hlw-barcodes.png" width="576" height="425" /><br/>
<em>HLW-Barcodes</em></p><br/>
<h4>Mannschaftsmitglieder</h4>

<p>In diesem Bereich k&ouml;nnen mit JTeams ausgedruckte Mannschaftsmeldeb&ouml;gen zur Meldung von Mannschaftsmitgliedern eingescannt werden. Der dort abgebildete QR-Code enth&auml;lt alle Informationen, um die eingegebenen Mannschaftsmitlieder der richtien Mannschafts zuzuordnen.</p>

<p><b>Hinweis:</b> Nicht alle 2D-Code-Scanner simulieren eine Tastatur.</p>

<p><b>Hinweis:</b> Geeignete 2D-Code-Scanner simulieren eine Tastatur. Achten Sie deshalb darauf, dass der Fokus auf das Eingabefeld gesetzt ist, wenn Sie einen QR-Code scannen.</p>

<p><b>Hinweis:</b> Es gibt neben 2D-Code-Scannern auch die M&ouml;glichkeit mittels App und Smartphone den Code einzuscannen und per Netzwerk zu &uuml;bertragen. Daf&uuml;r muss auf dem genutzen Rechner eine passende Zusatzsoftware des jeweiligen Anbieters installiert werden.</p>
<br/><p align="center">
<img src="pics/panel-mannschaftsmitglieder.png" width="773" height="510" /><br/>
<em>Mannschaftsmitglieder</em></p><br/>
<h4>Ergebnisse</h4>

<p>Die aktuellen Ergebnisse werden im unteren Bereich des Fensters dargestellt. Wenn Sie mehr Platz f&uuml;r andere Teile von JAuswertung ben&ouml;tigen, k&ouml;nnen Sie &uuml;ber die Optionen die "geteilte Darstellung" deaktivieren, wodurch die Ergebnisse &uuml;ber einen zus&auml;tzlichen Knopf in der linken Knopfleiste erreichbar sind und nicht mehr dauerhaft den unteren Fensterbereich belegen.</p>
<br/><p align="center">
<img src="pics/panel-ergebnisse.png" width="799" height="354" /><br/>
<em>Ergebnisse</em></p><br/>
<br/><p align="center">
<img src="pics/panel-ergebnisse-popup.png" width="154" height="101" /><br/>
<em>Ergebnisse: Rechtsklick</em></p><br/>

<p>Durch die Kn&ouml;pfe im oberen Bereich kann die gew&uuml;nschte Altersklasse sowie das Geschlecht ausgew&auml;hlt werden. Die Ansicht der Ergebniss kann auch zur Bearbeitung einzelner Schwimmer bzw. Mannschaften genutzt werden. &Uuml;ber einen Rechtsklick &ouml;ffnet sich das Popup-Men&uuml;, das bereits unter "Meldeliste" beschrieben wurde. Zus&auml;tzlich k&ouml;nnen bestimmte Funktionen per Doppelklick durchgef&uuml;hrt werden. Diese h&auml;ngen von der Spalte ab, in die geklickt wurde:
<ul><li>
<p>Platz, Name, Gliederung, Jahrgang, Punkte, Diff: &Ouml;ffnet das Fenster zum Bearbeiten eines Schwimmers bzw. einer Mannschaft.</p>
</li><li>
<p>Zeit, Punkte (Je Disziplin): &Ouml;ffnet ein Fenster zur Eingabe der Zeit f&uuml;r diese Diziplin.</p>
</li><li>
<p>Strafe (Je Disziplin): &Ouml;ffnet den Assistenten zur Vergabe einer Strafe f&uuml;r diese Disziplin.</p>
</li><li>
<p>HLW: &Ouml;ffnet ein Fenster zur Eingabe der HLW-Punkte.</p>
</li></ul>
</p>

<p><b>Hinweis:</b> Bei der HLW-Eingabe erm&ouml;glichen es die Texte "n" und "n.a." einen Schwimmer als "Nicht angetreten" zu markieren.</p>
<h4>Drucken</h4>

<p>Hier k&ouml;nnen die Daten in verschiedenen Varianten gedruckt werden. Die Kn&ouml;pfe sind nur dann aktiviert, wenn die entsprechenden Daten gedruckt werden k&ouml;nnen. Zu jeder Druckfunktion existiert eine Vorschau. &Uuml;ber diese kann auch das Seitenlayout eingestellt werden. Diese Einstellungen werden gespeichert und sind beim n&auml;chsten Start von JAuswertung wieder verf&uuml;gbar.</p>

<p>Um die Druckfunktionen &uuml;bersichtlicher zu gestalten wurden diese gruppiert. Die Gruppen haben die &Uuml;berschrift "Wettkampf", "Protokoll", "Ergebnisse", "Laufliste", "HLW-Liste" und "Vordrucke". Jede einzelne Gruppe k&ouml;nnen Sie durch eine Klick auf die Titelzeile ein- bzw. ausblenden, so dass Sie nur die Funktionen sehen, die Sie zur Zeit ben&ouml;tigen. Beim Start von JAuswertung ist nur die Gruppe "Wettkampf" ausgeklappt.</p>
<br/><p align="center">
<img src="pics/panel-drucken.png" width="517" height="248" /><br/>
<em>Drucken</em></p><br/>

<ul><li>
<p>Wettkampf:
<ul><li>
<p>Meldungen: Ausdruck einer kompakten Liste der Meldungen</p>
</li><li>
<p>Meldezeiten: Ausdruck aller Meldungen mit Meldezeiten</p>
</li><li>
<p>Startunterlagenkontrolle: Ausdruck der zur Kontrolle ausgelosten Teilnehmer bzw. Mannschaften</p>
</li><li>
<p>Dopingkontrolle: Ausdruck der zur Kontrolle ausgelosten Teilnehmer bzw. Mannschaften</p>
</li><li>
<p>Regelwerkseinstellungen: Detailierter Ausdruck aller Einstellung des Regelwerkseditors</p>
</li><li>
<p>Disziplinen: Kompakte Liste aller Disziplinen nach Altersklassen</p>
</li><li>
<p>Statistiken: Statistiken zum Wettkampf wie Teilnehmerzahlen und teilnehmende Gliederungen sowie gliederungssezifische Statistiken</p>
</li><li>
<p>Strafenkatalog: Liste aller Strafen des Strafenkatalogs</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-wettkampf.png" width="775" height="245" /><br/>
<em>Drucken: Wettkampf</em></p><br/>

<ul><li>
<p>Protokoll:
<ul><li>
<p>Protokoll: Vollst&auml;ndiges Protokoll des Wettkampfs gem&auml;&szlig; Regelwerk</p>
</li><li>
<p>Veranstaltungsinformationen: Ausdruck der Informationen aus "Datei" &rarr; "Eigenschaften"</p>
</li><li>
<p>Kampfrichter: Liste der Kampfrichter</p>
</li><li>
<p>Informationsseite: Ausdruck der Informationsseite aus "Datei" &rarr; "Eigenschaften"</p>
</li><li>
<p>Zielrichterentscheide: Liste der Zielrichterentscheide</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-protokoll.png" width="775" height="190" /><br/>
<em>Drucken: Protokoll</em></p><br/>

<ul><li>
<p>Ergebnisse:
<ul><li>
<p>Ergebnisse: Liste der Ergebnisse</p>
</li><li>
<p>Disziplinenwertung: Ergebnisse der Disziplinenwertung</p>
</li><li>
<p>Disziplinenwertung (altersklassen&uuml;bergreifend): Ergebnisse der Disziplinenwertung, wobei nur nach Disziplinen nicht aber nach Alterklassen unterschieden wird.</p>
</li><li>
<p>Gesamtwertung: Gesamtwertung des Wettkampfs</p>
</li><li>
<p>Siegerliste: Liste der ersten drei Pl&auml;tze f&uuml;r jede Altersklasse</p>
</li><li>
<p>Siegerliste je Disziplin: Liste der ersten drei Pl&auml;tze f&uuml;r jede Disziplin.</p>
</li><li>
<p>Medaillenspiegel: Ausdruck eines Medaillenspiegels</p>
</li><li>
<p>Laufzeiten: Tabellarischer Ausdruck der Zeiten nach L&auml;ufen</p>
</li><li>
<p>Strafenliste: Liste der vergebenen Strafen</p>
</li><li>
<p>Urkunden: Ausgef&uuml;llte Urkunden</p>
</li><li>
<p>Urkunden der Disziplinenwertung: Ausgef&uuml;llte Urkunden f&uuml;r die Disziplinenwertung</p>
</li><li>
<p>Weitermeldung: Ausdruck eines Meldebogens mit den Ergebnissen des Wettkampfs</p>
</li><li>
<p>HLW-Ergebnisse: Ausdruck der Ergebnisse der HLW</p>
</li><li>
<p>Schnellste Zeiten: Schnellste Zeiten je Disziplin und Altersklasse</p>
</li><li>
<p>Gebrochene Rec-Werte: Liste der gebrochenen Rec-Werte</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-ergebnisse.png" width="861" height="465" /><br/>
<em>Drucken: Ergebnisse</em></p><br/>

<ul><li>
<p>Laufliste:
<ul><li>
<p>Laufliste: Tabellarische Laufliste</p>
</li><li>
<p>Sprecherliste: Detaillierte Laufliste f&uuml;r Veranstaltungssprecher</p>
</li><li>
<p>Laufliste f&uuml;r Kampfrichter: Kompakte und &uuml;bersichtliche Laufliste f&uuml;r Kampfrichter (Wenn die Schriftart nicht zu breit ist, werden zwei L&auml;ufe in einer Zeile ausgedruckt)</p>
</li><li>
<p>Lauf&uuml;bersicht: Kurze &Uuml;bersicht &uuml;ber den Verlauf des Wettkampfs</p>
</li><li>
<p>Laufeinteilung: Liste der Teilnehmer bzw. Mannschaften mit den jeweiligen Starts</p>
</li><li>
<p>Kompakte Laufeinteilung: Kompakte Version der Laufeinteilung (ob diese gedruckt werden kann, h&auml;ngt von der Laufliste ab)</p>
</li><li>
<p>Bahnenliste: Liste der Starts je Bahn f&uuml;r Zeitnehmer</p>
</li><li>
<p>Ausgef&uuml;llte Startkarten: Ausgef&uuml;llte Startkarten (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li><li>
<p>Ausgef&uuml;llte Zieleinlaufkarten: Zieleinlaufkarten mit ausgef&uuml;lltem Lauf und Disziplin (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-laufliste.png" width="893" height="300" /><br/>
<em>Drucken: Laufliste</em></p><br/>

<ul><li>
<p>HLW-Liste
<ul><li>
<p>HLW-Liste: Tabellarische HLW-Laufliste</p>
</li><li>
<p>Puppenliste: Liste der Teilnehmer je Bahn f&uuml;r HLW-Kampfrichter</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Startkarten: Ausgef&uuml;llte HLW-Startkarten f&uuml;r Kampfrichter (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Checklisten: Ausgef&uuml;llte HLW-Checklisten f&uuml;r Kampfrichter</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Startkarten (ohne Zeiten und Bahnen): Ausgef&uuml;llte HLW-Startkarten - die Fehler Zeit und Bahn sind jedoch leer (Weitere Informationen zum Umgang mit dem Ausdruck finden sich im Dokument "Startkartendruck")</p>
</li><li>
<p>Ausgef&uuml;llte HLW-Checklisten (ohne Zeiten und Bahnen): Ausgef&uuml;llte HLW-Checklisten - die Fehler Zeit und Bahn sind jedoch leer</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-hlw-liste.png" width="893" height="190" /><br/>
<em>Drucken: HLW-Liste</em></p><br/>

<ul><li>
<p>Vordrucke:
<ul><li>
<p>Startkarten: Leere Startkarten</p>
</li><li>
<p>HLW-Startkarten: Leere HLW-Startkarten</p>
</li><li>
<p>HLW-Checkliste: Leere HLW-Checkliste</p>
</li><li>
<p>Zieleinlaufkarten: Leere Zieleinlaufkarten</p>
</li><li>
<p>Fehlermeldekarten: Leere Fehlermeldekarten</p>
</li></ul>
</p>
</li></ul>
<br/><p align="center">
<img src="pics/panel-drucken-vordrucke.png" width="893" height="190" /><br/>
<em>Drucken: Vordrucke</em></p><br/>

<p>Einige Druckfunktionen werden durch die Ausgabefilter beeinflusst. Genaueres dazu erfahren Sie unter <a href="jauswertungmenus.html#ausgabefilterbearbeiten">Ausgabefilter bearbeiten</a> und <a href="knopfleisteoben.html#ausgabefilter">Ausgabefilter ausw&auml;hlen</a>. Wird eine Druckfunktion gerade durch einen Ausgabefilter beeinflusst, wird dies durch ein Symbol mit einem Auge dargestellt.</p>

<p><b>Tipp 1:</b> Zur Unterst&uuml;tzung beim Drucken von Ergebnissen und Protokollen werden unvollst&auml;ndige Eingaben, d.h. fehlende Zeiten bzw. HLW-Punkte, durch ein gelbes Ausrufezeichen signalisiert.</p>

<p><b>Tipp 2:</b> Die Startkarten f&uuml;r den Schwimmwettkampf und die HLW werden so gedruckt, dass die Startkarten einer Bahn hintereinander liegen.</p>

<p><b>Tipp 3:</b> Wenn Ausgabefilter aktiv sind, werden Funktionen, die davon betroffen sind, mit einem Symbol "Auge" markiert.</p>
</body>
</html>
