<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-15" />
<meta name="author" content="Dennis Fabri" />
<meta name="date" content="20161012224319" />
<!-- created with HelpSetMaker, ID=d02f991f -->
<title>Vorbereitungen</title>
</head>
<body class="doc">
<h1 class="title">Vorbereitungen</h1>

<p>In dieser Phase gibt es vor allem zwei Fragen, die beantwortet werden m&uuml;ssen:</p>

<ol><li>
<p>Nach welchem Regelwerk soll geschwommen werden?</p>
</li><li>
<p>Wie sollen die Meldeunterlagen aussehen?</p>
</li><li>
<p>Soll die Meldung elektronisch erfolgen?</p>
</li></ol>
<h2>Regelwerk</h2>

<p>Die Frage des Regelwerks stellt sich bei den meisten Wettk&auml;mpfen. Dabei m&uuml;ssen folgende Kategorien von Wettk&auml;mpfen unterschieden werden:</p>

<ul><li>
<p>Meisterschaften</p>
</li><li>
<p>Freundschaftswettk&auml;mpfe (FWK)</p>
</li><li>
<p>Spa&szlig;wettk&auml;mpfe</p>
</li></ul>

<p>Bei Meisterschaften muss das aktuelle Regelwerk genutzt werden. FWKs werden meist in Anlehnung an das aktuelle Regelwerk durchgef&uuml;hrt und die Diszipline direkt oder leicht abgewandelt &uuml;bernommen. Bei Spa&szlig;wettk&auml;mpfen werden in der Regel vollst&auml;ndig eigene Disziplinen erstellt. Letztendlich bilden die gew&auml;hlten Disziplinen auch die Grundlage f&uuml;r die Ausschreibung und die Meldeunterlagen. Wenn Sie eigene Disziplinen einf&uuml;hren, m&uuml;ssen Sie mit dem <a href="akse.html#akse">Regelwerkseditor</a> diese eingeben. Nur dann k&ouml;nnen Sie sp&auml;ter einen Wettkampf mit diesen Disziplinen durchf&uuml;hren.</p>
<h2>Meldungeunterlagen</h2>

<p>Die Meldundeunterlagen sollten so aussehen, wie die, die auf www.dennismueller.de ver&ouml;ffentlicht sind. Sie finden dort unterschiedliche Vorlagen f&uuml;r die jeweiligen Wettk&auml;mpfe z.B. Meisterschaften oder Freundschaftswettk&auml;mpfe.</p>
<h2>Elektronische Meldung</h2>

<p>Die elektronische Meldung hat folgende Vorteile:
<ul><li>
<p>Einfachere &Uuml;bernahme der Daten in das Auswertungsprogramm</p>
</li><li>
<p>Die Eingabe kann eingeschr&auml;nkt werden, so dass nur sinnvolle Eingaben m&ouml;glich sind</p>
</li><li>
<p>Kein Papier und keine Versandkosten</p>
</li></ul>
</p>

<p>Sie hat allerdings auch einige Nachteile:
<ul><li>
<p>Ein Internetzugang f&uuml;r jede meldende Gliederung ist n&ouml;tig.</p>
</li><li>
<p>Ein gewisses technisches Verst&auml;ndnis wird vorausgesetzt.</p>
</li><li>
<p>Ggf. m&uuml;ssen die Meldelisten in unterschiedlichen Dateiformaten zur Verf&uuml;gung gestellt werden, um keine Personen auszuschlie&szlig;en.</p>
</li></ul>
</p>

<p>Letztendlich ist es ihre Entscheidung.</p>
</body>
</html>
