<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-15" />
<meta name="author" content="Dennis Fabri" />
<meta name="date" content="20161012224319" />
<!-- created with HelpSetMaker, ID=a3c6f77c -->
<title>W&auml;hrend des Wettkampfs</title>
</head>
<body class="doc">
<h1 class="title">W&auml;hrend des Wettkampfs</h1>

<p>W&auml;hrend des Wettkampfs haben Sie eigentlich nur zwei Aufgaben:</p>

<ol><li>
<p>Eingabe von Zeiten und Strafen</p>
</li><li>
<p>Aushang von (Zwischen-) Ergebnissen</p>
</li></ol>

<p>Bei Freundschafts- und Spa&szlig;wettk&auml;mpfen kommen noch regelm&auml;&szlig;ige &Auml;nderungen von Name und Teilnahmen hinzu, dies soll aber nicht weiter st&ouml;ren.</p>
<h2>Eingabe von Zeiten</h2>

<p>Solange Sie die Laufeinteilung des Wettkampfs ebenfalls mit JAuswertung durchf&uuml;hren, werden Sie f&uuml;r die Eingabe der Zeiten nicht viel Zeit ben&ouml;tigen. W&auml;hlen Sie in der linken Knopfleiste dazu den Punkt "Laufzeiten". Daraufhin erscheint auf der rechten Seite eine Eingabemaske, in der Sie die Zeiten eines Laufs eingeben k&ouml;nnen.</p>

<p>Die Zeiten werden f&uuml;r jede Bahn ohne Zusatzzeichen eingegeben. Aus der Zeit 1:02,34 wird als 10234. Im Feld neben dem Eingabefeld wird dann die Zeit korrekt (mit Zeichen) dargestellt. Zwischen den einzelnen Bahnen k&ouml;nnen Sie mit der Pfeiltaste unten (n&auml;chste Bahn) und der Pfeiltaste oben (vorherige Bahn) wechseln. Zwischen den L&auml;ufen k&ouml;nnen Sie wechseln, indem Sie in der der letzten belegten Bahn die Pfeiltaste unten (n&auml;chster Lauf) und in der ersten belegten Bahn die Pfeiltaste oben (vorheriger Lauf) dr&uuml;cken. Dar&uuml;ber hinaus k&ouml;nnen Sie einen Schwimmer mit n als "Nicht angetreten" markieren. Mit # k&ouml;nnen Sie vergebene Strafen annullieren.</p>

<p>Bei Freundschafts- und Spa&szlig;wettk&auml;mpfen k&ouml;nnen Sie zus&auml;tzlich &uuml;ber d (Disqualifikation), p (Strafpunkte) und a (Ausschluss) Strafen vergeben. F&uuml;r Meisterschaften sollten die Strafen genau (Mit Begr&uuml;ndung und Strafencode) festgelegt werden.</p>

<p>Nachdem Sie einen Lauf eingegeben haben, k&ouml;nnen Sie sich mit z oder , den Zieleinlauf anzeigen lassen. Dieser sollte mit dem offiziellen Zieleinlauf &uuml;bereinstimmen. Ist dies nicht der Fall, sollten Sie zuerst Ihre Eingabe &uuml;berpr&uuml;fen und in dem Fall, dass die Eingabe korrekt ist, den Lauf zur endg&uuml;ltigen Entscheidung weiterreichen. Normalerweise &uuml;bernimmt die Kampfrichterposition "Auswerter" (Sie sind streng genommen der "Protokollf&uuml;hrer") bereits diese &Uuml;berpr&uuml;fung. Es gibt aber F&auml;lle bei denen diese Position nicht besetzt wird (z.B. bei Freundschaftswettk&auml;mpfen) oder sich der Auswerter auch mal "verliest".</p>
<h3>&Uuml;bersicht der Tastaturk&uuml;rzel</h3>

<ul><li>
<p>Cursor unten: N&auml;chste Zeile</p>
</li><li>
<p>Cursor oben: Vorherige Zeile</p>
</li><li>
<p>n: Nicht Angetreten</p>
</li><li>
<p>d: Disqualifikation</p>
</li><li>
<p>a: Ausschluss</p>
</li><li>
<p>p: Strafpunkte</p>
</li><li>
<p>c: Strafenvergabe nach Code</p>
</li><li>
<p>#: Strafe annullieren</p>
</li><li>
<p>z oder ,: Zieleinlauf anzeigen</p>
</li></ul>

<p><b>Tipp:</b> Zur Eingabe von Zeiten in dieser Maske gen&uuml;gt der Nummernblock einer Tastatur.</p>
<h2>Eingabe von Strafen</h2>

<p>Die Eingabe von Strafen kann wie oben angegeben &uuml;ber Tastaturk&uuml;rzel bei der Zeiteneingabe genutzt werden. Alternativ k&ouml;nnen Sie den Knopf "Strafe" nutzen, der in der Zeiteneingabe und in der Laufzeiteneingabe zur Verf&uuml;gung steht.</p>

<p>Eine weitere Alternative besteht darin, in der Ergebnistabelle auf das entsprechende Feld (also Zeile des betroffenen Schwimmers und Spalte der Disziplin) mit der rechten Maustaste zu klicken und dort "Strafe vergeben" auszuw&auml;hlen.</p>
<h2>Aushang von (Zwischen-) Ergebnissen</h2>

<p>Im Bereich "Ergebnisse" k&ouml;nnen Sie Ergebnisse und Zwischenergebnisse gedruckt werden. In der Auswahlbox k&ouml;nnen Sie ausw&auml;hlen bis zu welcher Disziplin der Ausdruck erfolgen soll. Damit k&ouml;nnen Sie auch dann noch Zwischenergebnisse aush&auml;ngen, wenn Sie bereits Zeiten der n&auml;chsten Disziplin eingegeben haben.</p>

<p><b>Tipp 1:</b> Ein gelbes Dreieck mit wei&szlig;em Blitz signalisiert, dass Sie noch nicht alle Daten eingegeben haben, die f&uuml;r diesen Ausdruck ben&ouml;tigt werden. W&auml;hlen Sie dann "Bearbeiten" &rarr; "Daten pr&uuml;fen", um eine Liste aller noch nicht eingegebenen Daten zu erhalten. Dort ist nat&uuml;rlich auch die direkte Eingabe m&ouml;glich.</p>

<p><b>Tipp 2:</b> Nutzen Sie regelm&auml;&szlig;ig die Funktion "Bearbeiten" &rarr; "Daten pr&uuml;fen". Damit k&ouml;nnen Sie m&ouml;gliche Fehler bereits fr&uuml;h erkennen.</p>

<p><b>Tipp 3:</b> Die HLW-Punkte werden nur mit den Endergebnissen gedruckt.</p>

<p><b>Tipp 4:</b> Da mit dem Regelwerk 2007 eine Durchsage von Strafpunkten nicht mehr notwendig ist, kann es sinnvoll sein zus&auml;tzlich zu den Ergebnissen eine Strafenliste auszuh&auml;ngen.</p>
</body>
</html>
