<html>
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<title>Regelwerkseditor</title>
</head>
<body class="doc">
<h1>Regelwerkseditor</h1>

<p><a name="akse">Der Regelwerkseditor dient zum Festlegen der folgenden Punkte:</p>

<ul><li>
<p>Formel zur Punktevergabe</p>
</li><li>
<p>Anzahl und Namen der Alterklassen</p>
</li><li>
<p>Anzahl der Disziplinen je Altersklasse (inkl. Festlegung von Rec-Werten und Namen)</p>
</li><li>
<p>Durchf&uuml;hrung einer HLW</p>
</li><li>
<p>Wertung in der Gesamtwertung</p>
</li><li>
<p>Einzelwertung ggf. mit HLW (Pl&auml;tze werden auch f&uuml;r jede einzelne Disziplin vergeben ggf. werden nur Teilnehmer ber&uuml;cksichtigt, die die HLW bestanden haben)</p>
</li><li>
<p>Auswahl von Disziplinen (Teilnehmer m&uuml;ssen nicht alle Disziplinen absolvieren. In diesen F&auml;llen kann festgelegt werden, wie viele Disziplinen mindestens und wie viele maximal geschwommen werden d&uuml;rfen.)</p>
</li><li>
<p>Bevorzugte Sortiermethode bei der Lauflistenerstellung</p>
</li></ul>
<br><p align="center">
<img src="pics/aks-einzel.png" width="832" height="700"><br>
<em>Regelwerkseditor (Einzel)</em></p><br>
<br><p align="center">
<img src="pics/aks-mannschaft.png" width="832" height="700"><br>
<em>Regelwerkseditor (Mannschaft)</em></p><br>
<br><p align="center">
<img src="pics/aks-datei.png" width="163" height="197"><br>
<em>Men&uuml;: Datei</em></p><br>
<br><p align="center">
<img src="pics/aks-neu.png" width="445" height="267"><br>
<em>Neues Regelwerk anlegen</em></p><br>
<br><p align="center">
<img src="pics/aks-bearbeiten.png" width="127" height="69"><br>
<em>Men&uuml;: Bearbeiten</em></p><br>

<p>Die zu bearbeitende Altersklasse kann in der linken Liste ausgew&auml;hlt werden. Ihre Einstellungen werden dann im rechten Bereich dargestellt. Mittels Drag'n'Drop k&ouml;nnen Sie die Reihenfolge der Altersklassen &auml;ndern und dar&uuml;ber hinaus steht ihnen ein Kontextmen&uuml; (rechte Maustaste) mit weiteren Funktionen wie z.B. dem Hinzuf&uuml;gen einer neuen Altersklasse zur Verf&uuml;gung.</p>
<h3>Regelwerkseditor w&auml;hrend eines Wettkampfs</h3>

<p>Wird der Regelwerkseditor w&auml;hrend der Auswertung eines Wettkampfes gestartet, k&ouml;nnen nur die folgenden Werte ge&auml;ndert werden:</p>

<ul><li>
<p>Formel zur Punktevergabe</p>
</li><li>
<p>Name der Altersklassen</p>
</li><li>
<p>Anzahl, Name und Rec-Werte der Disziplinen</p>
</li><li>
<p>Teilnahme an der HLW</p>
</li><li>
<p>Wertung in der Gesamtwertung</p>
</li><li>
<p>Einzelwertung ggf. mit HLW (Pl&auml;tze werden auch f&uuml;r jede einzelne Disziplin vergeben ggf. werden nur Teilnehmer ber&uuml;cksichtigt, die die HLW bestanden haben)</p>
</li><li>
<p>Auswahl von Disziplinen (Teilnehmer m&uuml;ssen nicht alle Disziplinen absolvieren. In diesen F&auml;llen kann festgelegt werden, wie viele Disziplinen mindestens und wie viele maximal geschwommen werden d&uuml;rfen.)</p>
</li><li>
<p>Bevorzugte Sortiermethode bei der Lauflistenerstellung</p>
</li></ul>
<h3>Gesamtwertung</h3>

<p>Dar&uuml;ber hinaus kann festgelegt werden, ob eine Gesamtwertung (eine Bewertung des Erfolgs der einzelnen Gliederungen) durchgef&uuml;hrt werden soll. Dabei stehen folgende Einstellungen zur Verf&uuml;gung:
<ul><li>
<p>"Gliederung muss an allen Altersklassen teilnehmen": Eine Gliederung, die in der Gesamtwertung aufgef&uuml;hrt werden m&ouml;chte, muss an allen Altersklassen teilnehmen. Dabei werden nur die Altersklassen ber&uuml;cksichtigt, die mit "Gesamtwertung" markiert sind.</p>
</li><li>
<p>"Punkte je Altersklasse normieren": Die Punkte jeder Altersklasse werden durch die Anzahl der Disziplinen geteilt. Dadurch wird sichergestellt, dass alle Altersklassen gleich gewichtet werden.</p>
</li><li>
<p>Gesamtwertungsmodus:
<ul><li>
<p>"Alle Mannschaften bzw. Teilnehmer werten": Es werden die Punkte aller Teilnehmer zur Gesamtwertung addiert.</p>
</li><li>
<p>"Beste Mannschaft bzw. besten Teilnehmer je Disziplin werten": Je Altersklasse und Disziplin wird jeweils nur der beste Teilnehmer gewertet.</p>
</li><li>
<p>"Beste Mannschaft bzw. besten Teilnehmer werten": In jeder Altersklasse wird nur der beste Teilnehmer gewertet.</p>
</li></ul>
</p>
</li></ul>
</p>

<p>Auch w&auml;hrend eines Wettkampfes k&ouml;nnen die Altersklassen in einer einzelnen Datei gespeichert werden, so dass diese sp&auml;ter wiederverwendet werden k&ouml;nnen.</p>
<br><p align="center">
<img src="pics/aks-eigenschaften-1.png" width="701" height="695"><br>
<em>Eigenschaften: Allgemein</em></p><br>
<br><p align="center">
<img src="pics/aks-eigenschaften-2.png" width="701" height="695"><br>
<em>Eigenschaften: Gesamtwertung</em></p><br>
</body>
</html>
