<html>
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<title>JAuswertung</title>
</head>
<body class="doc">
<h1>JAuswertung</h1>

<p>JAuswertung ist ein Programm der neuesten Generation zur Durchf&uuml;hrung und Protokollierung von Wettk&auml;mpfen. Dabei spielt es keine Rolle, ob Sie Meisterschaften oder Freundschaftswettk&auml;mpfe durchf&uuml;hren wollen. Sie sind nicht an vorgegebene Disziplinen gebunden und k&ouml;nnen einfach neue Altersklassen, Disziplinen, Regelverst&ouml;&szlig;e u. &auml;. festlegen. Auch um die Einteilung der L&auml;ufe (sowohl f&uuml;r den schwimmerischen Teil, als auch bei der HLW) m&uuml;ssen Sie sich keine Sorgen machen. JAuswertung kann eine Laufeinteilung nach Ihren W&uuml;nschen erstellen. Sollten Sie diese sp&auml;ter anpassen wollen, wird JAuswertung Sie auch dabei unterst&uuml;tzen. </p>

<p>Zentrales Augenmerk wurde auf Bedienkomfort und hohe Eingabegeschwindigkeit gelegt. Wenn Sie z.B. in den Ergebnissen einen Fehler entdecken, k&ouml;nnen Sie diesen dort direkt &auml;ndern, wobei es keine Rolle spielt, ob es sich um eine falsche Zeit, einen falsch eingetragenen Regelversto&szlig; oder einen falsch geschriebenen Namen handelt. Die laufweise Zeiteneingabe erm&ouml;glicht es Ihnen, Zeiten so wie sie bei Ihnen ankommen, direkt einzugeben. Diese Eingabemethode ist so effizient, dass Sie keine Probleme h&auml;tten, mehrere Wettk&auml;mpfe gleichzeitig auszuwerten.</p>

<p>Meldungen werden meist in einer Tabellenkalkulation verwaltet, bis Sie dann in ein Auswertungsprogramm &uuml;bertragen werden. Auch dabei unterst&uuml;tzt Sie JAuswertung. Wenn die Daten als Excel- oder CSV-Datei vorliegen, k&ouml;nnen diese direkt importiert werden. Bei vielen Wettk&auml;mpfen wird ein Gesamtsieg an die erfolgreichste Gliederung vergeben. Auch eine Gesamtwertung m&uuml;ssen Sie nicht von Hand berechnen. Aktivieren Sie einfach die Gesamtwertung und stellen Sie sie nach Ihren W&uuml;nschen ein.</p>

<p>Dar&uuml;ber hinaus kann JAuswertung die eingegebenen Daten &uuml;berpr&uuml;fen und viele Fehler wie z.B. fehlende Zeiten oder bei nachtr&auml;glich hinzugef&uuml;gten Teilnehmern fehlende Eintragungen in die Laufliste erkennen. Anstatt also an verschiedenen Orten die Korrektheit Ihrer Daten &uuml;berpr&uuml;fen zu m&uuml;ssen, k&ouml;nnen Sie diese Informationen an einer Stelle abfragen und sofern sinnvoll auch direkt beheben. Weiterhin kann JAuswertung auch &uuml;berpr&uuml;fen, ob die eingegebenen Daten plausibel sind und Sie so z.B. bei sehr niedrigen oder hohen Zeiten informieren.</p>
<br><p align="center">
<img src="pics/jauswertung.png" width="699" height="652"><br>
<em>JAuswertung</em></p><br>
</body>
</html>
