<html>
<head>
<link rel="stylesheet" href="style.css" type="text/css"></link>
<title>Vor dem Wettkampf</title>
</head>
<body class="doc">
<h1>Vor dem Wettkampf</h1>

<p>Kurz vor dem Wettkampf stehen folgende T&auml;tigkeiten an:</p>

<ul><li>
<p>Eingabe bzw. Import der Meldungen</p>
</li><li>
<p>Erstellen einer offiziellen Meldeliste</p>
</li><li>
<p>Erstellen von Lauf- und HLW-Listen</p>
</li><li>
<p>Ausdruck von Unterlagen f&uuml;r Kampfrichter und Betreuer</p>
</li></ul>
<h2>Eingabe bzw. Import der Meldungen</h2>

<p>Wie die &Uuml;berschrift bereits sagt, haben Sie zwei M&ouml;glichkeiten die Daten in einen Wettkampf einzupflegen: Eingabe oder Import. Bevor Sie dies jedoch machen k&ouml;nnen m&uuml;ssen Sie einen neuen Wettkampf erstellen. Die tun Sie &uuml;ber "Datei" -&gt; "Neu". Hier k&ouml;nnen Sie die Art des Wettkampfs und das verwendete Regelwerk ausw&auml;hlen. Wenn Sie ein eigenes Regelwerk (&uuml;ber den Regelwerkseditor) definiert haben, k&ouml;nnen Sie dieses &uuml;ber "benutzerdefiniert" ausw&auml;hlen.</p>

<p>Wollen Sie eine Meldeliste importieren, so k&ouml;nnen Sie dies &uuml;ber "Datei" -&gt; "Importieren" tun. Folgen Sie einfach den Schritten des Importassistenten. Am Ende des Assistenten werden ihnen alle Eintr&auml;ge angezeigt, die importiert werden. Sie k&ouml;nnen so &uuml;berpr&uuml;fen, ob wirklich alles importiert werden konnte.</p>

<p>Wenn Sie die Daten manuell eingeben wollen, so w&auml;hlen Sie in der linken Knopfleiste den Punkt "Eingabe". Im Bereich rechts davon erscheint nun eine Eingabemaske. Hier k&ouml;nnen Sie die Teilnehmer bzw. Mannschaften nacheinander eingeben. Wenn eine Gliederung mehrere Mannschaften in einer Altersklasse gemeldet hat, k&ouml;nnen Sie die entsprechende Menge im Feld "Anzahl" eingeben und den darunterliegenenden Knopf "Hinzuf&uuml;gen" w&auml;hlen. Es werden dann automatisch mehrere Mannschaften hinzugef&uuml;gt. Die Namen der Mannschaften werden dabei durchnummeriert. Nachdem Sie auf diese Weise alle Teilnehmer bzw. Mannschaften eingetragen haben, k&ouml;nnen Sie noch &uuml;ber den Men&uuml;punkt "Bearbeiten" -&gt; "Meldezeiten" die Meldezeiten der einzelnen Schwimmer eintragen. Dies ist aber nur erforderlich, wenn Sie die Laufliste nach Meldezeiten erstellen wollen.</p>
<h2>Erstellen einer offiziellen Meldeliste</h2>

<p>Nachdem Sie die Eingabe abgeschlossen haben, k&ouml;nnen Sie &uuml;ber den Men&uuml;punkt "Datei" -&gt; "Exportieren", die Meldeliste in einem Format ihrer Wahl exportieren. Am besten geeignet ist sind zu diesem Zweck die Formate Excel und PDF.</p>
<h2>Erstellen von Lauf- und HLW-Listen</h2>

<p>Da die Erstellung von Lauf- und HLW-Listen im wesentlichen gleich funktioniert, soll hier nur die Erstellung von Lauflisten besprochen werden. &Uuml;ber den Men&uuml;punkt "Bearbeiten" -&gt; "Laufliste" -&gt; "Neu" rufen Sie den Assistenten zur Erstellung von Lauflisten auf. Dieser f&uuml;hrt Sie schrittweise durch die Erstellung. </p>

<p>&Uuml;ber den Men&uuml;punkt "Bearbeiten" -&gt; "Laufliste" -&gt; "Bearbeiten", k&ouml;nnen Sie sich das Ergebnis anzeigen lassen und &auml;ndern. Dies ist vor allem dann sinnvoll, wenn einige Altersklassen nicht so stark besetzt sind. Sie k&ouml;nnen hier einzelne Eintr&auml;ge durch Doppelklick entfernen oder via Drag'n'Drop verschieben. Entfernte Eintr&auml;ge werden (genauso wie nach der Erstellung eingegebene Teilnehmer) in der Warteliste aufgef&uuml;hrt und k&ouml;nnen sp&auml;ter wieder in die Laufliste &uuml;bernommen werden. Sie k&ouml;nnen also auf diese Weise z.B. L&auml;ufe zusammenlegen oder die Zusammenstellung &auml;ndern. Ob Sie dabei Altersklassen oder Disziplinen mischen, wird ihnen f&uuml;r jeden Lauf angezeigt:
<ul><li>
<p>Wenn Sie in einem Lauf AK 12 m&auml;nnlich und weiblich mischen, so steht in der zweiten Spalte "AK 12 gemischt".</p>
</li><li>
<p>Wenn Sie in einem Lauf AK 12 und AK 13/14 mischen, so steht in der zweiten Spalte "Gemischt".</p>
</li></ul>
</p>

<p>&Uuml;ber ein Kontextmen&uuml; (rechte Maustaste) k&ouml;nnen Sie neue L&auml;ufe hinzuf&uuml;gen bzw. bestehende entfernen. Eingef&uuml;gte L&auml;ufe werden dabei durchbuchstabiert, so dass ein Lauf, der nach Lauf 10 eingef&uuml;gt wird, z.B. 10a hei&szlig;t. So m&uuml;ssen die Nummern der nachfolgenden L&auml;ufe nicht ver&auml;ndert werden. Dies ist vor allem w&auml;hrend des Wettkampfs n&ouml;tig, damit gedruckte Startkarten ihre G&uuml;ltigkeit behalten. Da dies bisher nicht geschehen ist, kann die Nummerierung der L&auml;ufe &uuml;ber das Men&uuml; "Datei" zur&uuml;ckgesetzt werden, so dass die L&auml;ufe wieder fortlaufend nummeriert sind.</p>
<h2>Ausdruck von Unterlagen f&uuml;r Kampfrichter und Betreuer</h2>

<p>JAuswertung bietet eine Reihe von Druckm&ouml;glichkeiten f&uuml;r unterschiedliche Zielgruppen. Dies erm&ouml;glicht es, f&uuml;r jeden die gew&uuml;nschten Information so zu pr&auml;sentieren, wie er Sie ben&ouml;tigt.</p>

<ul><li>
<p>Zeitnehmer: Ausgef&uuml;llte Startkarten, Bahnenliste (Liste aller Schwimmer einer Bahn)</p>
</li><li>
<p>Zieleinlauf: Ausgef&uuml;llte Zieleinlaufkarten (Lauf, Wettkampf, Altersklasse und Geschlecht)</p>
</li><li>
<p>Sprecher: Sprecherliste (Detailierte Laufliste)</p>
</li><li>
<p>HLW-Kampfrichter: Ausgef&uuml;llte HLW-Startkarten oder -Checklisten, Puppenliste (Liste aller Teilnehmer an einer Puppe)</p>
</li><li>
<p>Wettkampfleiter, Starter, Wenderichter, ...: Lauf&uuml;bersicht</p>
</li><li>
<p>Betreuer und Schwimmer: (kompakte) Laufeinteilung</p>
</li></ul>

<p>Dar&uuml;ber hinaus sollten noch eine Reihe von nicht ausgef&uuml;llten Zieleinlaufkarten, Startkarten etc. vorhanden sein. Diese k&ouml;nnen Sie ebenfalls mit JAuswertung ausdrucken (Bereich "Vordrucke").</p>

<p><b>Anmerkung:</b> Die kompakten Laufeinteilungen stehen nur zur Verf&uuml;gung, wenn die Laufliste einige Anforderungen erf&uuml;llt. Ist dies nicht der Fall m&uuml;ssen Sie normalen Laufeinteilungen nutzen.</p>
</body>
</html>
